Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: Mapping modules can be called more than one time during a normal communication, take a look to the following examples.
hu: A leképező modulok egynél több alkalommal is meghívhatók egy normál kommunikáció közben. Vessen egy pillantást a következő példákra.

source: <emphasis>OTRS as provider example:</emphasis>
hu: <emphasis>OTRS mint szolgáltató példa:</emphasis>

source: The remote system sends the request with the data in the remote system format
hu: A távoli rendszer elküldi a kérést az adatokkal a távoli rendszer formátumában

source: The data is mapped from the remote system format to the OTRS format
hu: Az adatok leképezésre kerülnek a távoli rendszer formátumáról az OTRS formátumára

source: OTRS performs the operation and return the response in OTRS format
hu: Az OTRS végrehajtja a műveletet, és visszaadja a választ az OTRS formátumában

source: The data is mapped from the OTRS format to the remote system format
hu: Az adatok leképezésre kerülnek az OTRS formátumáról a távoli rendszer formátumára

source: The response with the data in the remote system format is sent to the remote system
hu: A válasz a távoli rendszer formátumában lévő adatokkal elküldésre kerül a távoli rendszernek

source: <emphasis>OTRS as requester example:</emphasis>
hu: <emphasis>OTRS mint kérelmező példa:</emphasis>

source: OTRS prepares the request to the remote system using the data in the OTRS format
hu: Az OTRS előkészíti a kérést a távoli rendszerhez az OTRS formátumában lévő adatokkal

source: The request is sent to the remote system which performs the action and sends the response back to OTRS with the data in remote system format
hu: A kérés elküldésre kerül a távoli rendszernek, amely végrehajtja a műveletet, és visszaküldi a választ az OTRS-nek a távoli rendszer formátumában lévő adatokkal

source: The data is mapped form remote system format (again) to the OTRS format
hu: Az adatok (ismét) leképezésre kerülnek a távoli rendszer formátumáról az OTRS formátumára

source: OTRS processes the response
hu: Az OTRS feldolgozza a választ

source: Mapping backend
hu: Leképező háttérprogram

source: Generic Interface provides a mapping module called <emphasis>Simple</emphasis>. With this module most of the data transformations including key and value mapping can be done, and also it defines rules for to handling the default mappings for both keys and values.
hu: Az általános felület biztosít egy <emphasis>Simple</emphasis> nevű leképezőmodult. Ezzel a modullal a legtöbb adatátalakítás (beleértve a kulcs és érték leképezést) elvégezhető, és szabályokat is meghatároz az alapértelmezett leképezések kezeléséhez mind a kulcsoknál, mind az értékeknél.

source: So it is highly probable that you don't need to develop a custom mapping module. Please check <emphasis>Simple</emphasis> mapping module (<filename>Kernel/GenericInterface/Mapping/Simple.pm</filename>) and its on-line documentation before continue.
hu: Ezért erősen valószínű, hogy nem lesz szüksége egy egyéni leképezőmodul kifejlesztésére. A folytatás előtt nézze meg a <emphasis>Simple</emphasis> leképezőmodult (<filename>Kernel/GenericInterface/Mapping/Simple.pm</filename>) és annak internetes dokumentációját.

source: If <emphasis>Simple</emphasis> mapping module does not match your needs then we will show how to develop a new mapping backend. Each mapping backend has to implement these subroutines:
hu: Ha a <emphasis>Simple</emphasis> leképezőmodul nem felel meg az igényeinek, akkor meg fogjuk mutatni, hogy hogyan lehet kifejleszteni egy új leképező háttérprogramot. Minden egyes leképező háttérprogramnak meg kell valósítania ezeket a szubrutinokat:

source: We should implement each one of this methods in order to be able to map the data in the communication, handled either by the requester or provider. All mapping backends are handled by the mapping module (<filename>Kernel/GenericInterface/Mapping.pm</filename>).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk az adatok leképezésére a kommunikációban, amelyet vagy a kérelmező, vagy a szolgáltató kezel. Az összes leképező háttérprogramot a leképezőmodul kezeli (<filename>Kernel/GenericInterface/Mapping.pm</filename>).

source: In this section a sample mapping module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta leképezőmodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.

source: # -- # Kernel/GenericInterface/Mapping/Test.pm - GenericInterface test data mapping backend # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Mapping::Test; use strict; use warnings; use Kernel::System::VariableCheck qw(IsHashRefWithData IsStringWithData); our $ObjectManagerDisabled = 1;
hu: # -- # Kernel/GenericInterface/Mapping/Test.pm - Általános felület teszt adatleképező háttérprogram # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Mapping::Test; use strict; use warnings; use Kernel::System::VariableCheck qw(IsHashRefWithData IsStringWithData); our $ObjectManagerDisabled = 1;

source: This is common header that can be found in common OTRS modules. The class/package name is declared via the <literal>package</literal> keyword.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a <literal>package</literal> kulcsszón keresztül van deklarálva.

source: We also include <literal>VariableCheck</literal> module to perform certain validation over some variables. Mappings can not be instantiated by the Object Manager.
hu: Felveszünk egy <literal>VariableCheck</literal> modult is bizonyos ellenőrzések végrehajtásához néhány változón. A leképezések nem példányosíthatók az objektumkezelővel.

source: sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed params for my $Needed (qw(DebuggerObject MappingConfig)) { if ( !$Param{$Needed} ) { return { Success => 0, ErrorMessage => "Got no $Needed!" }; } $Self->{$Needed} = $Param{$Needed}; } # check mapping config if ( !IsHashRefWithData( $Param{MappingConfig} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Got no MappingConfig as hash ref with content!', ); } # check config - if we have a map config, it has to be a non-empty hash ref if ( defined $Param{MappingConfig}->{Config} && !IsHashRefWithData( $Param{MappingConfig}->{Config} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Got MappingConfig with Data, but Data is no hash ref with content!', ); } return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges paraméterek ellenőrzése for my $Needed (qw(DebuggerObject MappingConfig)) { if ( !$Param{$Needed} ) { return { Success => 0, ErrorMessage => "Nincs $Needed!" }; } $Self->{$Needed} = $Param{$Needed}; } # leképezési beállítás ellenőrzése if ( !IsHashRefWithData( $Param{MappingConfig} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Nincs MappingConfig objektum kivonathivatkozásként tartalommal!', ); } # beállítás ellenőrzése - ha van leképezési beállításunk, akkor annak # nem üres kivonathivatkozásnak kell lennie if ( defined $Param{MappingConfig}->{Config} && !IsHashRefWithData( $Param{MappingConfig}->{Config} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Van MappingConfig adatokkal, de az adat nem kivonathivatkozás tartalommal!', ); } return $Self; }

source: sub Map { my ( $Self, %Param ) = @_; # check data - only accept undef or hash ref if ( defined $Param{Data} && ref $Param{Data} ne 'HASH' ) { return $Self->{DebuggerObject}->Error( Summary => 'Got Data but it is not a hash ref in Mapping Test backend!' ); } # return if data is empty if ( !defined $Param{Data} || !%{ $Param{Data} } ) { return { Success => 1, Data => {}, }; } # no config means that we just return input data if ( !defined $Self->{MappingConfig}->{Config} || !defined $Self->{MappingConfig}->{Config}->{TestOption} ) { return { Success => 1, Data => $Param{Data}, }; } # check TestOption format if ( !IsStringWithData( $Self->{MappingConfig}->{Config}->{TestOption} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Got no TestOption as string with value!', ); } # parse data according to configuration my $ReturnData = {}; if ( $Self->{MappingConfig}->{Config}->{TestOption} eq 'ToUpper' ) { $ReturnData = $Self->_ToUpper( Data => $Param{Data} ); } elsif ( $Self->{MappingConfig}->{Config}->{TestOption} eq 'ToLower' ) { $ReturnData = $Self->_ToLower( Data => $Param{Data} ); } elsif ( $Self->{MappingConfig}->{Config}->{TestOption} eq 'Empty' ) { $ReturnData = $Self->_Empty( Data => $Param{Data} ); } else { $ReturnData = $Param{Data}; } # return result return { Success => 1, Data => $ReturnData, }; }
hu: sub Map { my ( $Self, %Param ) = @_; # adatok ellenőrzése - csak meghatározatlant vagy kivonathivatkozást fogad el if ( defined $Param{Data} && ref $Param{Data} ne 'HASH' ) { return $Self->{DebuggerObject}->Error( Summary => 'Van adat, de az nem kivonathivatkozás a leképezésteszt háttérprogramban!' ); } # visszatérés, ha az adat üres if ( !defined $Param{Data} || !%{ $Param{Data} } ) { return { Success => 1, Data => {}, }; } # ha nincs beállítás, akkor az azt jelenti, hogy egyszerűen visszaadjuk a bemeneti adatot if ( !defined $Self->{MappingConfig}->{Config} || !defined $Self->{MappingConfig}->{Config}->{TestOption} ) { return { Success => 1, Data => $Param{Data}, }; } # a TestOption formátum ellenőrzése if ( !IsStringWithData( $Self->{MappingConfig}->{Config}->{TestOption} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Nincs TestOption szövegként értékkel!', ); } # adatok feldolgozása a beállítások szerint my $ReturnData = {}; if ( $Self->{MappingConfig}->{Config}->{TestOption} eq 'ToUpper' ) { $ReturnData = $Self->_ToUpper( Data => $Param{Data} ); } elsif ( $Self->{MappingConfig}->{Config}->{TestOption} eq 'ToLower' ) { $ReturnData = $Self->_ToLower( Data => $Param{Data} ); } elsif ( $Self->{MappingConfig}->{Config}->{TestOption} eq 'Empty' ) { $ReturnData = $Self->_Empty( Data => $Param{Data} ); } else { $ReturnData = $Param{Data}; } # az eredmény visszaadása return { Success => 1, Data => $ReturnData, }; }

source: The <literal>Map</literal> function is the main part of each mapping module. It receives the mapping configuration (rules) and the data in the original format (either OTRS or remote system format) and converts it to a new format, even if the structure of the data can be changed during the mapping process.
hu: A <literal>Map</literal> függvény az egyes leképezőmodulok fő része. Fogadja a leképezési beállításokat (szabályokat) és az eredeti formátumban lévő adatokat (vagy az OTRS vagy a távoli rendszer formátumában lévőket), és átalakítja azokat egy új formátumra még akkor is, ha az adatok szerkezete megváltozhat a leképezési folyamat során.

source: In this particular example there are three rules to map the values. This rules are set in the mapping configuration key <literal>TestOption</literal> and they are <literal>ToUpper</literal>, <literal>ToLower</literal> and <literal>Empty</literal>.
hu: Ebben a bizonyos példában három szabály van az értékek leképezéséhez. Ezek a szabályok a leképezési beállítások <literal>TestOption</literal> kulcsában vannak beállítva, és a következők: <literal>ToUpper</literal>, <literal>ToLower</literal> és <literal>Empty</literal>.

source: <literal>ToUpper</literal>: converts each data value to upper case.
hu: <literal>ToUpper</literal>: nagybetűsre alakít át minden egyes adatértéket.

source: <literal>ToLower</literal>: converts each data value to lower case.
hu: <literal>ToLower</literal>: kisbetűsre alakít át minden egyes adatértéket.

source: <literal>Empty</literal>: converts each data value into an empty string.
hu: <literal>Empty</literal>: egy üres szövegre alakít át minden egyes adatértéket.

source: In this example no data key transformations were implemented.
hu: Ebben a példában nem lettek adatkulcs átalakítások megvalósítva.

source: This are the helper functions that actually performs the string conversions.
hu: Ezek azok a segédfüggvények, amelyek ténylegesen végrehajtják a szövegátalakításokat.

source: There is the need to register this mapping module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen leképezőmodul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.

source: Operation
hu: Művelet

source: The operation is used to perform an action within OTRS. This action is requested by the external system and can include special parameters in order to correctly execute the action. After the action is performed, OTRS sends a defined confirmation to the external system.
hu: A műveletet egy tevékenység végrehajtásához használják az OTRS-en belül. Ezt a tevékenységet a távoli rendszer kéri, és tartalmazhat különleges paramétereket azért, hogy helyesen végrehajtsa a tevékenységet. A tevékenység végrehajtása után az OTRS elküld egy meghatározott megerősítést a távoli rendszernek.

source: Operation backend
hu: Műveleti háttérprogram

source: Next we will show how to develop a new Operation, each operation has to implement these subroutines:
hu: Ezután be fogjuk mutatni, hogy hogyan kell egy új műveletet kifejleszteni. Minden egyes műveletnek meg kell valósítania ezeket a szubrutinokat:

source: We should implement each one of this methods in order to be able to execute the action handled by the provider (<filename>Kernel/GenericInterface/Provider.pm</filename>).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk végrehajtani a szolgáltató által kezelt műveletet (<filename>Kernel/GenericInterface/Provider.pm</filename>).

source: In this section a sample operation module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta műveletmodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.

source: # -- # Kernel/GenericInterface/Operation/Test/Test.pm - GenericInterface test operation backend # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Operation::Test::Test; use strict; use warnings; use Kernel::System::VariableCheck qw(IsHashRefWithData); our $ObjectManagerDisabled = 1;
hu: -- # Kernel/GenericInterface/Operation/Test/Test.pm - Általános felület teszt műveleti háttérprogram # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Operation::Test::Test; use strict; use warnings; use Kernel::System::VariableCheck qw(IsHashRefWithData); our $ObjectManagerDisabled = 1;

source: We also include <literal>VariableCheck</literal> module to perform certain validation over some variables. Operations can not be instantiated by the Object Manager.
hu: Felveszünk egy <literal>VariableCheck</literal> modult is bizonyos ellenőrzések végrehajtásához néhány változón. A műveletek nem példányosíthatók az objektumkezelővel.

source: sub new { my ( $Type, %Param ) = @_; my $Self = {}; bless( $Self, $Type ); # check needed objects for my $Needed (qw(DebuggerObject)) { if ( !$Param{$Needed} ) { return { Success => 0, ErrorMessage => "Got no $Needed!" }; } $Self->{$Needed} = $Param{$Needed}; } return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for my $Needed (qw(DebuggerObject)) { if ( !$Param{$Needed} ) { return { Success => 0, ErrorMessage => "Nincs $Needed!" }; } $Self->{$Needed} = $Param{$Needed}; } return $Self; }

source: sub Run { my ( $Self, %Param ) = @_; # check data - only accept undef or hash ref if ( defined $Param{Data} && ref $Param{Data} ne 'HASH' ) { return $Self->{DebuggerObject}->Error( Summary => 'Got Data but it is not a hash ref in Operation Test backend)!' ); } if ( defined $Param{Data} && $Param{Data}->{TestError} ) { return { Success => 0, ErrorMessage => "Error message for error code: $Param{Data}->{TestError}", Data => { ErrorData => $Param{Data}->{ErrorData}, }, }; } # copy data my $ReturnData; if ( ref $Param{Data} eq 'HASH' ) { $ReturnData = \%{ $Param{Data} }; } else { $ReturnData = undef; } # return result return { Success => 1, Data => $ReturnData, }; }
hu: sub Run { my ( $Self, %Param ) = @_; # adatok ellenőrzése - csak meghatározatlant vagy kivonathivatkozást fogad el if ( defined $Param{Data} && ref $Param{Data} ne 'HASH' ) { return $Self->{DebuggerObject}->Error( Summary => 'Van adat, de az nem kivonathivatkozás a műveletteszt háttérprogramban!' ); } if ( defined $Param{Data} && $Param{Data}->{TestError} ) { return { Success => 0, ErrorMessage => "Hibaüzenet a következő hibakódhoz: $Param{Data}->{TestError}", Data => { ErrorData => $Param{Data}->{ErrorData}, }, }; } # adatok másolása my $ReturnData; if ( ref $Param{Data} eq 'HASH' ) { $ReturnData = \%{ $Param{Data} }; } else { $ReturnData = undef; } # az eredmény visszaadása return { Success => 1, Data => $ReturnData, }; }

source: The <literal>Run</literal> function is the main part of each operation. It receives all internal mapped data from remote system needed by the provider to execute the action, it performs the action and returns the result to the provider to be external mapped and deliver back to the remote system.
hu: A <literal>Run</literal> függvény az egyes műveletek fő része. Fogadja az összes belsőleg leképezett adatot a távoli rendszertől, amelyre a szolgáltatónak szüksége van a művelet végrehajtásához, végrehajtja a műveletet, és visszaadja az eredményt a szolgáltatónak a külső leképezéshez, valamint visszaszállítja a távoli rendszerhez.

source: This particular example returns the same data as came from the remote system, unless <literal>TestError</literal> parameter is passed. In this case it returns an error.
hu: Ez a bizonyos példa ugyanúgy adja vissza az adatokat, ahogy azok a távoli rendszertől jönnek, hacsak a <literal>TestError</literal> paraméter át nincs adva. Ebben az esetben egy hibát ad vissza.

source: There is the need to register this operation module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen műveletmodul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.

source: Unit Test Example
hu: Egységteszt példa

source: Unit Test for Generic Interface operations does not differs from other unit tests but it is needed to consider testing locally, but also simulating a remote connection. It is a good practice to test both separately since results could be slightly different.
hu: Az általános felület műveleteinek egységtesztjei nem különböznek más egységtesztektől, de fontolóra kell venni a helyi tesztelést, viszont egy távoli kapcsolatot is szimulálni kell. Egy jó bevált gyakorlat mindkettőt különválasztva tesztelni, mivel az eredmények némileg különbözők lehetnek.

source: To learn more about unit tests, please take a look to the <link linkend="unit-tests">Unit Test Chapter</link>.
hu: Ha többet szeretne megtudni az egységtesztekről, akkor vessen egy pillantást az <link linkend="unit-tests">egységteszt fejezetre</link>.

source: The following is just the starting point for a unit test:
hu: A következő csak a kezdési pont egy egységteszthez:
