Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: OTRS provides API for unit testing that was used in the previous example. Here we'll list the most important functions, please also see the online API reference of <ulink url="http://otrs.github.io/doc/api/otrs/6.0/Kernel/System/UnitTest.pm.html"> <literal>Kernel::System::UnitTest</literal> </ulink>.
hu: Az OTRS API-t biztosít az egységteszteléshez, amely az előző példában volt használva. Itt fel fogjuk sorolni a legfontosabb függvényeket, de nézze meg a <ulink url="http://otrs.github.io/doc/api/otrs/6.0/Kernel/System/UnitTest.pm.html"><literal>Kernel::System::UnitTest</literal></ulink> internetes API hivatkozását is.

source: This function tests whether given scalar value is a true value in Perl.
hu: Ez a függvény azt teszteli, hogy a megadott skalár érték igaz érték-e a Perlben.

source: $Self->True( 1, 'Scalar 1 is always evaluated as true' );
hu: $Self->True( 1, 'Az 1 skalár mindig igazként lesz kiértékelve' );

source: This function tests whether given scalar value is a false value in Perl.
hu: Ez a függvény azt teszteli, hogy a megadott skalár érték hamis érték-e a Perlben.

source: $Self->False( 0, 'Scalar 0 is always evaluated as false' );
hu: $Self->False( 0, 'A 0 skalár mindig hamisként lesz kiértékelve' );

source: This function tests whether the given scalar variables are equal.
hu: Ez a függvény azt teszteli, hogy a megadott skalár változók egyenlők-e.

source: $Self->Is( $A, $B, 'Test Name', );
hu: $Self->Is( $A, $B, 'Tesztnév', );

source: This function tests whether the given scalar variables are unequal.
hu: Ez a függvény azt teszteli, hogy a megadott skalár változók nem egyenlők-e.

source: $Self->IsNot( $A, $B, 'Test Name' );
hu: $Self->IsNot( $A, $B, 'Tesztnév' );

source: This function compares complex data structures for equality. <literal>$A</literal> and <literal>$B</literal> have to be references.
hu: Ez a függvény összetett adatszerkezeteket hasonlít össze az egyenlőséghez. <literal>$A</literal> és <literal>$B</literal> hivatkozás kell legyen.

source: $Self->IsDeeply( $A, $B, 'Test Name' );
hu: $Self->IsDeeply( $A, $B, 'Tesztnév' );

source: This function compares complex data structures for inequality. <literal>$A</literal> and <literal>$B</literal> have to be references.
hu: Ez a függvény összetett adatszerkezeteket hasonlít össze a nem egyenlőséghez. <literal>$A</literal> és <literal>$B</literal> hivatkozás kell legyen.

source: $Self->IsNotDeeply( $A, $B, 'Test Name' );
hu: $Self->IsNotDeeply( $A, $B, 'Tesztnév' );

source: Besides this, unit test helper object also provides some helpful methods for common test conditions. For full reference, please see the online API reference of <ulink url="http://otrs.github.io/doc/api/otrs/6.0/Kernel/System/UnitTest/Helper.pm.html"> <literal>Kernel::System::UnitTest::Helper</literal> </ulink>.
hu: Emellett az egységteszt segítő objektum biztosít néhány hasznos metódust is a gyakori tesztelési feltételekhez. A teljes hivatkozásért nézze meg a <ulink url="http://otrs.github.io/doc/api/otrs/6.0/Kernel/System/UnitTest/Helper.pm.html"><literal>Kernel::System::UnitTest::Helper</literal></ulink> internetes API hivatkozását.

source: This function creates a random ID that can be used in tests as a unique identifier. It is guaranteed that within a test this function will never return a duplicate.
hu: Ez a függvény előállít egy véletlenszerű azonosítót, amely egyedi azonosítóként használható a tesztekben. Garantált, hogy egy teszten belül ez a függvény soha nem ad vissza kettőzött értéket.

source: Please note that these numbers are not really random and should only be used to create test data.
hu: Ne feledje, hogy ezek a számok nem valódi véletlen számok, és csak tesztadatok előállításához szabad használni.

source: This function creates a test user that can be used in tests. It will be set to invalid automatically during the destructor. It returns the login name of the new user, the password is the same.
hu: Ez a függvény létrehoz egy teszt felhasználót, amely használható a tesztekben. Automatikusan érvénytelenre lesz állítva a destruktor közben. Visszaadja az új felhasználó bejelentkezési nevét, a jelszó pedig ugyanaz lesz.

source: my $TestUserLogin = $Helper->TestUserCreate( Groups => ['admin', 'users'], # optional, list of groups to add this user to (rw rights) Language => 'de', # optional, defaults to 'en' if not set );
hu: my $TestUserLogin = $Helper->TestUserCreate( Groups => ['admin', 'users'], # elhagyható, csoportok listája, amelyhez a felhasználót hozzá kell adni (írás, olvasás jogokkal) Language => 'hu', # elhagyható, alapértelmezetten 'en', ha nincs megadva );

source: This functions makes it possible to override the system time as long as this object lives. You can pass an optional time parameter that should be used, if not, the current system time will be used.
hu: Ez a függvény lehetővé teszi a rendszeridő felülbírálását egészen addig, amíg az objektum él. Átadhat egy elhagyható időparamétert, amelyet használni kell. Ha nincs átadva, akkor az aktuális rendszeridő lesz használva.

source: All calls to methods of <literal>Kernel::System::Time</literal> and <literal>Kernel::System::DateTime</literal> will use the given time afterwards.
hu: A <literal>Kernel::System::Time</literal> és a <literal>Kernel::System::DateTime</literal> metódusainak összes meghívása a megadott időt fogja használni ezután.

source: $HelperObject->FixedTimeSet(366475757); # with Timestamp $HelperObject->FixedTimeSet($DateTimeObject); # with previously created DateTime object $HelperObject->FixedTimeSet(); # set to current date and time
hu: $HelperObject->FixedTimeSet(366475757); # időbélyeggel $HelperObject->FixedTimeSet($DateTimeObject); # az előzőleg létrehozott DateTime objektummal $HelperObject->FixedTimeSet(); # beállítás a jelenlegi dátumra és időre

source: This functions restores the regular system time behavior.
hu: Ez a függvény visszaállítja a rendes rendszeridő viselkedést.

source: This functions adds a number of seconds to the fixed system time which was previously set by <literal>FixedTimeSet()</literal>. You can pass a negative value to go back in time.
hu: Ez a függvény valamennyi másodpercet ad ahhoz a rögzített rendszeridőhöz, amelyet a <literal>FixedTimeSet()</literal> korábban beállított. Átadhat negatív értéket, hogy visszamenjen az időben.

source: This functions temporarily changes a configuration setting system wide to another value, both in the current instance of the <literal>ConfigObject</literal> and also in the system configuration on disk. This will be reset when the <literal>Helper</literal> object is destroyed.
hu: Ez a függvény átmenetileg rendszerszinten megváltoztat egy rendszerbeállítást egy másik értékre mind a <literal>ConfigObject</literal> aktuális példányában, mind a rendszerbeállításokban is a lemezen. Akkor lesz visszaállítva, amikor a <literal>Helper</literal> objektum megsemmisül.

source: Please note that this will not work correctly in clustered environments.
hu: Ne feledje, hogy ez jelenleg nem működik fürtözött környezetekben.

source: $Helper->ConfigSettingChange( Valid => 1, # (optional) enable or disable setting Key => 'MySetting', # setting name Value => { ... } , # setting value );
hu: $Helper->ConfigSettingChange( Valid => 1, # (elhagyható) beállítás engedélyezése vagy letiltása Key => 'MySetting', # beállítás neve Value => { ... } , # beállítás értéke );

source: This function will temporarily include custom code in the system. For example, you may use this to redefine a subroutine from another class. This change will persist for remainder of the test. All code will be removed when the Helper object is destroyed.
hu: Ez a függvény átmenetileg egyéni kódot fog felvenni a rendszerbe. Például ezt használhatja egy másik osztályból származó szubrutin felüldefiniálásához. Ez a változtatás megmarad a teszt emlékeztetőjénél is. Az összes kód eltávolításra kerül, amikor a <literal>Helper</literal> objektum megsemmisül.

source: $Helper->CustomCodeActivate( Code => q^ use Kernel::System::WebUserAgent; package Kernel::System::WebUserAgent; use strict; use warnings; { no warnings 'redefine'; sub Request { my $JSONString = '{"Results":{},"ErrorMessage":"","Success":1}'; return ( Content => \$JSONString, Status => '200 OK', ); } } 1;^, Identifier => 'News', # (optional) Code identifier to include in file name );
hu: $Helper->CustomCodeActivate( Code => q^ use Kernel::System::WebUserAgent; package Kernel::System::WebUserAgent; use strict; use warnings; { no warnings 'redefine'; sub Request { my $JSONString = '{"Results":{},"ErrorMessage":"","Success":1}'; return ( Content => \$JSONString, Status => '200 OK', ); } } 1;^, Identifier => 'News', # (elhagyható) kódazonosító a fájlnévbe való felvételhez );

source: This function will provide a temporary database for the test. Please first define test database settings in <filename>Kernel/Config.pm</filename>, i.e:
hu: Ez a függvény egy átmeneti adatbázist fog biztosítani a teszthez. Először határozza meg a teszt adatbázis beállításait a <filename>Kernel/Config.pm</filename> fájlban, azaz:

source: The method call will override global database configuration for duration of the test, i.e. temporary database will receive all calls sent over system <literal>DBObject</literal>.
hu: A metódushívás felül fogja bírálni a globális adatbázis-beállítást a teszt időtartama alatt, azaz az átmeneti adatbázis fogja fogadni az összes olyan hívást, amelyet a <literal>DBObject</literal> rendszer küldött át.

source: All database contents will be automatically dropped when the <literal>Helper</literal> object is destroyed.
hu: Az összes adatbázis-tartalom automatikusan eldobásra kerül, amikor a <literal>Helper</literal> objektum megsemmisül.

source: This method returns <literal>undef</literal> in case the test database is not configured. If it is configured, but the supplied XML cannot be read or executed, this method will <literal>die()</literal> to interrupt the test with an error.
hu: Ez a metódus <literal>undef</literal> értéket ad vissza abban az esetben, ha a teszt adatbázis nincs beállítva. Ha be van állítva, de a mellékelt XML nem olvasható vagy nem hajtható végre, akkor a metódus <literal>die()</literal> függvénye lesz meghívva a teszt hibával történő megszakításához.

source: $Helper->ProvideTestDatabase( DatabaseXMLString => $XML, # (optional) OTRS database XML schema to execute # or DatabaseXMLFiles => [ # (optional) List of XML files to load and execute '/opt/otrs/scripts/database/otrs-schema.xml', '/opt/otrs/scripts/database/otrs-initial_insert.xml', ], );
hu: $Helper->ProvideTestDatabase( DatabaseXMLString => $XML, # (elhagyható) OTRS adatbázis XML-séma a végrehajtáshoz # vagy DatabaseXMLFiles => [ # (elhagyható) betöltendő és végrehajtandó XML-fájlok listája '/opt/otrs/scripts/database/otrs-schema.xml', '/opt/otrs/scripts/database/otrs-initial_insert.xml', ], );

source: Use HTML 5 notation. Don't use self-closing tags for non-void elements (such as div, span, etc.).
hu: Használjon HTML 5 jelölést. Ne használjon önmagát lezáró címkéket nem üres elemeknél (mint például <literal>div</literal>, <literal>span</literal>, etc.).

source: Use proper intendation. Elements which contain other non-void child elements should not be on the same level as their children.
hu: Használjon megfelelő behúzást. Azok az elemek, amelyek egyéb, nem üres gyermekelemet tartalmaznak, nem lehetnek ugyanazon a szinten, mint a gyermekeik.

source: Don't use HTML elements for layout reasons (e.g. using <literal>br</literal> elements for adding space to the top or bottom of other elements). Use the proper CSS classes instead.
hu: Ne használjon HTML elemeket elrendezési okokból (például <literal>br</literal> elemek használata más elemek fölé vagy alá történő további térköz adásához). Használja helyette a megfelelő CSS osztályokat.

source: Don't use inline CSS. All CSS should either be added by using predefined classes or (if necessary) using JavaScript (e.g. for showing/hiding elements).
hu: Ne használjon beágyazott CSS-t. Az összes CSS-t vagy az előre meghatározott osztályokkal, vagy (ha szükséges) JavaScript használatával kell hozzáadni (például elemek megjelenítéséhez vagy elrejtéséhez).

source: Don't use JavaScript in TT templates. All needed JavaScript should be part of the proper library for a certain frontend module or of a proper global library. If you need to pass JavaScript data to the frontend, use <literal>$LayoutObject->AddJSData()</literal>.
hu: Ne használjon JavaScriptet a TT sablonokban. Az összes szükséges JavaScriptnek egy bizonyos előtétprogram-modul megfelelő programkönyvtára részének, vagy egy megfelelő globális programkönyvtár részének kell lennie. Ha JavaScript adatokat kell átadnia az előtétprogramnak, akkor használja a <literal>$LayoutObject->AddJSData()</literal> metódust.

source: Minimum resolution is 1024x768px.
hu: A legkisebb felbontás 1024×768 képpont.

source: The layout is liquid, which means that if the screen is wider, the space will be used.
hu: Az elrendezés folyékony, amely azt jelenti, hogy ha a képernyő szélesebb, akkor a helyet fel fogja használni.

source: Absolute size measurements should be specified in px to have a consistent look on many platforms and browsers.
hu: Az abszolút méretmeghatározásokat képpontban (px) kell megadni, hogy következetes kinézetet kapjon a legtöbb platformon és böngészőben.

source: Documentation is made with CSSDOC (see CSS files for examples). All logical blocks should have a CSSDOC comment.
hu: A dokumentáció CSSDOC használatával készül (nézze meg a CSS-fájlokat példaként). Az összes logikai blokknak rendelkeznie kell egy CSSDOC megjegyzéssel.

source: Architecture
hu: Szerkezet

source: We follow the <ulink url="http://wiki.github.com/stubbornella/oocss/">Object Oriented CSS</ulink> approach. In essence, this means that the layout is achieved by combining different generic building blocks to realize a particular design.
hu: Az <ulink url="http://wiki.github.com/stubbornella/oocss/">objektumorientált CSS</ulink> megközelítést követjük. Lényegében ez azt jelenti, hogy az elrendezés különböző általános építőkockák egyesítésével érhető el egy bizonyos látványterv megvalósításához.

source: Wherever possible, module specific design should not be used. Therefore we also do not work with IDs on the <literal>body</literal> element, for example, if it can be avoided.
hu: Ahol csak lehetséges, nem szabad a modulra jellemző látványtervet használni. Például ezért nem dolgozunk azonosítókkal a <literal>body</literal> elemen sem, ha az elkerülhető.

source: Style
hu: Stílus

source: All definitions have a <literal>{</literal> in the same line as the selector, all rules are defined in one row per rule, the definition ends with a row with a single <literal>}</literal> in it. See the following example:
hu: Az összes meghatározásnak ugyanabban a sorában van a <literal>{</literal> karakter mint a kiválasztó, az összes szabály szabályonként egy sorban van meghatározva, a meghatározások egyetlen <literal>}</literal> karaktert tartalmazó sorral végződnek. Nézze meg a következő példát:

source: Between <literal>:</literal> and the rule value, there is a space.
hu: A <literal>:</literal> és szabály értéke között van egy szóköz.

source: Every rule has an indent of 4 spaces.
hu: Minden szabály 4 szóközzel van behúzva.

source: If multiple selectors are specified, separate them with comma and put each one on an own line:
hu: Ha több kiválasztó van megadva, akkor vesszővel válassza el azokat, és mindegyiket tegye külön sorba:

source: If rules are combinable, combine them (e.g. combine <literal>background-position</literal>, <literal>background-image</literal>, ... into <literal>background</literal>).
hu: Ha a szabályok egyesíthetők, akkor egyesítse azokat (például egyesítse a <literal>background-position</literal>, <literal>background-image</literal>, stb. szabályokat a <literal>background</literal> szabályba).

source: Rules should be in a logical order within a definition (all color specific rule together, all positioning rules together, ...).
hu: A szabályoknak logikai sorrendben kell lenniük egy meghatározáson belül (az összes színre jellemző szabály együtt, az összes pozicionáló szabály együtt, stb.).

source: All IDs and Names are written in CamelCase notation:
hu: Az összes azonosító és név CamelCase jelölésrendszerben van írva:

source: Browser Handling
hu: Böngészőkezelés

source: All JavaScript is loaded in all browsers (no browser hacks in the template files). The code is responsible to decide if it has to skip or execute certain parts of itself only in certain browsers.
hu: Az összes JavaScript betöltődik minden böngészőben (nincsenek böngésző trükközések a sablonfájlokban). A kód felelős annak eldöntéséért, hogy ki kell hagynia vagy végre kell hajtania saját magának bizonyos részeit az egyes böngészőkben.

source: Directory Structure
hu: Könyvtárszerkezet

source: Directory structure inside the <literal>js/</literal> folder:
hu: Könyvtárszerkezet a <literal>js/</literal> mappán belül:

source: * js * thirdparty # thirdparty libs always have the version number inside the directory * ckeditor-3.0.1 * jquery-1.3.2 * Core.Agent.* # stuff specific to the agent interface * Core.Customer.* # customer interface * Core.* # common API
hu: * js * thirdparty # harmadik féltől származó függvénykönyvtárak, * ckeditor-3.0.1 # amelyek mindig tartalmaznak verziószámot a * jquery-1.3.2 # könyvtáron belül * Core.Agent.* # az ügyintézői felületre jellemző dolgok * Core.Customer.* # ügyfélfelület * Core.* # közös API

source: Thirdparty Code
hu: Harmadik féltől származó kód

source: Every thirdparty module gets its own subdirectory: "module name"-"version number" (e.g. ckeditor-3.0.1, jquery-1.3.2). Inside of that, file names should not have a version number or postfix included (wrong: <literal>jquery/jquery-1.4.3.min.js</literal>, right: <literal>jquery-1.4.3/jquery.js</literal>).
hu: Minden harmadik féltől származó modul saját alkönyvtárat kap: „modulnév”-„verziószám” (például ckeditor-3.0.1, jquery-1.3.2). Ezen belül a fájlneveknek nem kell verziószámot vagy előtagot tartalmaznia (hibás: <literal>jquery/jquery-1.4.3.min.js</literal>, helyes: <literal>jquery-1.4.3/jquery.js</literal>).

source: Variables
hu: Változók

source: Variable names should be CamelCase, just like in Perl.
hu: A változóneveket CamelCase jelölésrendszerben kell írni, akárcsak a Perlben.

source: Variables that hold a jQuery object should start with <literal>$</literal>, for example: <literal>$Tooltip</literal>.
hu: A jQuery objektumot tartalmazó változókat <literal>$</literal> karakterrel kell kezdeni, például: <literal>$Tooltip</literal>.

source: Functions
hu: Függvények

source: Function names should be CamelCase, just like in Perl.
hu: A függvényneveket CamelCase jelölésrendszerben kell írni, akárcsak a Perlben.

source: Namespaces
hu: Névterek

source: TODO...
hu: Ez a rész még nincs megírva…

source: Code Comments
hu: Kódmagyarázatok

source: The <link linkend="code-style-guide-perl-code-comments">commenting guidelines for Perl code</link> also apply to JavaScript.
hu: A <link linkend="code-style-guide-perl-code-comments">Perl-kód magyarázási irányelvei</link> a JavaScriptre is vonatkoznak.

source: Single line comments are done with <literal>//</literal>.
hu: Egysoros megjegyzéseket <literal>//</literal> karakterekkel kell készíteni.

source: Longer comments are done with <literal>/* ... */</literal>.
hu: Hosszabb megjegyzéseket <literal>/* ... */</literal> karakterekkel kell készíteni.

source: If you comment out parts of your JavaScript code, only use <literal>//</literal> because <literal>/* ... */</literal> can cause problems with Regular Expressions in the code.
hu: Ha megjegyzésre állítja a JavaScript kód egyes részeit, akkor csak a <literal>//</literal> karaktereket használja, ugyanis a <literal>/* ... */</literal> használata problémákat okozhat a reguláris kifejezéseknél a kódban.

source: Event Handling
hu: Eseménykezelés

source: Always use <literal>$.on()</literal> instead of the event-shorthand methods of jQuery for better readability (wrong: <literal>$SomeObject.click(...)</literal>, right: <literal>$SomeObject.on('click', ...</literal>).
hu: Mindig az <literal>$.on()</literal> függvényt használja a jQuery rövidített nevű eseménymetódusai helyett a jobb olvashatóságért (hibás: <literal>$SomeObject.click(...)</literal>, helyes: <literal>$SomeObject.on('click', ...</literal>).

source: If you <literal>$.on()</literal> events, make sure to <literal>$.off()</literal> them beforehand, to make sure that events will not be bound twice, should the code be executed another time.
hu: Ha eseményeket köt az <literal>$.on()</literal> függvénnyel, akkor győződjön meg arról, hogy korábban leválasztotta azokat az <literal>$.off()</literal> használatával annak biztosításához, hogy az események ne legyenek kétszer kötve, ne kelljen a kódot még egy alkalommal végrehajtani.

source: Make sure to use <literal>$.on()</literal> with namespacing, such as <literal>$.on('click.&lt;Name&gt;')</literal>.
hu: Győződjön meg arról, hogy az <literal>$.on()</literal> függvényt névtérrel használja-e, mint például <literal>$.on('click.&lt;Name&gt;')</literal>.

source: Formatting
hu: Formázás

source: Whitespace
hu: Üres karakterek

source: TAB: We use 4 spaces. Examples for braces:
hu: TABULÁTOR: 4 szóközt használunk. Példa a zárójelekre:

source: if ($Condition) { Foo(); } else { Bar(); } while ($Condition == 1) { Foo(); }
hu: if ($Feltétel) { Izé(); } else { Bigyó(); } while ($Feltétel == 1) { Izé(); }

source: Length of lines
hu: A sorok hossza

source: Lines should generally not be longer than 120 characters, unless it is necessary for special reasons.
hu: A sorok általában nem lehetnek hosszabbak 120 karakternél, hacsak ez különleges okok miatt nem szükséges.

source: Spaces and parentheses
hu: Szóközök és zárójelek

source: To gain more readability, we use spaces between keywords and opening parenthesis.
hu: A jobb olvashatóság érdekében szóközöket használunk a kulcsszavak és a nyitó zárójelek között.

source: If there is just one single variable, the parenthesis enclose the variable with no spaces inside.
hu: Ha csak egy egyedülálló változó van, akkor a zárójelek belül szóközök nélkül veszik körbe a változót.

source: if ($Condition) { ... } # instead of if ( $Condition ) { ... }
hu: if ($Feltétel) { ... } # e helyett if ( $Feltétel ) { ... }

source: If the condition is not just one single variable, we use spaces between the parenthesis and the condition. And there is still the space between the keyword (e.g. <literal>if</literal>) and the opening parenthesis.
hu: Ha a feltétel nem csak egy egyedülálló változó, akkor szóközöket használunk a zárójelek és a feltétel között. És továbbra is szóköz van a kulcsszó (például <literal>if</literal>) és a nyitó zárójel között.

source: if ( $Condition && $ABC ) { ... }
hu: if ( $Feltétel && $ABC ) { ... }

source: Note that for Perl builtin functions, we do not use parentheses:
hu: Ne feledje, hogy a Perl beépített függvényeinél nem használunk zárójeleket:

source: Source code header and charset
hu: Forráskód fejléc és karakterkódolás

source: Attach the following header to every source file. Source files are saved in UTF-8 charset.
hu: Csatolja hozzá a következő fejlécet minden egyes forrásfájlhoz. A forrásfájlok UTF-8 karakterkódolással vannak elmentve.

source: Executable files (<filename>*.pl</filename>) have a special header.
hu: A végrehajtható fájloknak (<filename>*.pl</filename>) különleges fejlécük van.

source: Using the Perl language
hu: A Perl nyelv használata

source: Control flow
hu: Vezérlési folyamat

source: Conditions
hu: Feltételek
