Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: A config element for Perl module. It has a <literal>ValueFilter</literal> attribute, which filters possible values for selection. In the example below, user can select Perl module <literal>Kernel::System::Log::SysLog</literal> or <literal>Kernel::System::Log::File</literal>.
hu: Egy beállítási elem Perl-modulhoz. Rendelkezik egy <literal>ValueFilter</literal> attribútummal, amely szűri a lehetséges értékeket a kiválasztásnál. A lenti példában a felhasználó a <literal>Kernel::System::Log::SysLog</literal> vagy a <literal>Kernel::System::Log::File</literal> Perl-modult választhatja.

source: Textarea
hu: <literal>Textarea</literal>

source: A config element for multiline text.
hu: Egy beállítási elem többsoros szöveghez.

source: Select
hu: <literal>Select</literal>

source: This config element offers preset values as a pull-down menu. The <literal>SelectedID</literal> or <literal>SelectedValue</literal> attributes can pre-select a default value.
hu: Ez a beállítási elem előre beállított értékeket nyújt egy legördülő menüként. A <literal>SelectedID</literal> vagy a <literal>SelectedValue</literal> attribútumok előre kiválaszthatnak egy alapértelmezett értéket.

source: <Setting Name="SettingName"> ... <Value> <Item ValueType="Select" SelectedID="Queue"> <Item ValueType="Option" Value="Queue" Translatable="1">Queue</Item> <Item ValueType="Option" Value="SystemAddress" Translatable="1">System address</Item> </Item> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Item ValueType="Select" SelectedID="Queue"> <Item ValueType="Option" Value="Queue" Translatable="1">Várólista</Item> <Item ValueType="Option" Value="SystemAddress" Translatable="1">Rendszercím</Item> </Item> </Value> </Setting>

source: Checkbox
hu: <literal>Checkbox</literal>

source: This config element checkbox has two states: 0 or 1.
hu: Ennek a jelölőnégyzet beállítási elemnek két állapota van: 0 vagy 1.

source: Date
hu: <literal>Date</literal>

source: This config element contains a date value.
hu: Ez a beállítási elem egy dátumértéket tartalmaz.

source: DateTime
hu: <literal>DateTime</literal>

source: This config element contains a date and time value.
hu: Ez a beállítási elem egy dátumot és egy időértéket tartalmaz.

source: This config element contains a directory.
hu: Ez a beállítási elem egy könyvtárat tartalmaz.

source: File
hu: <literal>File</literal>

source: This config element contains a file path.
hu: Ez a beállítási elem egy fájlútvonalat tartalmaz.

source: Entity
hu: <literal>Entity</literal>

source: This config element contains a value of a particular entity. <literal>ValueEntityType</literal> attribute defines the entity type. Supported entities: <literal>DynamicField</literal>, <literal>Queue</literal>, <literal>Priority</literal>, <literal>State</literal> and <literal>Type</literal>. Consistency checks will ensure that only valid entities can be configured and that entities used in the configuration cannot be set to invalid. Also, when an entity is renamed, all referencing config settings will be updated.
hu: Ez a beállítási elem egy bizonyos entitás értékét tartalmazza. A <literal>ValueEntityType</literal> attribútum határozza meg az entitás típusát. Támogatott entitások: <literal>DynamicField</literal>, <literal>Queue</literal>, <literal>Priority</literal>, <literal>State</literal> és <literal>Type</literal>. A következetesség-ellenőrzések fogják biztosítani, hogy csak érvényes entitások legyenek beállíthatók, és hogy azok az entitások, amelyeket a beállításokban használnak, ne legyenek érvénytelenre állíthatók. Amikor egy entitást átneveznek, akkor az összes hivatkozó konfigurációs beállítás frissítve lesz.

source: <Setting Name="SettingName"> ... <Value> <Item ValueType="Entity" ValueEntityType="Queue">Junk</Item> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Item ValueType="Entity" ValueEntityType="Queue">Szemét</Item> </Value> </Setting>

source: TimeZone
hu: <literal>TimeZone</literal>

source: This config element contains a time zone value.
hu: Ez a beállítási elem egy időzóna értéket tartalmaz.

source: VacationDays
hu: <literal>VacationDays</literal>

source: This config element contains definitions for vacation days which are repeating each year. Following attributes are mandatory: <literal>ValueMonth</literal>, <literal>ValueDay</literal>.
hu: Ez a beállítási elem meghatározásokat tartalmaz az olyan munkaszüneti napokhoz, amelyek minden évben ismétlődnek. A következő attribútumok kötelezőek: <literal>ValueMonth</literal>, <literal>ValueDay</literal>.

source: <Setting Name="SettingName"> ... <Value> <Item ValueType="VacationDays"> <DefaultItem ValueType="VacationDays"></DefaultItem> <Item ValueMonth="1" ValueDay="1" Translatable="1">New Year's Day</Item> <Item ValueMonth="5" ValueDay="1" Translatable="1">International Workers' Day</Item> <Item ValueMonth="12" ValueDay="24" Translatable="1">Christmas Eve</Item> </Item> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Item ValueType="VacationDays"> <DefaultItem ValueType="VacationDays"></DefaultItem> <Item ValueMonth="1" ValueDay="1" Translatable="1">Újév</Item> <Item ValueMonth="5" ValueDay="1" Translatable="1">A munka ünnepe</Item> <Item ValueMonth="12" ValueDay="24" Translatable="1">Szenteste</Item> </Item> </Value> </Setting>

source: VacationDaysOneTime
hu: <literal>VacationDaysOneTime</literal>

source: This config element contains definitions for vacation days which occur only once. Following attributes are mandatory: <literal>ValueMonth</literal>, <literal>ValueDay</literal> and <literal>ValueYear</literal>.
hu: Ez a beállítási elem meghatározásokat tartalmaz az olyan munkaszüneti napokhoz, amelyek csak egyszer fordulnak elő. A következő attribútumok kötelezőek: <literal>ValueMonth</literal>, <literal>ValueDay</literal> és <literal>ValueYear</literal>.

source: <Setting Name="SettingName"> ... <Value> <Item ValueType="VacationDaysOneTime"> <Item ValueYear="2004" ValueMonth="1" ValueDay="1">test</Item> </Item> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Item ValueType="VacationDaysOneTime"> <Item ValueYear="2004" ValueMonth="1" ValueDay="1">Teszt</Item> </Item> </Value> </Setting>

source: WorkingHours
hu: <literal>WorkingHours</literal>

source: This config element contains definitions for working hours.
hu: Ez a beállítási elem meghatározásokat tartalmaz a munkaidőhöz.

source: Frontend Registration
hu: Előtétprogram regisztráció

source: Module registration for Agent Interface:
hu: Modul regisztráció az ügyintézői felülethez:

source: <Setting Name="SettiFrontend::Module###AgentModuleName"> ... <Value> <Item ValueType="FrontendRegistration"> <Hash> <Item Key="Group"> <Array> </Array> </Item> <Item Key="GroupRo"> <Array> </Array> </Item> <Item Key="Description" Translatable="1">Phone Call.</Item> <Item Key="Title" Translatable="1">Phone-Ticket</Item> <Item Key="NavBarName">Ticket</Item> </Hash> </Item> </Value> </Setting>
hu: <Setting Name="SettiFrontend::Module###AgentModuleName"> ... <Value> <Item ValueType="FrontendRegistration"> <Hash> <Item Key="Group"> <Array> </Array> </Item> <Item Key="GroupRo"> <Array> </Array> </Item> <Item Key="Description" Translatable="1">Telefonhívás.</Item> <Item Key="Title" Translatable="1">Telefonos jegy</Item> <Item Key="NavBarName">Ticket</Item> </Hash> </Item> </Value> </Setting>

source: DefaultItem in Array and Hash
hu: <literal>DefaultItem</literal> az <literal>Array</literal> és <literal>Hash</literal> elemekben

source: The new XML structure allows us to create complex structures. Therefore we need <literal>DefaultItem</literal> entries to describe the structure of the Array/Hash. If it's not provided, system considers that you want simple Array/Hash with scalar values. <literal>DefaultItem</literal> is used as a template when adding new elements, so it can contain additional attributes, like <literal>ValueType</literal>, and it can define default values.
hu: Az új XML szerkezet lehetővé teszi számunkra az összetett szerkezetek létrehozását. Ennélfogva szükségünk van alapértelmezett <literal>DefaultItem</literal> bejegyzésekre a tömb vagy kivonat szerkezetének leírásához. Ha ez nincs megadva, akkor a rendszer úgy tekinti, hogy egyszerű tömböt vagy kivonatot szeretne skalár értékekkel. A <literal>DefaultItem</literal> használható sablonként, amikor új elemeket adunk hozzá, így tartalmazhat további attribútumokat, mint például a <literal>ValueType</literal>, és meghatározhat alapértelmezett értékeket.

source: Here are few examples:
hu: Itt van néhány példa:

source: Array of Array with Select items
hu: Tömb tömbje <literal>Select</literal> elemekkel

source: <Array> <DefaultItem> <Array> <DefaultItem ValueType="Select" SelectedID='option-2'> <Item ValueType="Option" Value="option-1">Option 1</Item> <Item ValueType="Option" Value="option-2">Option 2</Item> </DefaultItem> </Array> </DefaultItem> ... </Array>
hu: <Array> <DefaultItem> <Array> <DefaultItem ValueType="Select" SelectedID='option-2'> <Item ValueType="Option" Value="option-1">1. lehetőség</Item> <Item ValueType="Option" Value="option-2">2. lehetőség</Item> </DefaultItem> </Array> </DefaultItem> ... </Array>

source: Hash of Hash with Date items
hu: Kivonat kivonata <literal>Date</literal> elemekkel

source: Accessing Config Options at Runtime
hu: Hozzáférés a beállítási lehetőségekhez futási időben

source: You can read and write (for one request) the config options via the core module <literal>Kernel::Config</literal>.
hu: Olvashatja és írhatja (egy kérésnél) a beállítási lehetőségeket a <literal>Kernel::Config</literal> alapmodulon keresztül.

source: If you want to read a config option:
hu: Ha egy beállítási lehetőséget szeretne olvasni:

source: If you want to change a config option at runtime and just for this one request/process:
hu: Ha meg szeretne változtatni egy beállítási lehetőséget futási időben, és csak ennél az egy kérésnél/folyamatnál:

source: $Kernel::OM->Get('Kernel::Config')->Set( Key => 'Prefix::Option' Value => 'SomeNewValue', );
hu: $Kernel::OM->Get('Kernel::Config')->Set( Key => 'Prefix::Option' Value => 'Valami új érték', );

source: Database Mechanism
hu: Adatbázis mechanizmus

source: OTRS comes with a database layer that supports different databases.
hu: Az OTRS olyan adatbázis réteggel érkezik, amely különböző adatbázisokat támogat.

source: How it works
hu: Hogyan működik

source: The database layer (<literal>Kernel::System::DB</literal>) has two input options: SQL and XML.
hu: Az adatbázis rétegnek (<literal>Kernel::System::DB</literal>) két bemeneti lehetősége van: SQL és XML.

source: The SQL interface should be used for normal database actions (SELECT, INSERT, UPDATE, ...). It can be used like a normal Perl DBI interface.
hu: Az SQL felületet kell használni a normál adatbázis-műveleteknél (SELECT, INSERT, UPDATE, …). Úgy használható mint egy normál Perl DBI felület.

source: $Kernel::OM->Get('Kernel::System::DB')->Do( SQL=> "INSERT INTO table (name, id) VALUES ('SomeName', 123)", ); $Kernel::OM->Get('Kernel::System::DB')->Do( SQL=> "UPDATE table SET name = 'SomeName', id = 123", ); $Kernel::OM->Get('Kernel::System::DB')->Do( SQL=> "DELETE FROM table WHERE id = 123", );
hu: $Kernel::OM->Get('Kernel::System::DB')->Do( SQL=> "INSERT INTO table (name, id) VALUES ('Valamilyen név', 123)", ); $Kernel::OM->Get('Kernel::System::DB')->Do( SQL=> "UPDATE table SET name = 'Valamilyen név', id = 123", ); $Kernel::OM->Get('Kernel::System::DB')->Do( SQL=> "DELETE FROM table WHERE id = 123", );

source: Take care to use <literal>Limit</literal> as param and not in the SQL string because not all databases support LIMIT in SQL strings.
hu: Vigyázzon arra, hogy a <literal>Limit</literal> megadását paraméterként használja, és ne az SQL utasításban, mert nem minden adatbázis támogatja a LIMIT kulcsszót az SQL lekérdezésekben.

source: Use the <literal>Bind</literal> attribute where ever you can, especially for long statements. If you use <literal>Bind</literal> you do not need the function <code>Quote()</code>.
hu: Használja a <literal>Bind</literal> attribútumot, ahol csak tudja, különösen a hosszú utasításoknál. Ha a <literal>Bind</literal> attribútumot használja, akkor nincs szükség a <code>Quote()</code> függvényre.

source: String:
hu: Szöveg:

source: my $QuotedString = $Kernel::OM->Get('Kernel::System::DB')->Quote("It's a problem!");
hu: my $QuotedString = $Kernel::OM->Get('Kernel::System::DB')->Quote("Ez egy probléma!");

source: Integer:
hu: Egész:

source: Number:
hu: Szám:

source: Please use the <literal>Bind</literal> attribute instead of <code>Quote()</code> where ever you can.
hu: A <literal>Bind</literal> attribútumot használja a <code>Quote()</code> függvény helyett, ahol csak tudja.

source: The XML interface should be used for INSERT, CREATE TABLE, DROP TABLE and ALTER TABLE. As this syntax is different from database to database, using it makes sure that you write applications that can be used in all of them.
hu: Az XML felületet kell használni INSERT, CREATE TABLE, DROP TABLE és ALTER TABLE utasításoknál. Mivel ez a szintaxis adatbázisról adatbázisra eltérő, ezért ennek használata gondoskodik arról, hogy olyan alkalmazásokat írjon, amelyek az összesnél használhatók.

source: The <literal>&lt;Insert&gt;</literal> syntax has changed in >=2.2. Values are now used in the tag content (not longer in an attribute).
hu: Az <literal>&lt;Insert&gt;</literal> szintaxis megváltozott a 2.2 és újabb verziókban. Az értékeket mostantól a címketartalomban használják (többé nem egy attribútumban).

source: Possible data types are: <literal>BIGINT</literal>, <literal>SMALLINT</literal>, <literal>INTEGER</literal>, <literal>VARCHAR</literal> (Size=1-1000000), <literal>DATE</literal> (Format: <literal>yyyy-mm-dd hh:mm:ss</literal>) and <literal>LONGBLOB</literal>.
hu: A lehetséges adattípusok a következők: <literal>BIGINT</literal>, <literal>SMALLINT</literal>, <literal>INTEGER</literal>, <literal>VARCHAR</literal> (Size=1-1000000), <literal>DATE</literal> (Formátum: <literal>yyyy-mm-dd hh:mm:ss</literal>) és <literal>LONGBLOB</literal>.

source: <literal>LONGBLOB</literal> columns need special treatment. Their content needs to be <literal>Base64</literal> transcoded if the database driver does not support the feature <literal>DirectBlob</literal>. Please see the following example:
hu: A <literal>LONGBLOB</literal> oszlopok különleges bánásmódot igényelnek. A tartalmukat <literal>Base64</literal>-re kell átkódolni, ha az adatbázis-meghajtó nem támogatja a <literal>DirectBlob</literal> funkciót. Nézze meg a következő példát:

source: Similarly, when reading from such a column, the content must not automatically be decoded as <literal>UTF-8</literal> by passing the <literal>Encode => 0</literal> flag to <literal>Prepare()</literal>:
hu: Hasonlóan, amikor egy ilyen oszlopból olvas, akkor a tartalmat tilos automatikusan <literal>UTF-8</literal>-ként visszaalakítani az <literal>Encode => 0</literal> jelző átadásával a <literal>Prepare()</literal> függvénynek:

source: return if !$DBObject->Prepare( SQL => ' SELECT content_type, content, content_id, content_alternative, disposition, filename FROM article_data_mime_attachment WHERE id = ?', Bind => [ \$AttachmentID ], Encode => [ 1, 0, 0, 0, 1, 1 ], ); while ( my @Row = $DBObject->FetchrowArray() ) { $Data{ContentType} = $Row[0]; # Decode attachment if it's e. g. a postgresql backend. if ( !$DBObject->GetDatabaseFunction('DirectBlob') ) { $Data{Content} = decode_base64( $Row[1] ); } else { $Data{Content} = $Row[1]; } $Data{ContentID} = $Row[2] || ''; $Data{ContentAlternative} = $Row[3] || ''; $Data{Disposition} = $Row[4]; $Data{Filename} = $Row[5]; }
hu: return if !$DBObject->Prepare( SQL => ' SELECT content_type, content, content_id, content_alternative, disposition, filename FROM article_data_mime_attachment WHERE id = ?', Bind => [ \$AttachmentID ], Encode => [ 1, 0, 0, 0, 1, 1 ], ); while ( my @Row = $DBObject->FetchrowArray() ) { $Data{ContentType} = $Row[0]; # Melléklet visszaalakítása, ha például postgresql háttérprogramot használ. if ( !$DBObject->GetDatabaseFunction('DirectBlob') ) { $Data{Content} = decode_base64( $Row[1] ); } else { $Data{Content} = $Row[1]; } $Data{ContentID} = $Row[2] || ''; $Data{ContentAlternative} = $Row[3] || ''; $Data{Disposition} = $Row[4]; $Data{Filename} = $Row[5]; }

source: The following shows an example of add, change and drop columns.
hu: A következő az oszlopok hozzáadásának, megváltoztatásának és eldobásának példáját jeleníti meg.

source: The next shows an example how to rename a table.
hu: A következő egy olyan példát jelenít meg, hogy hogyan nevezhető át egy tábla.

source: Code to process XML
hu: Kód az XML feldolgozásához

source: Database Drivers
hu: Adatbázis-meghajtók

source: The database drivers are located under <filename>$OTRS_HOME/Kernel/System/DB/*.pm</filename>.
hu: Az adatbázis-meghajtók az <filename>$OTRS_HOME/Kernel/System/DB/*.pm</filename> alatt találhatók.

source: Supported Databases
hu: Támogatott adatbázisok

source: Microsoft SQL Server (only for external database connections, not as OTRS database)
hu: Microsoft SQL Server (csak külső adatbázis-kapcsolatokhoz, nem OTRS adatbázisként)

source: Date and Time
hu: Dátum és idő

source: OTRS comes with its own package to handle date and time which ensures correct calculation and storage of date and time.
hu: Az OTRS saját csomaggal érkezik a dátum és idő kezeléséhez, amely a dátum és idő helyes kiszámítását és tárolását biztosítja.

source: Introduction
hu: Bevezetés

source: Date and time are represented by an object of <literal>Kernel::System::DateTime</literal>. Every <literal>DateTime</literal> object holds its own date, time and time zone information. In contrast to the now deprecated <literal>Kernel::System::Time</literal> package, this means that you can and should create a <literal>DateTime</literal> object for every date/time you want to use.
hu: A dátum és idő egy <literal>Kernel::System::DateTime</literal> objektummal van ábrázolva. Minden <literal>DateTime</literal> objektum tartalmazza a saját dátumát, idejét és időzóna információját. A mostanra elavult <literal>Kernel::System::Time</literal> csomaggal szemben ez azt jelenti, hogy létrehozhat és létre kell hoznia egy <literal>DateTime</literal> objektumot minden egyes dátumhoz vagy időhöz, amelyet használni szeretne.

source: Creation of a DateTime object
hu: Egy <literal>DateTime</literal> objektum létrehozása

source: The object manager of OTRS has been extended by a <literal>Create</literal> method to support packages for which more than one instance can be created:
hu: Az OTRS objektumkezelője kibővítésre került egy <literal>Create</literal> metódussal, hogy támogassa azokat a csomagokat, amelyekhez egynél több példány hozható létre:

source: my $DateTimeObject = $Kernel::OM->Create( 'Kernel::System::DateTime', ObjectParams => { TimeZone => 'Europe/Berlin' }, );
hu: my $DateTimeObject = $Kernel::OM->Create( 'Kernel::System::DateTime', ObjectParams => { TimeZone => 'Europe/Budapest' }, );

source: The example above will create a <literal>DateTime</literal> object for the current date and time in time zone Europe/Berlin. There are more options to create a <literal>DateTime</literal> object (time components, string, time stamp, cloning), see POD of <literal>Kernel::System::DateTime</literal>.
hu: A fenti példa létrehoz egy <literal>DateTime</literal> objektumot a jelenlegi dátumhoz és időhöz az Európa/Berlin időzónában. További lehetőségek is vannak egy <literal>DateTime</literal> objektum létrehozására (időösszetevők, szövegek, időbélyegek, klónozás), nézze meg a <literal>Kernel::System::DateTime</literal> POD-ját.

source: You will get an error if you try to retrieve a <literal>DateTime</literal> object via <literal>$Kernel::OM->Get('Kernel::System::DateTime')</literal>.
hu: Hibát fog kapni, ha megpróbál egy <literal>DateTime</literal> objektumot lekérni a <literal>$Kernel::OM->Get('Kernel::System::DateTime')</literal> használatával.

source: Time zones
hu: Időzónák

source: Time offsets in hours (+2, -10, etc.) have been replaced by time zones (Europe/Berlin, America/New_York, etc.). The conversion between time zones is completely encapsulated within a <literal>DateTime</literal> object. If you want to convert to another time zone, simply use the following code:
hu: Az órákban lévő időeltolások (+2, -10, stb.) le lettek cserélve az időzónákkal (Európa/Berlin, Amerika/New_York, stb.). Az időzónák közti átalakítások teljes mértékben a <literal>DateTime</literal> objektumon belül vannak megvalósítva. Ha egy másik időzónára szeretne átalakítani, akkor egyszerűen használja a következő kódot:

source: $DateTimeObject->ToTimeZone( TimeZone => 'Europe/Berlin' );
hu: $DateTimeObject->ToTimeZone( TimeZone => 'Europe/Budapest' );

source: There is a new SysConfig option <literal>OTRSTimeZone</literal>. This setting defines the time zone that OTRS uses internally to store date and time within the database.
hu: Van egy új <literal>OTRSTimeZone</literal> rendszerbeállítási lehetőség. Ez a beállítás határozza meg azt az időzónát, amelyet az OTRS belsőleg használ a dátum és az idő tárolásához az adatbázison belül.

source: You have to ensure to convert a <literal>DateTime</literal> object to the OTRS time zone before it gets stored in the database (there's a convenient method for this: <literal>ToOTRSTimeZone()</literal>). An exception could be that you explicitly want a database column to hold a date/time in a specific time zone. But be aware that the database itself won't provide time zone information by itself when retrieving it.
hu: Biztosítania kell, hogy egy <literal>DateTime</literal> objektum át legyen alakítva az OTRS időzónájára, mielőtt az eltárolásra kerülne az adatbázisba (van egy kényelmes módszer erre: <literal>ToOTRSTimeZone()</literal>). Kivétel lehet, hogy ha kifejezetten egy olyan adatbázisoszlopot szeretne, amely egy dátum/idő értéket tárol egy bizonyos időzónában. Ne feledje azonban, hogy maga az adatbázis önmagában nem fog időzóna-információkat biztosítani, amikor lekérik azt.

source: <literal>TimeZoneList()</literal> of <literal>Kernel::System::DateTime</literal> provides a list of available time zones.
hu: A <literal>Kernel::System::DateTime</literal> <literal>TimeZoneList()</literal> metódusa biztosítja az elérhető időzónák listáját.

source: Method summary
hu: Metódus összefoglaló

source: The <literal>Kernel::System::DateTime</literal> package provides the following methods (this is only a selection, see source code for details).
hu: A <literal>Kernel::System::DateTime</literal> csomag biztosítja a következő metódusokat (ez csak egy kiválasztás, a részletekért nézze meg a forráskódot).

source: Object creation methods
hu: Objektumlétrehozási metódusok

source: A <literal>DateTime</literal> object can be created either via the object manager's <literal>Create()</literal> method or by cloning another <literal>DateTime</literal> object with its <literal>Clone()</literal> method.
hu: Egy <literal>DateTime</literal> objektum létrehozható az objektumkezelő <literal>Create()</literal> metódusával vagy egy másik <literal>DateTime</literal> objektum leklónozásával a <literal>Clone()</literal> metódusának használatával.

source: Get method
hu: Lekérő metódus

source: With <literal>Get()</literal> all data of a <literal>DateTime</literal> object will be returned as a hash (date and time components including day name, etc. as well as time zone).
hu: A <literal>Get()</literal> metódussal egy <literal>DateTime</literal> objektum összes adata vissza lesz adva kivonatként (dátum és idő összetevők, beleértve a nap nevét, stb., valamint az időzónát).

source: Set method
hu: Beállító metódus
