Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: en
hu: hu

source: OTRS 6 - Developer Manual
hu: OTRS 6 - Fejlesztői kézikönyv

source: This work is copyrighted by OTRS AG.
hu: Ez a mű az OTRS AG szerzői joga alatt áll.

source: You may copy it in whole or in part as long as the copies retain this copyright statement.
hu: Lemásolhatja részben vagy egészben mindaddig, amíg a másolat tartalmazza ezt a szerzői jogi nyilatkozatot.

source: All trade names are used without the guarantee for their free use and are possibly registered trade marks. All products mentioned in this manual may be trade marks of the respective manufacturer.
hu: Minden márkanév a szabad felhasználásra vonatkozó garancia nélkül kerül felhasználásra, és lehetséges bejegyzett védjegyek lehetnek. Az ebben a kézikönyvben említett összes termék az illető gyártó védjegyei lehetnek.

source: The source code of this document can be found at <ulink url="https://otrs.github.io">github</ulink>, in the repository <ulink url="https://github.com/OTRS/doc-developer">doc-developer</ulink>. Contributions are more than welcome. You can also help translating it to your language at <ulink url="https://www.transifex.com/otrs/OTRS/">Transifex</ulink>.
hu: A dokumentum forráskódja megtalálható a <ulink url="https://otrs.github.io">githubon</ulink> a <ulink url="https://github.com/OTRS/doc-developer">doc-developer</ulink> tárolóban. A hozzájárulásokat mindennél jobban köszönjük. Segíthet a saját nyelvére való fordításban is a <ulink url="https://www.transifex.com/otrs/OTRS/">Transifex</ulink> oldalon.

source: Additional Resources
hu: További erőforrások

source: The OTRS website with source code, documentation and news is available at <ulink url="https://www.otrs.com/">www.otrs.com</ulink>. Here you can also find information about professional services and OTRS Administrator training seminars from OTRS Group, the creator of OTRS.
hu: Az OTRS weboldala a forráskóddal, dokumentációval és hírekkel a <ulink url="https://www.otrs.com/">www.otrs.com</ulink> címen érhető el. Itt a hivatalos szakmai szolgáltatásokkal és az OTRS adminisztrátorképzési szemináriumokkal kapcsolatos információkat is megtalálja az OTRS csoporttól, az OTRS készítőjétől.

source: Online API Library
hu: Internetes API könyvtár

source: The OTRS developer API documentation is available for <ulink url="https://otrs.github.io/doc/api/otrs/stable/Perl/index.html">Perl</ulink> and <ulink url="https://otrs.github.io/doc/api/otrs/stable/JavaScript/index.html">JavaScript</ulink>.
hu: Az OTRS fejlesztői API dokumentáció elérhető a <ulink url="https://otrs.github.io/doc/api/otrs/stable/Perl/index.html">Perl</ulink> és a <ulink url="https://otrs.github.io/doc/api/otrs/stable/JavaScript/index.html">JavaScript</ulink> programnyelvekhez.

source: Developer Mailing List
hu: Fejlesztői levelezőlista

source: The OTRS developer mailing list is available at <ulink url="http://lists.otrs.org/">http://lists.otrs.org/</ulink>.
hu: Az OTRS fejlesztői levelezőlista a <ulink url="http://lists.otrs.org/">http://lists.otrs.org/</ulink> címen érhető el.

source: Contributing to OTRS
hu: Közreműködés az OTRS-ben

source: This chapter will show how you can contribute to the OTRS framework, so that other users will be able to benefit from your work.
hu: Ez a fejezet azt fogja bemutatni, hogy hogyan működhet közre az OTRS keretrendszerben azért, hogy a többi felhasználó is képes legyen hasznot húzni a munkájából.

source: Getting Started
hu: Kezdeti lépések

source: OTRS is a multi-platform web application framework which was originally developed for a trouble ticket system. It supports different web servers and databases.
hu: Az OTRS egy többplatformos webes alkalmazás-keretrendszer, amelyet eredetileg hibajegyrendszernek fejlesztettek. Különböző webkiszolgálókat és adatbázisokat támogat.

source: This manual shows how to develop your own OTRS modules and applications based on the OTRS styleguides.
hu: Ez a kézikönyv azt mutatja be, hogy hogyan fejleszthet saját OTRS modulokat és alkalmazásokat az OTRS stílus útmutatók alapján.

source: OTRS Internals - How it Works
hu: OTRS belsőségek - hogyan működik

source: How to Extend OTRS
hu: Hogyan bővíthető az OTRS

source: How to Publish Your OTRS Extensions
hu: Hogyan tehetők közzé az OTRS kiterjesztések

source: Accessibility Guide
hu: Akadálymentesítési útmutató

source: This document is supposed to explain basics about accessibility issues and give guidelines for contributions to OTRS.
hu: Ez a dokumentum hivatott elmagyarázni az akadálymentesítési problémákkal kapcsolatos alapokat, és irányelveket ad az OTRS-ben való közreműködéshez.

source: Accessibility Basics
hu: Akadálymentesítési alapok

source: What is Accessibility?
hu: Mi az akadálymentesítés?

source: Accessibility is a general term used to describe the degree to which a product, device, service or environment is accessible by as many people as possible. Accessibility can be viewed as the "ability to access" and possible benefit of some system or entity. Accessibility is often used to focus on people with disabilities and their right of access to entities, often through use of assistive technology.
hu: Az akadálymentesítés egy általános kifejezés annak leírásához, hogy egy termék, eszköz, szolgáltatás vagy környezet milyen mértékben érhető el a lehető legtöbb ember által. Az akadálymentesítés tekinthető úgyis mint „képesség a hozzáféréshez”, és néhány rendszer vagy dolog lehetséges előnyeként. Az akadálymentesítés gyakran a fogyatékkal rendelkező emberekre és a dolgokhoz való hozzáférésük jogára összpontosít, gyakran kisegítő technológiák használatán keresztül.

source: In the context of web development, accessibility has a focus on enabling people with impairments full access to web interfaces. For example, this group of people can include partially visually impaired or completely blind people. While the former can still partially use the GUI, the latter have to completely rely on assistive technologies such as software which reads the screen to them (screen readers).
hu: A webfejlesztés környezetében akadálymentesítéskor a sérült embereknek a webes felületekhez való teljes hozzáférés engedélyezésén van a hangsúly. Például az emberek ezen csoportja részlegesen látássérült vagy teljesen vak embereket tartalmazhat. Míg az előbbiek továbbra is képesek részlegesen használni a grafikus felhasználói felületet, addig az utóbbiaknak teljes mértékben a kisegítő technológiákra kell támaszkodniuk, az olyan szoftverekre, amelyek felolvassák számukra a képernyőt (képernyőolvasók).

source: Why is it important for OTRS?
hu: Miért fontos ez az OTRS-nél?

source: To enable impaired users access to OTRS systems is a valid goal in itself. It shows respect.
hu: A sérült felhasználóknak történő hozzáférés engedélyezése az OTRS rendszerekhez önmagában indokolt cél. Tiszteletet tanúsít.

source: Furthermore, fulfilling accessibility standards is becoming increasingly important in the public sector (government institutions) and large companies, which both belong to the target markets of OTRS.
hu: Továbbá az akadálymentesítési szabványok teljesítése egyre inkább fontossá válik az állami szektorban (kormányzati intézményeknél) és a nagyvállalatoknál, amely mindkettő az OTRS célcsoportjához tartozik.

source: How can I successfully work on accessibility issues even if I am not disabled?
hu: Hogyan tudok sikeresen dolgozni az akadálymentesítési problémákon akkor is, ha nem vagyok fogyatékos?

source: This is very simple. Pretend to be blind.
hu: Ez nagyon egyszerű. Tegyen úgy, mintha vak lenne.

source: Don't
hu: Ne tegye a következőket:

source: use the Mouse and
hu: ne használja az egeret

source: look at the screen.
hu: ne nézzen a képernyőre

source: Then try to use OTRS with the help of a screen reader and your keyboard only. This should give you an idea of how it will feel for a blind person.
hu: Ezután próbálja meg az OTRS-t csak egy képernyőolvasó és a billentyűzet segítségével használni. Ez ötletet adhat arra, hogy mit fog érezni egy vak ember.

source: Ok, but I don't have a screen reader!
hu: Rendben, de nincs képernyőolvasóm!

source: While commercial screen readers such as JAWS (perhaps the best known one) can be extremely expensive, there are open source screen readers which you can install and use:
hu: Amíg a kereskedelmi képernyőolvasók - mint például a JAWS (talán a legismertebb) - nagyon drágák lehetnek, léteznek nyílt forrású képernyőolvasók, amelyeket telepíthet és használhat:

source: <ulink url="http://www.nvaccess.org/">NVDA</ulink>, a screen reader for Windows.
hu: <ulink url="http://www.nvaccess.org/">NVDA</ulink>, egy képernyőolvasó Windows alá.

source: <ulink url="https://wiki.gnome.org/Projects/Orca">ORCA</ulink>, a screen reader for Gnome/Linux.
hu: <ulink url="https://wiki.gnome.org/Projects/Orca">ORCA</ulink>, egy képernyőolvasó Gnome/Linux alá.

source: Now you don't have an excuse any more. ;)
hu: Most már nincs többé mentsége. ;)

source: Accessibility Standards
hu: Akadálymentesítési szabványok

source: This section is included for reference only, you do not have to study the standards themselves to be able to work on accessibility issues in OTRS. We'll try to extract the relevant guidelines in this document.
hu: Ez a szakasz csak hivatkozásként szolgál, nem kell magát a szabványokat áttanulmányoznia ahhoz, hogy képes legyen akadálymentesítési problémákon dolgozni az OTRS-ben. Megpróbáljuk kigyűjteni a fontos irányelveket ebben a dokumentumban.

source: Web Content Accessibility Guidelines (WCAG)
hu: Webtartalom akadálymentesítési irányelvek (WCAG)

source: This W3C standard gives general guidelines for how to create accessible web pages.
hu: Ez a W3C szabvány általános irányelveket ad ahhoz, hogyan hozhatók létre akadálymentes weboldalak.

source: <ulink url="http://www.w3.org/WAI/WCAG20/quickref/">How to Meet WCAG 2.0</ulink>
hu: <ulink url="http://www.w3.org/WAI/WCAG20/quickref/">Hogyan tegyen eleget a WCAG 2.0 szabványnak</ulink>

source: <ulink url="http://www.w3.org/TR/UNDERSTANDING-WCAG20/">Understanding WCAG 2.0</ulink>
hu: <ulink url="http://www.w3.org/TR/UNDERSTANDING-WCAG20/">A WCAG 2.0 megértése</ulink>

source: WCAG has different levels of accessibility support. We currently plan to support level A, as AA and AAA deal with matters that seem not relevant for OTRS.
hu: A WCAG az akadálymentesítési támogatás különböző szintjeivel rendelkezik. Jelenleg az A szint támogatását tervezzük, ugyanis az AA és az AAA olyan kérdésekkel foglalkozik, amely nem tűnik fontosnak az OTRS-nél.

source: Accessible Rich Internet Applications (WAI-ARIA) 1.0
hu: Akadálymentes gazdag internetes alkalmazások (WAI-ARIA) 1.0

source: This standard deals with the special issues arising from the shift away from static content to dynamic web applications. It deals with questions like how a user can be notified of changes in the user interface resulting from AJAX requests, for example.
hu: Ez a szabvány foglalkozik a statikus tartalom eltolásából eredő különleges problémákkal a dinamikus webalkalmazásoknál. Olyan kérdésekkel foglalkozik, mint például hogyan értesülhet a felhasználó az AJAX kérésekből eredményezett felhasználói felület változásairól.

source: Implementation guidelines
hu: Megvalósítási irányelvek

source: Provide alternatives for non-text content
hu: Alternatívák biztosítása a nem szöveges tartalomhoz

source: Goal: <emphasis>All non-text content that is presented to the user has a text alternative that serves the equivalent purpose.</emphasis> (WCAG 1.1.1)
hu: Cél: <emphasis>a felhasználónak megjelenő összes nem szöveges tartalomnak legyen szöveges alternatívája, amely ugyanazt a célt szolgálja.</emphasis> (WCAG 1.1.1)

source: It is very important to understand that screen readers can only present textual information and available metadata to the user. To give you an example, whenever a screen reader sees <literal>&lt;a href="#" class="CloseLink"&gt;&lt;/a&gt;</literal>, it can only read "link" to the user, but not the target of this link. With a slight improvement, it would be accessible: <literal>&lt;a href="#" class="CloseLink" title="Close this widget"&gt;&lt;/a&gt;</literal>. In this case the user would hear "link close this widget", voila!
hu: Nagyon fontos megérteni, hogy a képernyőolvasók csak a szöveges információkat és az elérhető metaadatokat tudják megjeleníteni a felhasználónak. Hogy egy példát mondjunk, amikor egy képernyőolvasó a <literal>&lt;a href="#" class="CloseLink"&gt;&lt;/a&gt;</literal> hivatkozást látja, akkor csak a „hivatkozást” tudja felolvasni a felhasználónak, nem a hivatkozás célját. Egy apró fejlesztéssel akadálymentessé válhat: <literal>&lt;a href="#" class="CloseLink" title="Felületi elem bezárása"&gt;&lt;/a&gt;</literal>. Ebben az esetben a felhasználó a „hivatkozás felületi elem bezárása” szöveget hallhatja, íme!

source: It is important to always formulate the text in a most "speaking" way. Just imagine it is the only information that you have. Will it help you? Can you understand its purpose just by hearing it?
hu: Fontos, hogy a szöveget mindig a leginkább „beszédes” módon fogalmazza meg. Egyszerűen képzelje el, hogy csak ennyi információval rendelkezik. Segíteni fog önnek? Képes megérteni a célját pusztán hallás után?

source: Please follow these rules when working on OTRS:
hu: Kövesse ezeket a szabályokat, amikor az OTRS-en dolgozik:

source: <emphasis>Rule</emphasis>: Wherever possible, use speaking texts and formulate in real, understandable and precise sentences. "Close this widget" is much better than "Close", because the latter is redundant.
hu: <emphasis>Szabály</emphasis>: Ahol csak lehetséges, használjon beszédes szövegeket, és fogalmazzon meg valódi, érthető és pontos mondatokat. A „Felületi elem bezárása” sokkal jobb mint a „Bezárás”, mert az utóbbi fölösleges.

source: <emphasis>Rule</emphasis>: Links always must have either text content that is spoken by the screen reader (<literal>&lt;a href="#" &gt;Delete this entry&lt;/a&gt;</literal>), or a <literal>title</literal> attribute (<literal>&lt;a href="#" title="Close this widget"&gt;&lt;/a&gt;</literal>).
hu: <emphasis>Szabály</emphasis>: A hivatkozásoknak mindig legyen vagy olyan szöveges tartalma, amelyet a képernyőolvasók kimondanak (<literal>&lt;a href="#" &gt;A bejegyzés törlése&lt;/a&gt;</literal>), vagy <literal>title</literal> attribútuma (<literal>&lt;a href="#" title="Felületi elem bezárása"&gt;&lt;/a&gt;</literal>).

source: <emphasis>Rule</emphasis>: Images must always have an alternative text that can be read to the user (<literal>&lt;img src="house.png" alt="Image of a house" /&gt;</literal>).
hu: <emphasis>Szabály</emphasis>: A képeknek mindig legyen alternatív szövege, amely felolvasható a felhasználónak (<literal>&lt;img src="house.png" alt="Fénykép egy házról" /&gt;</literal>).

source: Make navigation easy
hu: A navigáció könnyűvé tétele

source: Goal: <emphasis>Allow the user to easily navigate the current page and the entire application.</emphasis>
hu: Cél: <emphasis>lehetővé tenni a felhasználónak, hogy könnyen navigáljon az aktuális oldalon és az egész alkalmazásban.</emphasis>

source: The <literal>title</literal> tag is the first thing a user hears from the screen reader when opening a web page. For OTRS, there is also always just one <literal>h1</literal> element on the page, indicating the current page (it contains part of the information from <literal>title</literal>). This navigational information helps the user to understand where they are, and what the purpose of the current page is.
hu: A <literal>title</literal> címke az első dolog, amit a felhasználó hall a képernyőolvasótól, amikor megnyit egy weboldalt. Az OTRS-nél mindig csak egyetlen <literal>h1</literal> elem van az oldalon az aktuális oldalt jelezve (a <literal>title</literal> elemből vett információ egy részét tartalmazza). Ez a navigációs információ segít megérteni a felhasználónak, hogy éppen hol van, és mi az aktuális oldal célja.

source: <emphasis>Rule</emphasis>: Always give a precise title to the page that allows the user to understand where they currently are.
hu: <emphasis>Szabály</emphasis>: Mindig pontos címet adjon az oldalnak, amely lehetővé teszi a felhasználónak annak megértését, hogy jelenleg éppen hol van.

source: Screen readers can use the built-in document structure of HTML (headings <literal>h1</literal> to <literal>h6</literal>) to determine the structure of a document and to allow the user to jump around from section to section. However, this is not enough to reflect the structure of a dynamic web application. That's why ARIA defines several "landmark" roles that can be given to elements to indicate their navigational significance.
hu: A képernyőolvasók képesek a HTML beépített dokumentumszerkezetét használni (címsorok <literal>h1</literal> és <literal>h6</literal> között) egy dokumentum szerkezetének meghatározásához, és lehetővé tenni a felhasználónak, hogy egyik szakaszról a másik szakaszra ugorjon. Azonban ez nem elegendő egy dinamikus webalkalmazás szerkezetének kifejezéséhez. Ez az, amiért az ARIA számos olyan „iránypont” szerepet határoz meg, amelyek megadhatók az elemeknek, hogy jelezzék a navigációs jelentésüket.

source: To keep the validity of the HTML documents, the <literal>role</literal> attributes (ARIA landmark roles) are not inserted into the source code directly, but instead by classes which will later be used by the JavaScript functions in <literal>OTRS.UI.Accessibility</literal> to set the corresponding <literal>role</literal> attributes on the node.
hu: A HTML dokumentumok érvényességének megtartásához a <literal>role</literal> attribútumok (ARIA iránypont szerepek) nincsenek közvetlenül a forráskódba beszúrva, hanem olyan osztályok által kerülnek beszúrásra, amelyeket később az <literal>OTRS.UI.Accessibility</literal> osztályban lévő JavaScript függvények fognak használni a megfelelő <literal>role</literal> attribútumok beszúrásához a csomópontba.

source: <emphasis>Rule</emphasis>: Use WAI-ARIA Landmark Roles to structure the content for screen readers.
hu: <emphasis>Szabály</emphasis>: Használjon WAI-ARIA iránypont szabályokat a tartalom szerkezetbe foglalásához a képernyőolvasók számára.

source: Banner: <literal>&lt;div class="ARIARoleBanner"&gt;&lt;/div&gt;</literal> will become <literal>&lt;div class="ARIARoleBanner" role="banner"&gt;&lt;/div&gt;</literal>
hu: Reklámcsík: <literal>&lt;div class="ARIARoleBanner"&gt;&lt;/div&gt;</literal> helyett <literal>&lt;div class="ARIARoleBanner" role="banner"&gt;&lt;/div&gt;</literal> lesz

source: Navigation: <literal>&lt;div class="ARIARoleNavigation"&gt;&lt;/div&gt;</literal> will become <literal>&lt;div class="ARIARoleNavigation" role="navigation"&gt;&lt;/div&gt;</literal>
hu: Navigáció: <literal>&lt;div class="ARIARoleNavigation"&gt;&lt;/div&gt;</literal> helyett <literal>&lt;div class="ARIARoleNavigation" role="navigation"&gt;&lt;/div&gt;</literal> lesz

source: Search function: <literal>&lt;div class="ARIARoleSearch"&gt;&lt;/div&gt;</literal> will become <literal>&lt;div class="ARIARoleSearch" role="search"&gt;&lt;/div&gt;</literal>
hu: Keresőfunkció: <literal>&lt;div class="ARIARoleSearch"&gt;&lt;/div&gt;</literal> helyett <literal>&lt;div class="ARIARoleSearch" role="search"&gt;&lt;/div&gt;</literal> lesz

source: Main application area: <literal>&lt;div class="ARIARoleMain"&gt;&lt;/div&gt;</literal> will become <literal>&lt;div class="ARIARoleMain" role="main"&gt;&lt;/div&gt;</literal>
hu: Fő alkalmazásterület: <literal>&lt;div class="ARIARoleMain"&gt;&lt;/div&gt;</literal> helyett <literal>&lt;div class="ARIARoleMain" role="main"&gt;&lt;/div&gt;</literal> lesz

source: Footer: <literal>&lt;div class="ARIARoleContentinfo"&gt;&lt;/div&gt;</literal> will become <literal>&lt;div class="ARIARoleContentinfo" role="contentinfo"&gt;&lt;/div&gt;</literal>
hu: Lábléc: <literal>&lt;div class="ARIARoleContentinfo"&gt;&lt;/div&gt;</literal> helyett <literal>&lt;div class="ARIARoleContentinfo" role="contentinfo"&gt;&lt;/div&gt;</literal> lesz

source: For navigation inside of <literal>&lt;form&lt;</literal> elements, it is necessary for the impaired user to know what each input elements purpose is. This can be achieved by using standard HTML <literal>&lt;label&gt;</literal> elements which create a link between the label and the form element.
hu: A <literal>&lt;form&lt;</literal> elemeken belüli navigációnál szükséges a fogyatékos felhasználónak tudnia, hogy mi az egyes beviteli elemek célja. Ezt el lehet érni a szabványos HTML <literal>&lt;label&gt;</literal> elemek használatával, amelyek kapcsolatot hoznak létre a címke és az űrlap elem között.

source: When an input element gets focus, the screen reader will usually read the connected label, so that the user can hear its exact purpose. An additional benefit for seeing users is that they can click on the label, and the input element will get focus (especially helpful for checkboxes, for example).
hu: Amikor egy beviteli elem megkapja a fókuszt, akkor a képernyőolvasó általában fel fogja olvasni a hozzá kapcsolt címkét, így a felhasználó hallhatja annak pontos célját. További előnye a látó felhasználóknak, hogy rákattinthatnak a címkére, és a beviteli elem meg fogja kapni a fókuszt (különösen jelölőnégyzeteknél hasznos például).

source: <emphasis>Rule</emphasis>: Provide <literal>&lt;label&gt;</literal> elements for <emphasis>all</emphasis> form element (<literal>input</literal>, <literal>select</literal>, <literal>textarea</literal>) fields.
hu: <emphasis>Szabály</emphasis>: Adjon meg <literal>&lt;label&gt;</literal> elemeket az <emphasis>összes</emphasis> űrlapelem (<literal>input</literal>, <literal>select</literal>, <literal>textarea</literal>) mezőhöz.

source: Example: <literal>&lt;label for="date"&gt;Date:&lt;/label&gt;&lt;input type="text" name="date" id="date"/&gt;</literal>
hu: Példa: <literal>&lt;label for="date"&gt;Dátum:&lt;/label&gt;&lt;input type="text" name="date" id="date"/&gt;</literal>

source: Make interaction possible
hu: A kölcsönhatás lehetővé tétele

source: Goal: <emphasis>Allow the user to perform all interactions just by using the keyboard.</emphasis>
hu: Cél: <emphasis>lehetővé tenni a felhasználónak, hogy az összes kölcsönhatást végrehajtsa pusztán a billentyűzet használatával.</emphasis>

source: While it is technically possible to create interactions with JavaScript on arbitrary HTML elements, this must be limited to elements that a user can interact with by using the keyboard. Specifically, they need to be able to give focus to the element and to interact with it. For example, a push button to toggle a widget should not be realized by using a <literal>span</literal> element with an attached JavaScript <literal>onclick</literal> event listener, but it should be (or contain) an <literal>a</literal> tag to make it clear to the screen reader that this element can cause interaction.
hu: Miközben technikailag lehetséges kölcsönhatásokat létrehozni JavaScript segítségével tetszőleges HTML elemen, ezt korlátozni kell azon elemekre, amelyekkel a felhasználó kölcsönhatásba léphet a billentyűzet használatával. Különösen azt kell lehetővé tenni számukra, hogy fókuszt adjanak az elemnek, és kölcsönhatásba lépjenek vele. Például egy felületi elemet ki-be kapcsoló nyomógombot nem egy JavaScript <literal>onclick</literal> eseményfigyelővel összekötött <literal>span</literal> elem használatával kellene megoldani, hanem egy <literal>a</literal> címkének kellene lennie (vagy tartalmaznia kellene), hogy világossá tegye a képernyőolvasónak, hogy ez az elem kölcsönhatást okozhat.
