Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # -- # Kernel/System/DynamicField/Driver/Password.pm - Driver for DynamicField Password backend # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::DynamicField::Driver::Password; use strict; use warnings; use Kernel::System::VariableCheck qw(:all); use Kernel::System::DynamicFieldValue; use base qw(Kernel::System::DynamicField::Driver::BaseText); our @ObjectDependencies = ( 'Kernel::Config', 'Kernel::System::DynamicFieldValue', 'Kernel::System::Main', );
hu: # -- # Kernel/System/DynamicField/Driver/Password.pm - Illesztőprogram a dinamikus mező jelszó háttérprogramjához # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::DynamicField::Driver::Password; use strict; use warnings; use Kernel::System::VariableCheck qw(:all); use Kernel::System::DynamicFieldValue; use base qw(Kernel::System::DynamicField::Driver::BaseText); our @ObjectDependencies = ( 'Kernel::Config', 'Kernel::System::DynamicFieldValue', 'Kernel::System::Main', );

source: This is the common header that can be found in common OTRS modules. The class/package name is declared via the <literal>package</literal> keyword. Notice that <literal>BaseText</literal> is used as base class.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a <literal>package</literal> kulcsszón keresztül van deklarálva. Figyelje meg, hogy a <literal>BaseText</literal> osztályt használják alaposztályként.

source: sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # set field behaviors $Self->{Behaviors} = { 'IsACLReducible' => 0, 'IsNotificationEventCondition' => 1, 'IsSortable' => 0, 'IsFiltrable' => 0, 'IsStatsCondition' => 1, 'IsCustomerInterfaceCapable' => 1, }; # get the Dynamic Field Backend custom extensions my $DynamicFieldDriverExtensions = $Kernel::OM->Get('Kernel::Config')->Get('DynamicFields::Extension::Driver::Password'); EXTENSION: for my $ExtensionKey ( sort keys %{$DynamicFieldDriverExtensions} ) { # skip invalid extensions next EXTENSION if !IsHashRefWithData( $DynamicFieldDriverExtensions->{$ExtensionKey} ); # create a extension config shortcut my $Extension = $DynamicFieldDriverExtensions->{$ExtensionKey}; # check if extension has a new module if ( $Extension->{Module} ) { # check if module can be loaded if ( !$Kernel::OM->Get('Kernel::System::Main')->RequireBaseClass( $Extension->{Module} ) ) { die "Can't load dynamic fields backend module" . " $Extension->{Module}! $@"; } } # check if extension contains more behaviors if ( IsHashRefWithData( $Extension->{Behaviors} ) ) { %{ $Self->{Behaviors} } = ( %{ $Self->{Behaviors} }, %{ $Extension->{Behaviors} } ); } } return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # mezőviselkedések beállítása $Self->{Behaviors} = { 'IsACLReducible' => 0, 'IsNotificationEventCondition' => 1, 'IsSortable' => 0, 'IsFiltrable' => 0, 'IsStatsCondition' => 1, 'IsCustomerInterfaceCapable' => 1, }; # a dinamikus mező háttérprogram egyéni kiterjesztéseinek lekérése my $DynamicFieldDriverExtensions = $Kernel::OM->Get('Kernel::Config')->Get('DynamicFields::Extension::Driver::Password'); EXTENSION: for my $ExtensionKey ( sort keys %{$DynamicFieldDriverExtensions} ) { # érvénytelen kiterjesztések kihagyása next EXTENSION if !IsHashRefWithData( $DynamicFieldDriverExtensions->{$ExtensionKey} ); # egy kiterjesztés beállítás gyors elérésének létrehozása my $Extension = $DynamicFieldDriverExtensions->{$ExtensionKey}; # annak ellenőrzése, hogy a kiterjesztésnek van-e új modulja if ( $Extension->{Module} ) { # annak ellenőrzése, hogy a modul betölthető-e if ( !$Kernel::OM->Get('Kernel::System::Main')->RequireBaseClass( $Extension->{Module} ) ) { die "Nem lehet betölteni a dinamikus mezők háttérprogram modulját:" . " $Extension->{Module}! $@"; } } # annak ellenőrzése, hogy a kiterjesztés tartalmaz-e további viselkedéseket if ( IsHashRefWithData( $Extension->{Behaviors} ) ) { %{ $Self->{Behaviors} } = ( %{ $Self->{Behaviors} }, %{ $Extension->{Behaviors} } ); } } return $Self; }

source: It is important to define the behaviors correctly as the field might or might not be used in certain screens, functions that depends on behaviors that are not active for this particular field might not be needed to be implemented.
hu: Fontos a viselkedéseket helyesen meghatározni, mivel a mező lehet használható vagy lehet nem használható bizonyos képernyőkön. Azokat a függvényeket esetleg nem szükséges megvalósítani, amelyek olyan viselkedésektől függenek, amelyek nem aktívak ennél a bizonyos mezőnél.

source: Drivers are created only by the <literal>BackendObject</literal> and not directly from any other module.
hu: Az illesztőprogramokat kizárólag a <literal>BackendObject</literal> hozza létre, és nem közvetlenül bármely egyéb modulból.

source: sub EditFieldRender { my ( $Self, %Param ) = @_; # take config from field config my $FieldConfig = $Param{DynamicFieldConfig}->{Config}; my $FieldName = 'DynamicField_' . $Param{DynamicFieldConfig}->{Name}; my $FieldLabel = $Param{DynamicFieldConfig}->{Label}; my $Value = ''; # set the field value or default if ( $Param{UseDefaultValue} ) { $Value = ( defined $FieldConfig->{DefaultValue} ? $FieldConfig->{DefaultValue} : '' ); } $Value = $Param{Value} if defined $Param{Value}; # extract the dynamic field value from the web request my $FieldValue = $Self->EditFieldValueGet( %Param, ); # set values from ParamObject if present if ( defined $FieldValue ) { $Value = $FieldValue; } # check and set class if necessary my $FieldClass = 'DynamicFieldText W50pc'; if ( defined $Param{Class} && $Param{Class} ne '' ) { $FieldClass .= ' ' . $Param{Class}; } # set field as mandatory $FieldClass .= ' Validate_Required' if $Param{Mandatory}; # set error css class $FieldClass .= ' ServerError' if $Param{ServerError}; my $HTMLString = <<"EOF"; <input type="password" class="$FieldClass" id="$FieldName" name="$FieldName" title="$FieldLabel" value="$Value" /> EOF if ( $Param{Mandatory} ) { my $DivID = $FieldName . 'Error'; # for client side validation $HTMLString .= <<"EOF"; <div id="$DivID" class="TooltipErrorMessage"> <p> \$Text{"This field is required."} </p> </div> EOF } if ( $Param{ServerError} ) { my $ErrorMessage = $Param{ErrorMessage} || 'This field is required.'; my $DivID = $FieldName . 'ServerError'; # for server side validation $HTMLString .= <<"EOF"; <div id="$DivID" class="TooltipErrorMessage"> <p> \$Text{"$ErrorMessage"} </p> </div> EOF } # call EditLabelRender on the common Driver my $LabelString = $Self->EditLabelRender( %Param, DynamicFieldConfig => $Param{DynamicFieldConfig}, Mandatory => $Param{Mandatory} || '0', FieldName => $FieldName, ); my $Data = { Field => $HTMLString, Label => $LabelString, }; return $Data; }
hu: sub EditFieldRender { my ( $Self, %Param ) = @_; # beállítások átvétele a mezőbeállításokból my $FieldConfig = $Param{DynamicFieldConfig}->{Config}; my $FieldName = 'DynamicField_' . $Param{DynamicFieldConfig}->{Name}; my $FieldLabel = $Param{DynamicFieldConfig}->{Label}; my $Value = ''; # a mezőérték beállítása vagy alapértelmezett if ( $Param{UseDefaultValue} ) { $Value = ( defined $FieldConfig->{DefaultValue} ? $FieldConfig->{DefaultValue} : '' ); } $Value = $Param{Value} if defined $Param{Value}; # a dinamikus mező értékének kibontása a webkérésből my $FieldValue = $Self->EditFieldValueGet( %Param, ); # értékek beállítása a paraméterobjektumból, ha létezik if ( defined $FieldValue ) { $Value = $FieldValue; } # osztály ellenőrzése és beállítása, ha szükséges my $FieldClass = 'DynamicFieldText W50pc'; if ( defined $Param{Class} && $Param{Class} ne '' ) { $FieldClass .= ' ' . $Param{Class}; } # mező beállítása kötelezőként $FieldClass .= ' Validate_Required' if $Param{Mandatory}; # hiba CSS osztály beállítása $FieldClass .= ' ServerError' if $Param{ServerError}; my $HTMLString = <<"EOF"; <input type="password" class="$FieldClass" id="$FieldName" name="$FieldName" title="$FieldLabel" value="$Value" /> EOF if ( $Param{Mandatory} ) { my $DivID = $FieldName . 'Error'; # kliensoldali ellenőrzéshez $HTMLString .= <<"EOF"; <div id="$DivID" class="TooltipErrorMessage"> <p> \$Text{"Ez a mező kötelező."} </p> </div> EOF } if ( $Param{ServerError} ) { my $ErrorMessage = $Param{ErrorMessage} || 'Ez a mező kötelező.'; my $DivID = $FieldName . 'ServerError'; # kiszolgálóoldali ellenőrzéshez $HTMLString .= <<"EOF"; <div id="$DivID" class="TooltipErrorMessage"> <p> \$Text{"$ErrorMessage"} </p> </div> EOF } # az EditLabelRender meghívása a közös illesztőprogramon my $LabelString = $Self->EditLabelRender( %Param, DynamicFieldConfig => $Param{DynamicFieldConfig}, Mandatory => $Param{Mandatory} || '0', FieldName => $FieldName, ); my $Data = { Field => $HTMLString, Label => $LabelString, }; return $Data; }

source: This function is the responsible to create the HTML representation of the field and its label, and is used in the edit screens like <literal>AgentTicketPhone</literal>, <literal>AgentTicketNote</literal>, etc.
hu: Ez a függvény felelős a mező és annak címkéje HTML ábrázolásának létrehozásáért, és olyan szerkesztő képernyőkön használják, mint például az <literal>AgentTicketPhone</literal>, <literal>AgentTicketNote</literal>, stb.

source: sub DisplayValueRender { my ( $Self, %Param ) = @_; # set HTMLOutput as default if not specified if ( !defined $Param{HTMLOutput} ) { $Param{HTMLOutput} = 1; } my $Value; my $Title; # check if field is set to show password or not if ( defined $Param{DynamicFieldConfig}->{Config}->{ShowValue} && $Param{DynamicFieldConfig}->{Config}->{ShowValue} eq 'Yes' ) { # get raw Title and Value strings from field value $Value = defined $Param{Value} ? $Param{Value} : ''; $Title = $Value; } else { # show the mask and not the value $Value = $Param{DynamicFieldConfig}->{Config}->{ValueMask} || ''; $Title = 'The value of this field is hidden.' } # HTMLOutput transformations if ( $Param{HTMLOutput} ) { $Value = $Param{LayoutObject}->Ascii2Html( Text => $Value, Max => $Param{ValueMaxChars} || '', ); $Title = $Param{LayoutObject}->Ascii2Html( Text => $Title, Max => $Param{TitleMaxChars} || '', ); } else { if ( $Param{ValueMaxChars} && length($Value) > $Param{ValueMaxChars} ) { $Value = substr( $Value, 0, $Param{ValueMaxChars} ) . '...'; } if ( $Param{TitleMaxChars} && length($Title) > $Param{TitleMaxChars} ) { $Title = substr( $Title, 0, $Param{TitleMaxChars} ) . '...'; } } # create return structure my $Data = { Value => $Value, Title => $Title, }; return $Data; }
hu: sub DisplayValueRender { my ( $Self, %Param ) = @_; # a HTMLOutput beállítása alapértelmezettként, ha nincs megadva if ( !defined $Param{HTMLOutput} ) { $Param{HTMLOutput} = 1; } my $Value; my $Title; # annak ellenőrzése, hogy a mező be van-e állítva a jelszó megjelenítéséhez vagy sem if ( defined $Param{DynamicFieldConfig}->{Config}->{ShowValue} && $Param{DynamicFieldConfig}->{Config}->{ShowValue} eq 'Yes' ) { # a nyers Title és Value szövegek lekérése a mezőértékből $Value = defined $Param{Value} ? $Param{Value} : ''; $Title = $Value; } else { # a maszk megjelenítése az érték helyett $Value = $Param{DynamicFieldConfig}->{Config}->{ValueMask} || ''; $Title = 'A mező értéke rejtve van.' } # HTMLOutput átalakítások if ( $Param{HTMLOutput} ) { $Value = $Param{LayoutObject}->Ascii2Html( Text => $Value, Max => $Param{ValueMaxChars} || '', ); $Title = $Param{LayoutObject}->Ascii2Html( Text => $Title, Max => $Param{TitleMaxChars} || '', ); } else { if ( $Param{ValueMaxChars} && length($Value) > $Param{ValueMaxChars} ) { $Value = substr( $Value, 0, $Param{ValueMaxChars} ) . '...'; } if ( $Param{TitleMaxChars} && length($Title) > $Param{TitleMaxChars} ) { $Title = substr( $Title, 0, $Param{TitleMaxChars} ) . '...'; } } # visszatérési szerkezet létrehozása my $Data = { Value => $Value, Title => $Title, }; return $Data; }

source: <code>DisplayValueRender()</code> function returns the field value as a plain text as well as its title (both can be translated). For this particular example we are checking if the password should be revealed or display a predefined mask by a configuration parameter in the Dynamic Field.
hu: A <code>DisplayValueRender()</code> függvény egyszerű szövegként adja vissza a mező értékét és annak feliratát (mindkettő lefordítható). Ennél a bizonyos példánál azt ellenőrizzük, hogy a jelszót meg kell-e mutatni, vagy egy beállítási paraméter által előre meghatározott maszkot kell-e megjeleníteni a dinamikus mezőben.

source: sub ReadableValueRender { my ( $Self, %Param ) = @_; my $Value; my $Title; # check if field is set to show password or not if ( defined $Param{DynamicFieldConfig}->{Config}->{ShowValue} && $Param{DynamicFieldConfig}->{Config}->{ShowValue} eq 'Yes' ) { # get raw Title and Value strings from field value $Value = $Param{Value} // ''; $Title = $Value; } else { # show the mask and not the value $Value = $Param{DynamicFieldConfig}->{Config}->{ValueMask} || ''; $Title = 'The value of this field is hidden.' } # cut strings if needed if ( $Param{ValueMaxChars} && length($Value) > $Param{ValueMaxChars} ) { $Value = substr( $Value, 0, $Param{ValueMaxChars} ) . '...'; } if ( $Param{TitleMaxChars} && length($Title) > $Param{TitleMaxChars} ) { $Title = substr( $Title, 0, $Param{TitleMaxChars} ) . '...'; } # create return structure my $Data = { Value => $Value, Title => $Title, }; return $Data; }
hu: sub ReadableValueRender { my ( $Self, %Param ) = @_; my $Value; my $Title; # annak ellenőrzése, hogy a mező be van-e állítva a jelszó megjelenítéséhez vagy sem if ( defined $Param{DynamicFieldConfig}->{Config}->{ShowValue} && $Param{DynamicFieldConfig}->{Config}->{ShowValue} eq 'Yes' ) { # a nyers Title és Value szövegek lekérése a mezőértékből $Value = $Param{Value} // ''; $Title = $Value; } else { # a maszk megjelenítése az érték helyett $Value = $Param{DynamicFieldConfig}->{Config}->{ValueMask} || ''; $Title = 'A mező értéke rejtve van.' } # szövegek levágása, ha szükséges if ( $Param{ValueMaxChars} && length($Value) > $Param{ValueMaxChars} ) { $Value = substr( $Value, 0, $Param{ValueMaxChars} ) . '...'; } if ( $Param{TitleMaxChars} && length($Title) > $Param{TitleMaxChars} ) { $Title = substr( $Title, 0, $Param{TitleMaxChars} ) . '...'; } # visszatérési szerkezet létrehozása my $Data = { Value => $Value, Title => $Title, }; return $Data; }

source: This function is similar to <code>DisplayValueRender()</code> but is used in places where there is no <literal>LayoutObject</literal>.
hu: Ez a függvény hasonló a <code>DisplayValueRender()</code> függvényhez, de olyan helyeken használják, ahol nincs <literal>LayoutObject</literal>.

source: Other Functions:
hu: Egyéb függvények:

source: The following are other functions that are might needed if the new Dynamic Field does not inherit from other classes. To see the complete code of this functions please take a look directly into the files <filename>Kernel/System/DynamicField/Driver/Base.pm</filename> and <filename>Kernel/System/DynamicField/Driver/BaseText.pm</filename>
hu: A következők olyan egyéb függvények, amelyek talán szükségesek lehetnek, ha egy új dinamikus mező nem örököl más osztályokból. Ezen függvények teljes kódjának megtekintéséhez nézzen bele közvetlenül a <filename>Kernel/System/DynamicField/Driver/Base.pm</filename> és a <filename>Kernel/System/DynamicField/Driver/BaseText.pm</filename> fájlokba.

source: This function retrieves the value from the field on a specified Object. In this case we are returning the first text value, since the field only stores one text value at time.
hu: Ez a függvény lekéri az értéket a mezőből egy adott objektumnál. Ebben az esetben az első szövegértéket adjuk vissza, mivel a mező egyszerre csak egy szövegértéket tárol.

source: <code>ValueSet()</code> is used to store a Dynamic Field value. In this case this field only stores one text type value. Other fields could store more than one value on either <literal>ValueText</literal>, <literal>ValueDateTime</literal> or <literal>ValueInt</literal> format.
hu: A <code>ValueSet()</code> függvényt egy dinamikus mező érték tárolásához használják. Ebben az esetben a mező csak egy szöveg típusú értéket tárol. Más mezők tárolhatnak egynél több értéket is a <literal>ValueText</literal>, a <literal>ValueDateTime</literal> vagy a <literal>ValueInt</literal> formátumnál.

source: This function is used to delete one field value attached to a particular object ID. For example if the instance of an object is to be deleted, then there is no reason to have the field value stored in the database for that particular object instance.
hu: Ezt a függvényt egy mező értékének törléséhez használják, amely egy bizonyos objektumazonosítóhoz van csatolva. Például ha egy objektum példánynak törlésére készülnek, akkor nincs oka a mezőérték tárolásának az adatbázisban annál a bizonyos objektumpéldánynál.

source: <code>AllValuesDelete()</code> function is used to delete all values from a certain Dynamic Field. This function is very useful when a Dynamic Field is going to be deleted.
hu: Az <code>AllValuesDelete()</code> függvényt az összes érték törléséhez használják egy bizonyos dinamikus mezőből. Ez a függvény nagyon hasznos, amikor egy dinamikus mező törlésre fog kerülni.

source: The <code>ValueValidate()</code> function is used to check if the value is consistent to its type.
hu: A <code>ValueValidate()</code> függvényt annak ellenőrzéséhez használják, hogy az érték megegyezik-e a típusának.

source: This function is used by <literal>TicketSearch</literal> core module to build the internal query to search for a ticket based on this field as a search parameter.
hu: Ezt a függvényt a <literal>TicketSearch</literal> alapmodul használja egy jegy kereséséhez szükséges belső lekérdezés felépítéséhez, ezt a mezőt alapul véve keresési paraméterként.

source: The <literal>SearchSQLOrderFieldGet</literal> is also a helper for <literal>TicketSearch</literal> module. <literal>$Param{TableAlias}</literal> should be kept and <literal>value_text</literal> could be replaced with <literal>value_date</literal> or <literal>value_int</literal> depending on the field.
hu: A <literal>SearchSQLOrderFieldGet</literal> szintén egy segítő a <literal>TicketSearch</literal> modulhoz. A <literal>$Param{TableAlias}</literal> paramétert meg kell tartani, és a <literal>value_text</literal> lecserélhető a <literal>value_date</literal> vagy a <literal>value_int</literal> paraméterrel a mezőtől függően.

source: <code>EditFieldValueGet()</code> is a function used in the edit screens of OTRS and its purpose is to get the value of the field, either from a template like generic agent profile or from a web request. This function gets the web request in the <literal>$Param{ParamObject}</literal>, that is a copy of the <literal>ParamObject</literal> of the Frontend Module or screen.
hu: Az <code>EditFieldValueGet()</code> egy olyan függvény, amelyet az OTRS szerkesztő képernyőin használnak, és a célja a mező értékének lekérése vagy egy sablonból (mint például az általános ügyintéző profilból), vagy egy webkérésből. Ez a függvény megkapja a webkérést a <literal>$Param{ParamObject}</literal> paraméterben, amely az előtétprogram-modul vagy a képernyő <literal>ParamObject</literal> objektumának egy másolata.

source: There are two return formats for this function, the normal: that is just the raw value or a structure: that is the pair field name =&gt; field value. For example a Date Dynamic Field returns normally the date as string, and if it should return a structure it returns a pair for each part of the date in the hash.
hu: Két visszatérési formátum létezik ennél a függvénynél. A normál, amely egyszerűen a nyers érték, vagy egy szerkezet, amely a mezőnév =&gt; mezőérték páros. Például egy dátum dinamikus mező normális esetben a dátumot szövegként adja vissza, és ha egy szerkezetet kell visszaadnia, akkor a kivonatban egy párost ad vissza a dátum minden egyes részéhez.

source: If the result should be a structure then, normally this is used to store its values in a template, like a generic agent profile. For example a date field uses several HTML components to build the field, like the "Used" check-box and selects for year, month, day etc.
hu: Ha az eredménynek egy szerkezetnek kell lennie, akkor normális esetben ezt arra használják, hogy az értékét egy sablonban tárolja, mint például egy általános ügyintéző profilban. Például egy dátummező számos HTML összetevőt használ a mező felépítéséhez, mint például a „használt” jelölőnégyzetet és kiválasztókat az évhez, hónaphoz, naphoz, stb.

source: This function should provide at least a method to validate if the field is empty, and return an error if the field is empty and mandatory, but it can also do more validations for other kind of fields, like if the option selected is valid, or if a date should be only in the past etc. It can provide a custom error message also.
hu: Ennek a függvénynek biztosítania kell legalább egy metódust az ellenőrzéshez, ha a mező üres, és hibát kell visszaadnia, ha a mező üres és kötelező, de végrehajthat további ellenőrzéseket is a másfajta mezőknél, mint például ha a kiválasztott lehetőség érvényes, vagy ha egy dátumnak csak a múltban kell lennie, stb. Egy egyéni hibaüzenetet is biztosíthat.

source: This function is used by ticket search dialog and it is similar to <code>EditFieldRander()</code>, but normally on a search screen small changes has to be done for all fields. For this example we use a HTML text input instead of a password input. In other fields like Dropdown field is displayed as a Multiple select in order to let the user search for more than one value at a time.
hu: Ezt a függvényt a jegykeresés párbeszédablak használja, és hasonló a <code>EditFieldRander()</code> függvényhez, de normális esetben egy keresési képernyőn kisebb változtatásokat kell elvégezni az összes mezőnél. Például ebben az esetben egy HTML szöveges beviteli mező használunk egy jelszóbeviteli mező helyett. Más mezőkben (például legördülő mező) többválasztósként jelenik meg azért, hogy egyszerre több érték keresését tegye lehetővé a felhasználónak.

source: Very similar to <code>EditFieldValueGet()</code>, but uses a different name prefix, adapted for the search dialog screen.
hu: Nagyon hasonló az <code>EditFieldValueGet()</code> függvényhez, de eltérő név előtagot használ a keresési párbeszédablak képernyőhöz átírva.

source: <code>SearchFieldParameterBuild()</code> is used also by the ticket search dialog to set the correct operator and value to do the search on this field. It also returns how the value should be displayed in the used search attributes in the results page.
hu: A <code>SearchFieldParameterBuild()</code> függvényt is a jegykeresés párbeszédablak használja a helyes operátor és érték beállításához, hogy elvégezze a keresést ezen a mezőn. Azt is visszaadja, hogy az értéket hogyan kell megjeleníteni a használt keresési attribútumokban a találatok oldalon.
