Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: The <code>_AddAction</code> function gets the configuration parameters from a new dynamic field, and it validates that the Dynamic Field name only contains letters and numbers. This function could validate any other parameter.
hu: Az <code>_AddAction</code> függvény kéri le a beállítási paramétereket egy új dinamikus mezőből, és ellenőrzi, hogy a dinamikus mező neve csak betűket és számokat tartalmaz-e. Ez a függvény képes ellenőrizni bármilyen egyéb paramétert is.

source: <literal>Name</literal>, <literal>Label</literal>, <literal>FieldOrder</literal>, <literal>Validity</literal> are common parameters for all Dynamic Fields and they are required. Each Dynamic Field has its specific configuration that must contain at least the <literal>DefaultValue</literal> parameter. In this case it also have <literal>ShowValue</literal> and <literal>ValueMask</literal> parameters for Password field.
hu: A <literal>Name</literal>, <literal>Label</literal>, <literal>FieldOrder</literal>, <literal>Validity</literal> közös paraméterek az összes dinamikus mezőnél, és ezek kötelezők. Minden egyes dinamikus mezőnek megvan a saját különleges beállítása, amelynek tartalmaznia kell legalább a <literal>DefaultValue</literal> paramétert. Ebben az esetben a <literal>ShowValue</literal> és a <literal>ValueMask</literal> paraméterekkel is rendelkezik a jelszómezőnél.

source: If the field has the ability to store a fixed list of values they should be stored in the <literal>PossibleValues</literal> parameter inside the specific configuration hash.
hu: Ha a mező rendelkezik egy rögzített listájú értékek tárolásának képességével, akkor azokat a <literal>PossibleValues</literal> paraméterben kell tárolni a különleges beállítási kivonaton belül.

source: As in other Admin Modules, if a parameter is not valid this function returns to the Add screen highlighting the erroneous form fields.
hu: Mint más adminisztrátori modulokban, ha egy paraméter nem érvényes, akkor ez a függvény visszatér a hozzáadás képernyőre, kiemelve a hibás űrlapmezőket.

source: If all the parameters are correct it creates a new Dynamic Field.
hu: Ha az összes paraméter helyes, akkor létrehoz egy új dinamikus mezőt.

source: sub _Change { my ( $Self, %Param ) = @_; my %GetParam; for my $Needed (qw(ObjectType FieldType)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$Needed ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Need $Needed", ); } } # get the object type and field type display name my $ObjectTypeName = $Self->{ObjectTypeConfig}->{ $GetParam{ObjectType} }->{DisplayName} || ''; my $FieldTypeName = $Self->{FieldTypeConfig}->{ $GetParam{FieldType} }->{DisplayName} || ''; my $FieldID = $Self->{ParamObject}->GetParam( Param => 'ID' ); if ( !$FieldID ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Need ID", ); } # get dynamic field data my $DynamicFieldData = $Self->{DynamicFieldObject}->DynamicFieldGet( ID => $FieldID, ); # check for valid dynamic field configuration if ( !IsHashRefWithData($DynamicFieldData) ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Could not get data for dynamic field $FieldID", ); } my %Config = (); # extract configuration if ( IsHashRefWithData( $DynamicFieldData->{Config} ) ) { %Config = %{ $DynamicFieldData->{Config} }; } return $Self->_ShowScreen( %Param, %GetParam, %${DynamicFieldData}, %Config, ID => $FieldID, Mode => 'Change', ObjectTypeName => $ObjectTypeName, FieldTypeName => $FieldTypeName, ); }
hu: sub _Change { my ( $Self, %Param ) = @_; my %GetParam; for my $Needed (qw(ObjectType FieldType)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$Needed ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Szükséges: $Needed", ); } } # az objektumtípus és a mezőtípus megjelenített nevének lekérése my $ObjectTypeName = $Self->{ObjectTypeConfig}->{ $GetParam{ObjectType} }->{DisplayName} || ''; my $FieldTypeName = $Self->{FieldTypeConfig}->{ $GetParam{FieldType} }->{DisplayName} || ''; my $FieldID = $Self->{ParamObject}->GetParam( Param => 'ID' ); if ( !$FieldID ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Azonosító szükséges", ); } # dinamikus mező adatainak lekérése my $DynamicFieldData = $Self->{DynamicFieldObject}->DynamicFieldGet( ID => $FieldID, ); # érvényes dinamikus mező beállítások ellenőrzése if ( !IsHashRefWithData($DynamicFieldData) ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Nem sikerült lekérni az adatokat a dinamikus mezőhöz: $FieldID", ); } my %Config = (); # beállítások kibontása if ( IsHashRefWithData( $DynamicFieldData->{Config} ) ) { %Config = %{ $DynamicFieldData->{Config} }; } return $Self->_ShowScreen( %Param, %GetParam, %${DynamicFieldData}, %Config, ID => $FieldID, Mode => 'Change', ObjectTypeName => $ObjectTypeName, FieldTypeName => $FieldTypeName, ); }

source: The <code>_Change</code> function is very similar to the <code>_Add</code> function but since this function is used to edit an existing field it needs to validated the <literal>FieldID</literal> parameter and gather the current Dynamic Field data.
hu: A <code>_Change</code> függvény nagyon hasonló az <code>_Add</code> függvényhez, de mivel ezt a függvényt egy meglévő mező szerkesztéséhez használják, ellenőriznie kell a <literal>FieldID</literal> paramétert, és be kell gyűjtenie a jelenlegi dinamikus mező adatait.

source: sub _ChangeAction { my ( $Self, %Param ) = @_; my %Errors; my %GetParam; for my $Needed (qw(Name Label FieldOrder)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$GetParam{$Needed} ) { $Errors{ $Needed . 'ServerError' } = 'ServerError'; $Errors{ $Needed . 'ServerErrorMessage' } = 'This field is required.'; } } my $FieldID = $Self->{ParamObject}->GetParam( Param => 'ID' ); if ( !$FieldID ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Need ID", ); } if ( $GetParam{Name} ) { # check if name is lowercase if ( $GetParam{Name} !~ m{\A ( ?: [a-zA-Z] | \d )+ \z}xms ) { # add server error error class $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'The field does not contain only ASCII letters and numbers.'; } # check if name is duplicated my %DynamicFieldsList = %{ $Self->{DynamicFieldObject}->DynamicFieldList( Valid => 0, ResultType => 'HASH', ) }; %DynamicFieldsList = reverse %DynamicFieldsList; if ( $DynamicFieldsList{ $GetParam{Name} } && $DynamicFieldsList{ $GetParam{Name} } ne $FieldID ) { # add server error class $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'There is another field with the same name.'; } } if ( $GetParam{FieldOrder} ) { # check if field order is numeric and positive if ( $GetParam{FieldOrder} !~ m{\A ( ?: \d )+ \z}xms ) { # add server error error class $Errors{FieldOrderServerError} = 'ServerError'; $Errors{FieldOrderServerErrorMessage} = 'The field must be numeric.'; } } for my $ConfigParam ( qw( ObjectType ObjectTypeName FieldType FieldTypeName DefaultValue ValidID ShowValue ValueMask ) ) { $GetParam{$ConfigParam} = $Self->{ParamObject}->GetParam( Param => $ConfigParam ); } # uncorrectable errors if ( !$GetParam{ValidID} ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Need ValidID", ); } # get dynamic field data my $DynamicFieldData = $Self->{DynamicFieldObject}->DynamicFieldGet( ID => $FieldID, ); # check for valid dynamic field configuration if ( !IsHashRefWithData($DynamicFieldData) ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Could not get data for dynamic field $FieldID", ); } # return to change screen if errors if (%Errors) { return $Self->_ShowScreen( %Param, %Errors, %GetParam, ID => $FieldID, Mode => 'Change', ); } # set specific config my $FieldConfig = { DefaultValue => $GetParam{DefaultValue}, ShowValue => $GetParam{ShowValue}, ValueMask => $GetParam{ValueMask}, }; # update dynamic field (FieldType and ObjectType cannot be changed; use old values) my $UpdateSuccess = $Self->{DynamicFieldObject}->DynamicFieldUpdate( ID => $FieldID, Name => $GetParam{Name}, Label => $GetParam{Label}, FieldOrder => $GetParam{FieldOrder}, FieldType => $DynamicFieldData->{FieldType}, ObjectType => $DynamicFieldData->{ObjectType}, Config => $FieldConfig, ValidID => $GetParam{ValidID}, UserID => $Self->{UserID}, ); if ( !$UpdateSuccess ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Could not update the field $GetParam{Name}", ); } return $Self->{LayoutObject}->Redirect( OP => "Action=AdminDynamicField", ); }
hu: sub _ChangeAction { my ( $Self, %Param ) = @_; my %Errors; my %GetParam; for my $Needed (qw(Name Label FieldOrder)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$GetParam{$Needed} ) { $Errors{ $Needed . 'ServerError' } = 'ServerError'; $Errors{ $Needed . 'ServerErrorMessage' } = 'Ez a mező kötelező.'; } } my $FieldID = $Self->{ParamObject}->GetParam( Param => 'ID' ); if ( !$FieldID ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Azonosító szükséges", ); } if ( $GetParam{Name} ) { # annak ellenőrzése, hogy a név kisbetűs-e if ( $GetParam{Name} !~ m{\A ( ?: [a-zA-Z] | \d )+ \z}xms ) { # kiszolgálóhiba hibaosztály hozzáadása $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'A mező nem csak ASCII betűket és számokat tartalmaz.'; } # annak ellenőrzése, hogy a név kettőzött-e my %DynamicFieldsList = %{ $Self->{DynamicFieldObject}->DynamicFieldList( Valid => 0, ResultType => 'HASH', ) }; %DynamicFieldsList = reverse %DynamicFieldsList; if ( $DynamicFieldsList{ $GetParam{Name} } && $DynamicFieldsList{ $GetParam{Name} } ne $FieldID ) { # kiszolgálóhiba hibaosztály hozzáadása $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'Már létezik egy másik ugyanilyen nevű mező.'; } } if ( $GetParam{FieldOrder} ) { # annak ellenőrzése, hogy a mezősorrend számszerű és pozitív-e if ( $GetParam{FieldOrder} !~ m{\A ( ?: \d )+ \z}xms ) { # add server error error class $Errors{FieldOrderServerError} = 'ServerError'; $Errors{FieldOrderServerErrorMessage} = 'A mezőnek számnak kell lennie.'; } } for my $ConfigParam ( qw( ObjectType ObjectTypeName FieldType FieldTypeName DefaultValue ValidID ShowValue ValueMask ) ) { $GetParam{$ConfigParam} = $Self->{ParamObject}->GetParam( Param => $ConfigParam ); } # kijavíthatatlan hibák if ( !$GetParam{ValidID} ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Szükséges: ValidID", ); } # a dinamikus mező adatainak lekérése my $DynamicFieldData = $Self->{DynamicFieldObject}->DynamicFieldGet( ID => $FieldID, ); # érvényes dinamikus mező beállítások ellenőrzése if ( !IsHashRefWithData($DynamicFieldData) ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Nem sikerült lekérni az adatokat a dinamikus mezőhöz: $FieldID", ); } # visszatérés a változtatás képernyőhöz, ha hibák vannak if (%Errors) { return $Self->_ShowScreen( %Param, %Errors, %GetParam, ID => $FieldID, Mode => 'Change', ); } # különleges beállítások elvégzése my $FieldConfig = { DefaultValue => $GetParam{DefaultValue}, ShowValue => $GetParam{ShowValue}, ValueMask => $GetParam{ValueMask}, }; # dinamikus mező frissítése (a FieldType és az ObjectType nem változtatható meg; régi értékek használata) my $UpdateSuccess = $Self->{DynamicFieldObject}->DynamicFieldUpdate( ID => $FieldID, Name => $GetParam{Name}, Label => $GetParam{Label}, FieldOrder => $GetParam{FieldOrder}, FieldType => $DynamicFieldData->{FieldType}, ObjectType => $DynamicFieldData->{ObjectType}, Config => $FieldConfig, ValidID => $GetParam{ValidID}, UserID => $Self->{UserID}, ); if ( !$UpdateSuccess ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Nem sikerült frissíteni a mezőt: $GetParam{Name}", ); } return $Self->{LayoutObject}->Redirect( OP => "Action=AdminDynamicField", ); }

source: <code>_ChangeAction()</code> is very similar to <code>_AddAction()</code>, but adapted for the update of an existing field instead of creating a new one.
hu: A <code>_ChangeAction()</code> nagyon hasonló az <code>_AddAction()</code> függvényhez, de át van írva egy meglévő mező frissítéséhez egy új létrehozása helyett.

source: sub _ShowScreen { my ( $Self, %Param ) = @_; $Param{DisplayFieldName} = 'New'; if ( $Param{Mode} eq 'Change' ) { $Param{ShowWarning} = 'ShowWarning'; $Param{DisplayFieldName} = $Param{Name}; } # header my $Output = $Self->{LayoutObject}->Header(); $Output .= $Self->{LayoutObject}->NavigationBar(); # get all fields my $DynamicFieldList = $Self->{DynamicFieldObject}->DynamicFieldListGet( Valid => 0, ); # get the list of order numbers (is already sorted). my @DynamicfieldOrderList; for my $Dynamicfield ( @{$DynamicFieldList} ) { push @DynamicfieldOrderList, $Dynamicfield->{FieldOrder}; } # when adding we need to create an extra order number for the new field if ( $Param{Mode} eq 'Add' ) { # get the last element from the order list and add 1 my $LastOrderNumber = $DynamicfieldOrderList[-1]; $LastOrderNumber++; # add this new order number to the end of the list push @DynamicfieldOrderList, $LastOrderNumber; } my $DynamicFieldOrderSrtg = $Self->{LayoutObject}->BuildSelection( Data => \@DynamicfieldOrderList, Name => 'FieldOrder', SelectedValue => $Param{FieldOrder} || 1, PossibleNone => 0, Class => 'W50pc Validate_Number', ); my %ValidList = $Self->{ValidObject}->ValidList(); # create the Validity select my $ValidityStrg = $Self->{LayoutObject}->BuildSelection( Data => \%ValidList, Name => 'ValidID', SelectedID => $Param{ValidID} || 1, PossibleNone => 0, Translation => 1, Class => 'W50pc', ); # define config field specific settings my $DefaultValue = ( defined $Param{DefaultValue} ? $Param{DefaultValue} : '' ); # create the Show value select my $ShowValueStrg = $Self->{LayoutObject}->BuildSelection( Data => [ 'No', 'Yes' ], Name => 'ShowValue', SelectedValue => $Param{ShowValue} || 'No', PossibleNone => 0, Translation => 1, Class => 'W50pc', ); # generate output $Output .= $Self->{LayoutObject}->Output( TemplateFile => 'AdminDynamicFieldPassword', Data => { %Param, ValidityStrg => $ValidityStrg, DynamicFieldOrderSrtg => $DynamicFieldOrderSrtg, DefaultValue => $DefaultValue, ShowValueStrg => $ShowValueStrg, ValueMask => $Param{ValueMask} || $Self->{DefaultValueMask}, }, ); $Output .= $Self->{LayoutObject}->Footer(); return $Output; } 1;
hu: sub _ShowScreen { my ( $Self, %Param ) = @_; $Param{DisplayFieldName} = 'New'; if ( $Param{Mode} eq 'Change' ) { $Param{ShowWarning} = 'ShowWarning'; $Param{DisplayFieldName} = $Param{Name}; } # fejléc my $Output = $Self->{LayoutObject}->Header(); $Output .= $Self->{LayoutObject}->NavigationBar(); # az összes mező lekérése my $DynamicFieldList = $Self->{DynamicFieldObject}->DynamicFieldListGet( Valid => 0, ); # a sorrendszámok listájának lekérése (már rendezve van). my @DynamicfieldOrderList; for my $Dynamicfield ( @{$DynamicFieldList} ) { push @DynamicfieldOrderList, $Dynamicfield->{FieldOrder}; } # hozzáadáskor létre kell hoznunk egy további sorrendszámot az új mezőhöz if ( $Param{Mode} eq 'Add' ) { # az utolsó elem lekérése a sorrendlistából, és 1 hozzáadása my $LastOrderNumber = $DynamicfieldOrderList[-1]; $LastOrderNumber++; # ezen új sorrendszám hozzáadása a lista végéhez push @DynamicfieldOrderList, $LastOrderNumber; } my $DynamicFieldOrderSrtg = $Self->{LayoutObject}->BuildSelection( Data => \@DynamicfieldOrderList, Name => 'FieldOrder', SelectedValue => $Param{FieldOrder} || 1, PossibleNone => 0, Class => 'W50pc Validate_Number', ); my %ValidList = $Self->{ValidObject}->ValidList(); # az ellenőrzés kiválasztás létrehozása my $ValidityStrg = $Self->{LayoutObject}->BuildSelection( Data => \%ValidList, Name => 'ValidID', SelectedID => $Param{ValidID} || 1, PossibleNone => 0, Translation => 1, Class => 'W50pc', ); # a beállítási mezőre jellemző beállítások meghatározása my $DefaultValue = ( defined $Param{DefaultValue} ? $Param{DefaultValue} : '' ); # az érték megjelenítése választás létrehozása my $ShowValueStrg = $Self->{LayoutObject}->BuildSelection( Data => [ 'No', 'Yes' ], Name => 'ShowValue', SelectedValue => $Param{ShowValue} || 'No', PossibleNone => 0, Translation => 1, Class => 'W50pc', ); # kimenet előállítása $Output .= $Self->{LayoutObject}->Output( TemplateFile => 'AdminDynamicFieldPassword', Data => { %Param, ValidityStrg => $ValidityStrg, DynamicFieldOrderSrtg => $DynamicFieldOrderSrtg, DefaultValue => $DefaultValue, ShowValueStrg => $ShowValueStrg, ValueMask => $Param{ValueMask} || $Self->{DefaultValueMask}, }, ); $Output .= $Self->{LayoutObject}->Footer(); return $Output; } 1;

source: The <code>_ShowScreen</code> function is used to set and define the HTML elements and blocks from a template to generate the Admin Dialog HTML code.
hu: A <code>_ShowScreen</code> függvényt használják egy sablonból történő HTML elemek és blokkok beállítására és meghatározására az adminisztrátori párbeszédablak HTML kódjának előállításához.

source: Dynamic Field Configuration File Example
hu: Dinamikus mező beállítófájl példa

source: The configuration files are used to register the Dynamic Field Types (Driver) and the Object Type Drivers for the <literal>BackendObject</literal>. They also store standard registrations for Admin Modules in the framework.
hu: A beállítófájlokat használják a dinamikus mező típusok (illesztőprogram) és az objektumtípus illesztőprogramok regisztrálásához a <literal>BackendObject</literal> számára. Ezek szabványos regisztrációkat is tárolnak az adminisztrátori modulokhoz a keretrendszerben.

source: In this section a configuration file for password Dynamic Field is shown and explained.
hu: Ebben a szakaszban a jelszó dinamikus mezőhöz egy beállítófájl van megjelenítve és elmagyarázva.

source: <ConfigItem Name="DynamicFields::Driver###Password" Required="0" Valid="1"> <Description Translatable="1">DynamicField backend registration.</Description> <Group>DynamicFieldPassword</Group> <SubGroup>DynamicFields::Backend::Registration</SubGroup> <Setting> <Hash> <Item Key="DisplayName" Translatable="1">Password</Item> <Item Key="Module">Kernel::System::DynamicField::Driver::Password</Item> <Item Key="ConfigDialog">AdminDynamicFieldPassword</Item> </Hash> </Setting> </ConfigItem>
hu: <ConfigItem Name="DynamicFields::Driver###Password" Required="0" Valid="1"> <Description Translatable="1">Dinamikus mező háttérprogram regisztráció.</Description> <Group>DynamicFieldPassword</Group> <SubGroup>DynamicFields::Backend::Registration</SubGroup> <Setting> <Hash> <Item Key="DisplayName" Translatable="1">Jelszó</Item> <Item Key="Module">Kernel::System::DynamicField::Driver::Password</Item> <Item Key="ConfigDialog">AdminDynamicFieldPassword</Item> </Hash> </Setting> </ConfigItem>

source: This setting registers the Password Dynamic Field Driver for the Backend module so it can be included in the list of available Dynamic Fields Types. It also specify its own Admin Dialog in the key <literal>ConfigDialog</literal>. This key is used by the Master Dynamic Field Admin Module to manage this new Dynamic Field Type.
hu: Ez a beállítás regisztrálja a jelszó dinamikus mező illesztőprogramot a háttérprogram modulhoz, így az felvehető az elérhető dinamikus mezők típusainak listájába. A saját adminisztrátori párbeszédablakát is meghatározza a <literal>ConfigDialog</literal> kulcsban. Ezt a kulcsot a fő dinamikus mező adminisztrátori modul használja ennek az új dinamikus mező típusának a kezeléséhez.

source: <ConfigItem Name="Frontend::Module###AdminDynamicFieldPassword" Required="0" Valid="1"> <Description Translatable="1">Frontend module registration for the agent interface.</Description> <Group>DynamicFieldPassword</Group> <SubGroup>Frontend::Admin::ModuleRegistration</SubGroup> <Setting> <FrontendModuleReg> <Group>admin</Group> <Description>Admin</Description> <Title Translatable="1">Dynamic Fields Text Backend GUI</Title> <Loader> <JavaScript>Core.Agent.Admin.DynamicField.js</JavaScript> </Loader> </FrontendModuleReg> </Setting> </ConfigItem>
hu: <ConfigItem Name="Frontend::Module###AdminDynamicFieldPassword" Required="0" Valid="1"> <Description Translatable="1">Előtétprogram-modul regisztráció az ügyintézői felülethez.</Description> <Group>DynamicFieldPassword</Group> <SubGroup>Frontend::Admin::ModuleRegistration</SubGroup> <Setting> <FrontendModuleReg> <Group>admin</Group> <Description>Admin</Description> <Title Translatable="1">Dinamikus mezők szöveg háttérprogram grafikus felület</Title> <Loader> <JavaScript>Core.Agent.Admin.DynamicField.js</JavaScript> </Loader> </FrontendModuleReg> </Setting> </ConfigItem>

source: This is a standard module registration for the Password Admin Dialog in the Admin Interface.
hu: Ez egy szabványos modulregisztráció a jelszó adminisztrátori párbeszédablakhoz az adminisztrátori felületen.

source: Dynamic Field Driver Example
hu: Dinamikus mező illesztőprogram példa

source: The driver <emphasis>is</emphasis> the Dynamic Field. It contains several functions that are used wide in the OTRS framework. A driver can inherit some functions form base classes, for example <literal>TextArea</literal> driver inherits most of the functions from <filename>Base.pm</filename> and <filename>BaseText.pm</filename> and it only implements the functions that requires different logic or results. Checkbox field driver only inherits from <filename>Base.pm</filename> as all other functions are very different from any other Base driver.
hu: Az illesztőprogram <emphasis>maga a</emphasis> dinamikus mező. Számos olyan függvényt tartalmaz, amelyet széles körben használnak az OTRS keretrendszerben. Egy illesztőprogram örökölhet néhány függvényt az alaposztályokból, például a <literal>TextArea</literal> illesztőprogram a <filename>Base.pm</filename> és a <filename>BaseText.pm</filename> fájlokból örökli a függvények legnagyobb részét, és csak azokat a függvényeket valósítja meg, amelyek eltérő logikát vagy eredményeket igényelnek. A jelölőnégyzet mező illesztőprogram csak a <filename>Base.pm</filename> fájlból örököl, mivel az összes többi függvény nagyon eltérő bármely más alap illesztőprogramtól.

source: Please refer to the Perl On-line Documentation (POD) of the module <filename>/Kernel/System/DynmicField/Backend.pm</filename> to have the list of all attributes and possible return data for each function.
hu: Nézze meg a <filename>/Kernel/System/DynmicField/Backend.pm</filename> modul Perl On-line Dokumentációját (POD) az összes attribútum listája és a lehetséges visszatérési adatok megismeréséhez az egyes függvényeknél.

source: In this section the Password Dynamic Field driver is shown and explained. This driver inherits some functions from <filename>Base.pm</filename> and <filename>BaseText.pm</filename> and only implements the functions that needs different results.
hu: Ebben a szakaszban a jelszó dinamikus mező illesztőprogram van bemutatva és elmagyarázva. Ez az illesztőprogram örököl néhány függvényt a <filename>Base.pm</filename> és a <filename>BaseText.pm</filename> fájlokból, és csak azokat a függvényeket valósítja meg, amelyek eltérő eredményeket igényelnek.
