Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # -- # Kernel/Output/HTML/DashboardTicketStatsGeneric.pm - message of the day # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Output::HTML::DashboardTicketStatsGeneric; use strict; use warnings; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {%Param}; bless( $Self, $Type ); # get needed objects for ( qw(Config Name ConfigObject LogObject DBObject LayoutObject ParamObject TicketObject UserID) ) { die "Got no $_!" if !$Self->{$_}; } return $Self; } sub Preferences { my ( $Self, %Param ) = @_; return; } sub Config { my ( $Self, %Param ) = @_; my $Key = $Self->{LayoutObject}->{UserLanguage} . '-' . $Self->{Name}; return ( %{ $Self->{Config} }, CacheKey => 'TicketStats' . '-' . $Self->{UserID} . '-' . $Key, ); } sub Run { my ( $Self, %Param ) = @_; my %Axis = ( '7Day' => { 0 => { Day => 'Sun', Created => 0, Closed => 0, }, 1 => { Day => 'Mon', Created => 0, Closed => 0, }, 2 => { Day => 'Tue', Created => 0, Closed => 0, }, 3 => { Day => 'Wed', Created => 0, Closed => 0, }, 4 => { Day => 'Thu', Created => 0, Closed => 0, }, 5 => { Day => 'Fri', Created => 0, Closed => 0, }, 6 => { Day => 'Sat', Created => 0, Closed => 0, }, }, ); my @Data; my $Max = 1; for my $Key ( 0 .. 6 ) { my $TimeNow = $Self->{TimeObject}->SystemTime(); if ($Key) { $TimeNow = $TimeNow - ( 60 * 60 * 24 * $Key ); } my ( $Sec, $Min, $Hour, $Day, $Month, $Year, $WeekDay ) = $Self->{TimeObject}->SystemTime2Date( SystemTime => $TimeNow, ); $Data[$Key]->{Day} = $Self->{LayoutObject}->{LanguageObject}->Get( $Axis{'7Day'}->{$WeekDay}->{Day} ); my $CountCreated = $Self->{TicketObject}->TicketSearch( # cache search result 20 min CacheTTL => 60 * 20, # tickets with create time after ... (ticket newer than this date) (optional) TicketCreateTimeNewerDate => "$Year-$Month-$Day 00:00:00", # tickets with created time before ... (ticket older than this date) (optional) TicketCreateTimeOlderDate => "$Year-$Month-$Day 23:59:59", CustomerID => $Param{Data}->{UserCustomerID}, Result => 'COUNT', # search with user permissions Permission => $Self->{Config}->{Permission} || 'ro', UserID => $Self->{UserID}, ); $Data[$Key]->{Created} = $CountCreated; if ( $CountCreated > $Max ) { $Max = $CountCreated; } my $CountClosed = $Self->{TicketObject}->TicketSearch( # cache search result 20 min CacheTTL => 60 * 20, # tickets with create time after ... (ticket newer than this date) (optional) TicketCloseTimeNewerDate => "$Year-$Month-$Day 00:00:00", # tickets with created time before ... (ticket older than this date) (optional) TicketCloseTimeOlderDate => "$Year-$Month-$Day 23:59:59", CustomerID => $Param{Data}->{UserCustomerID}, Result => 'COUNT', # search with user permissions Permission => $Self->{Config}->{Permission} || 'ro', UserID => $Self->{UserID}, ); $Data[$Key]->{Closed} = $CountClosed; if ( $CountClosed > $Max ) { $Max = $CountClosed; } } @Data = reverse @Data; my $Source = $Self->{LayoutObject}->JSONEncode( Data => \@Data, ); my $Content = $Self->{LayoutObject}->Output( TemplateFile => 'AgentDashboardTicketStats', Data => { %{ $Self->{Config} }, Key => int rand 99999, Max => $Max, Source => $Source, }, ); return $Content; } 1;
hu: # -- # Kernel/Output/HTML/DashboardTicketStatsGeneric.pm - napi üzenet # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Output::HTML::DashboardTicketStatsGeneric; use strict; use warnings; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {%Param}; bless( $Self, $Type ); # szükséges objektumok lekérése for ( qw(Config Name ConfigObject LogObject DBObject LayoutObject ParamObject TicketObject UserID) ) { die "Got no $_!" if !$Self->{$_}; } return $Self; } sub Preferences { my ( $Self, %Param ) = @_; return; } sub Config { my ( $Self, %Param ) = @_; my $Key = $Self->{LayoutObject}->{UserLanguage} . '-' . $Self->{Name}; return ( %{ $Self->{Config} }, CacheKey => 'TicketStats' . '-' . $Self->{UserID} . '-' . $Key, ); } sub Run { my ( $Self, %Param ) = @_; my %Axis = ( '7Day' => { 0 => { Day => 'Sun', Created => 0, Closed => 0, }, 1 => { Day => 'Mon', Created => 0, Closed => 0, }, 2 => { Day => 'Tue', Created => 0, Closed => 0, }, 3 => { Day => 'Wed', Created => 0, Closed => 0, }, 4 => { Day => 'Thu', Created => 0, Closed => 0, }, 5 => { Day => 'Fri', Created => 0, Closed => 0, }, 6 => { Day => 'Sat', Created => 0, Closed => 0, }, }, ); my @Data; my $Max = 1; for my $Key ( 0 .. 6 ) { my $TimeNow = $Self->{TimeObject}->SystemTime(); if ($Key) { $TimeNow = $TimeNow - ( 60 * 60 * 24 * $Key ); } my ( $Sec, $Min, $Hour, $Day, $Month, $Year, $WeekDay ) = $Self->{TimeObject}->SystemTime2Date( SystemTime => $TimeNow, ); $Data[$Key]->{Day} = $Self->{LayoutObject}->{LanguageObject}->Get( $Axis{'7Day'}->{$WeekDay}->{Day} ); my $CountCreated = $Self->{TicketObject}->TicketSearch( # keresési eredmények gyorsítótárazása 20 percre CacheTTL => 60 * 20, # jegyek ez utáni létrehozásai idővel ... (ennél a dátumnál újabb jegyek) (elhagyható) TicketCreateTimeNewerDate => "$Year-$Month-$Day 00:00:00", # jegyek ez előtti létrehozásai idővel ... (ennél a dátumnál régebbi jegyek) (elhagyható) TicketCreateTimeOlderDate => "$Year-$Month-$Day 23:59:59", CustomerID => $Param{Data}->{UserCustomerID}, Result => 'COUNT', # keresés felhasználói jogosultságokkal Permission => $Self->{Config}->{Permission} || 'ro', UserID => $Self->{UserID}, ); $Data[$Key]->{Created} = $CountCreated; if ( $CountCreated > $Max ) { $Max = $CountCreated; } my $CountClosed = $Self->{TicketObject}->TicketSearch( # keresési eredmények gyorsítótárazása 20 percre CacheTTL => 60 * 20, # jegyek ez utáni létrehozásai idővel ... (ennél a dátumnál újabb jegyek) (elhagyható) TicketCloseTimeNewerDate => "$Year-$Month-$Day 00:00:00", # jegyek ez előtti létrehozásai idővel ... (ennél a dátumnál régebbi jegyek) (elhagyható) TicketCloseTimeOlderDate => "$Year-$Month-$Day 23:59:59", CustomerID => $Param{Data}->{UserCustomerID}, Result => 'COUNT', # keresés felhasználói jogosultságokkal Permission => $Self->{Config}->{Permission} || 'ro', UserID => $Self->{UserID}, ); $Data[$Key]->{Closed} = $CountClosed; if ( $CountClosed > $Max ) { $Max = $CountClosed; } } @Data = reverse @Data; my $Source = $Self->{LayoutObject}->JSONEncode( Data => \@Data, ); my $Content = $Self->{LayoutObject}->Output( TemplateFile => 'AgentDashboardTicketStats', Data => { %{ $Self->{Config} }, Key => int rand 99999, Max => $Max, Source => $Source, }, ); return $Content; } 1;

source: To use this module add the following to the <filename>Kernel/Config.pm</filename> and restart your web server (if you use <literal>mod_perl</literal>).
hu: Ezen modul használatához adja hozzá a következőket a <filename>Kernel/Config.pm</filename> fájlhoz, és indítsa újra a webkiszolgálóját (ha a <literal>mod_perl</literal> modult használja).

source: <ConfigItem Name="DashboardBackend###0250-TicketStats" Required="0" Valid="1"> <Description Lang="en">Parameters for the dashboard backend. "Group" are used to restricted access to the plugin (e. g. Group: admin;group1;group2;). "Default" means if the plugin is enabled per default or if the user needs to enable it manually. "CacheTTL" means the cache time in minutes for the plugin.</Description> <Description Lang="de">Parameter für das Dashboard Backend. "Group" ist verwendet um den Zugriff auf das Plugin einzuschränken (z. B. Group: admin;group1;group2;). ""Default" bedeutet ob das Plugin per default aktiviert ist oder ob dies der Anwender manuell machen muss. "CacheTTL" ist die Cache-Zeit in Minuten nach der das Plugin erneut aufgerufen wird.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Agent::Dashboard</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::Output::HTML::DashboardTicketStatsGeneric</Item> <Item Key="Title">7 Day Stats</Item> <Item Key="Created">1</Item> <Item Key="Closed">1</Item> <Item Key="Permission">rw</Item> <Item Key="Block">ContentSmall</Item> <Item Key="Group"></Item> <Item Key="Default">1</Item> <Item Key="CacheTTL">45</Item> </Hash> </Setting> </ConfigItem>
hu: <ConfigItem Name="DashboardBackend###0250-TicketStats" Required="0" Valid="1"> <Description Lang="en">Parameters for the dashboard backend. "Group" are used to restricted access to the plugin (e. g. Group: admin;group1;group2;). "Default" means if the plugin is enabled per default or if the user needs to enable it manually. "CacheTTL" means the cache time in minutes for the plugin.</Description> <Description Lang="hu">Paraméterek a vezérlőpult háttérprogramhoz. A „Csoport” használható a hozzáférés korlátozásához a bővítményre (például Csoport: admin;csoport1;csoport2;). Az „Alapértelmezett” azt jelenti, hogy a bővítmény alapértelmezetten engedélyezve van, vagy hogy a felhasználónak kézzel kell engedélyeznie azt. A „CacheTTL” a bővítmény gyorsítótár lejárati időtartamát jelenti percben.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Agent::Dashboard</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::Output::HTML::DashboardTicketStatsGeneric</Item> <Item Key="Title">7 Day Stats</Item> <Item Key="Created">1</Item> <Item Key="Closed">1</Item> <Item Key="Permission">rw</Item> <Item Key="Block">ContentSmall</Item> <Item Key="Group"></Item> <Item Key="Default">1</Item> <Item Key="CacheTTL">45</Item> </Hash> </Setting> </ConfigItem>

source: An excessive number of days or individual lines may lead to performance degradation.
hu: A napok vagy az önálló sorok túlzott száma teljesítmény-csökkenéshez vezethet.

source: From version 2.4.0.
hu: A 2.4.0-ás verziótól.

source: Invoker
hu: Meghívó

source: The invoker is used to create a request from OTRS to a Remote System. This part of the GI is in charge of perform necessary tasks in OTRS side, to gather the necessary data in order to construct the request.
hu: A meghívót arra használják, hogy egy kérést hozzon létre az OTRS-ből egy távoli rendszerhez. Az általános ügyintéző ezen része felelős a szükséges feladatok végrehajtásáért az OTRS oldalán, illetve a szükséges adatok begyűjtéséért a kérés felépítésének érdekében.

source: Invoker backend
hu: Meghívó háttérprogram

source: Next we will show how to develop a new Invoker. Each invoker has to implement these subroutines:
hu: Ezután be fogjuk mutatni, hogy hogyan kell egy új meghívót kifejleszteni. Minden egyes meghívónak meg kell valósítania ezeket a szubrutinokat:

source: We should implement each one of this methods in order to be able to execute a request using the request handler (<filename>Kernel/GenericInterface/Requester.pm</filename>).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk végrehajtani egy kérést a kéréskezelő használatával (<filename>Kernel/GenericInterface/Requester.pm</filename>).

source: Code example
hu: Kódpélda

source: In this section a sample invoker module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta meghívómodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.

source: # -- # Kernel/GenericInterface/Invoker/Test.pm - GenericInterface test data Invoker backend # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Invoker::Test::Test; use strict; use warnings; use Kernel::System::VariableCheck qw(IsString IsStringWithData); # prevent 'Used once' warning for Kernel::OM use Kernel::System::ObjectManager; our $ObjectManagerDisabled = 1;
hu: # -- # Kernel/GenericInterface/Invoker/Test.pm - általános felület tesztadat meghívó háttérprogram # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Invoker::Test::Test; use strict; use warnings; use Kernel::System::VariableCheck qw(IsString IsStringWithData); # A „Used once” figyelmeztetés megakadályozása a Kernel::OM objektumnál use Kernel::System::ObjectManager; our $ObjectManagerDisabled = 1;

source: This is common header that can be found in common OTRS modules. The class/package name is declared via the <literal>package</literal> keyword. Invokers can not be instantiated by the Object Manager.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a <literal>package</literal> kulcsszón keresztül van deklarálva. A meghívók nem példányosíthatók az objektumkezelővel.

source: sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed params if ( !$Param{DebuggerObject} ) { return { Success => 0, ErrorMessage => "Got no DebuggerObject!" }; } $Self->{DebuggerObject} = $Param{DebuggerObject}; return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges paraméterek ellenőrzése if ( !$Param{DebuggerObject} ) { return { Success => 0, ErrorMessage => "Nem sikerült lekérni a hibakezelő objektumot!" }; } $Self->{DebuggerObject} = $Param{DebuggerObject}; return $Self; }

source: The constructor <literal>new</literal> creates a new instance of the class. According to the coding guidelines only objects of other classes not handled by the object manager that are needed in this module have to be created in <literal>new</literal>.
hu: A <literal>new</literal> konstruktor hozza létre az osztály új példányát. A kódolási irányelvek szerint az objektumkezelő által nem kezelt más osztályoknak csak azon objektumait kell a <literal>new</literal> konstruktorban létrehozni, amelyek ebben a modulban szükségesek.

source: sub PrepareRequest { my ( $Self, %Param ) = @_; # we need a TicketNumber if ( !IsStringWithData( $Param{Data}->{TicketNumber} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Got no TicketNumber' ); } my %ReturnData; $ReturnData{TicketNumber} = $Param{Data}->{TicketNumber}; # check Action if ( IsStringWithData( $Param{Data}->{Action} ) ) { $ReturnData{Action} = $Param{Data}->{Action} . 'Test'; } # check request for system time if ( IsStringWithData( $Param{Data}->{GetSystemTime} ) && $Param{Data}->{GetSystemTime} ) { $ReturnData{SystemTime} = $Kernel::OM->Get('Kernel::System::Time')->SystemTime(); } return { Success => 1, Data => \%ReturnData, }; }
hu: sub PrepareRequest { my ( $Self, %Param ) = @_; # szükségünk van egy jegyszámra if ( !IsStringWithData( $Param{Data}->{TicketNumber} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Nem kaptunk jegyszámot' ); } my %ReturnData; $ReturnData{TicketNumber} = $Param{Data}->{TicketNumber}; # a művelet ellenőrzése if ( IsStringWithData( $Param{Data}->{Action} ) ) { $ReturnData{Action} = $Param{Data}->{Action} . 'Test'; } # a rendszeridő kérésének ellenőrzése if ( IsStringWithData( $Param{Data}->{GetSystemTime} ) && $Param{Data}->{GetSystemTime} ) { $ReturnData{SystemTime} = $Kernel::OM->Get('Kernel::System::Time')->SystemTime(); } return { Success => 1, Data => \%ReturnData, }; }

source: The <literal>PrepareRequest</literal> function is used to handle and collect all needed data to be sent into the request. Here we can receive data from the request handler, use it, extend it, generate new data, and after that, we can transfer the results to the mapping layer.
hu: A <literal>PrepareRequest</literal> függvényt használják a kérésbe küldendő összes szükséges adat kezeléséhez és összegyűjtéséhez. Itt fogadhatunk adatokat a kéréskezelőtől, használhatjuk azokat, kiterjeszthetjük azokat, új adatokat állíthatunk elő, és ezután átvihetjük az eredményeket a leképező réteghez.

source: For this example we are expecting to receive a ticket number. If there isn't then we use the debugger method <code>Error()</code> that creates an entry in the debug log and also returns a structure with the parameter <literal>Success</literal> as 0 and an error message as the passed <literal>Summary</literal>.
hu: Ennél a példánál azt várjuk, hogy kapunk egy jegyszámot. Ha nem, akkor az <code>Error()</code> hibakeresési metódust használjuk, amely létrehoz egy bejegyzést a hibakeresési naplóban, és visszaad egy szerkezetet is a <literal>Success</literal> paraméterrel 0-ként, és egy hibaüzenetet az átadott <literal>Summary</literal> értékként.

source: Also this example appends the word "Test" to the parameter <literal>Action</literal> and if <literal>GetSystemTime</literal> is requested, it will fill the <literal>SystemTime</literal> parameter with the current system time. This part of the code is to prepare the data to be sent. On a real invoker some calls to core modules (<filename>Kernel/System/*.pm</filename>) should be made here.
hu: Ez a példa hozzáfűzi a „Test” szót is az <literal>Action</literal> paraméterhez, és ha a <literal>GetSystemTime</literal> kérve volt, akkor ki fogja tölteni a <literal>SystemTime</literal> paramétert az aktuális rendszeridővel. A kód ezen része azért van, hogy előkészítse az elküldendő adatokat. Egy valódi meghívónál itt kell elvégezni néhány hívást az alapmodulokhoz (<filename>Kernel/System/*.pm</filename>).

source: If during any part of the <literal>PrepareRequest</literal> function the request need to be stop without generating and error an entry in the debug log the following code can be used:
hu: Ha a kérést a <literal>PrepareRequest</literal> függvény bármely része közben le kell állítani a hibakeresési naplóba való bejegyzés előállítása és hibajelzése nélkül, akkor a következő kód használható:

source: # stop requester communication return { Success => 1, StopCommunication => 1, };
hu: # a kérelmező kommunikációjának leállítása return { Success => 1, StopCommunication => 1, };

source: Using this, the Requester will understand that the request should not continue (it will not be sent to Mapping layer and will also not be sent to the Network Transport). The Requester will not send an error on the debug log, it will only silently stop.
hu: Ennek használatával a kérelmező meg foga érteni, hogy a kérést nem szabad folytatni (nem kerül elküldésre a leképező réteghez, és nem kerül elküldésre a hálózati átvitelhez sem). A kérelmező nem fog hibát küldeni a hibakeresési naplóba, hanem csak csendben le fog állni.

source: sub HandleResponse { my ( $Self, %Param ) = @_; # if there was an error in the response, forward it if ( !$Param{ResponseSuccess} ) { if ( !IsStringWithData( $Param{ResponseErrorMessage} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Got response error, but no response error message!', ); } return { Success => 0, ErrorMessage => $Param{ResponseErrorMessage}, }; } # we need a TicketNumber if ( !IsStringWithData( $Param{Data}->{TicketNumber} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Got no TicketNumber!' ); } # prepare TicketNumber my %ReturnData = ( TicketNumber => $Param{Data}->{TicketNumber}, ); # check Action if ( IsStringWithData( $Param{Data}->{Action} ) ) { if ( $Param{Data}->{Action} !~ m{ \A ( .*? ) Test \z }xms ) { return $Self->{DebuggerObject}->Error( Summary => 'Got Action but it is not in required format!', ); } $ReturnData{Action} = $1; } return { Success => 1, Data => \%ReturnData, }; }
hu: sub HandleResponse { my ( $Self, %Param ) = @_; # ha hiba volt a válaszban, akkor továbbítja if ( !$Param{ResponseSuccess} ) { if ( !IsStringWithData( $Param{ResponseErrorMessage} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Hiba volt a válaszban, de nincs válasz hibaüzenet!', ); } return { Success => 0, ErrorMessage => $Param{ResponseErrorMessage}, }; } # szükségünk van egy jegyszámra if ( !IsStringWithData( $Param{Data}->{TicketNumber} ) ) { return $Self->{DebuggerObject}->Error( Summary => 'Nem kaptunk jegyszámot!' ); } # a jegyszám előkészítése my %ReturnData = ( TicketNumber => $Param{Data}->{TicketNumber}, ); # a művelet ellenőrzése if ( IsStringWithData( $Param{Data}->{Action} ) ) { if ( $Param{Data}->{Action} !~ m{ \A ( .*? ) Test \z }xms ) { return $Self->{DebuggerObject}->Error( Summary => 'Kaptunk műveletet, nem az nem megfelelő formátumú!', ); } $ReturnData{Action} = $1; } return { Success => 1, Data => \%ReturnData, }; }

source: The <literal>HandleResponse</literal> function is used to receive and process the data from the previous request, that was made to the Remote System. This data already passed by Mapping layer, to transform it from Remote System format to OTRS format (if needed).
hu: A <literal>HandleResponse</literal> függvényt használják az előző kérésből származó adatok fogadásához és feldolgozásához, amelyet a távoli rendszernek készítettek. Ezeket az adatokat már átadta a leképező réteg, hogy átalakítsa azokat a távoli rendszer formátumáról az OTRS formátumára (ha szükséges).

source: For this particular example it checks the ticket number again and check if the action ends with the word 'Test' (as was done in the <literal>PrepareRequest</literal> function).
hu: Ennél a bizonyos példánál ismét ellenőrzi a jegyszámot, és azt is ellenőrzi, hogy a művelet a „Test” szóval végződik-e (amint az a <literal>PrepareRequest</literal> függvényben történt).

source: This invoker is only used for tests, a real invoker will check if the response was on the format described by the Remote System and can perform some actions like: call another invoker, perform a call to a Core Module, update the database, send an error, etc.
hu: Ez a meghívó csak tesztelésekhez van, egy valódi meghívó ellenőrizni fogja, hogy a válasz a távoli rendszer által leírt formátumban volt-e, és végrehajthat néhány műveletet, mint például: egy másik meghívó meghívása, egy hívás végrehajtása egy alapmodulhoz, az adatbázis frissítése, hiba küldése, stb.

source: There is the need to register this invoker module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen meghívómodul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.

source: Mapping
hu: Leképezés

source: The mapping is used to convert data from OTRS to the external systems, and vice versa. This data can be represented as key =&gt; value pairs. Mapping modules can be developed to transform not just values but also the keys.
hu: A leképezést adatok átalakításához használják az OTRS és a távoli rendszer között, illetve fordítva. Ezek az adatok kulcs =&gt; érték párokként vannak ábrázolva. Leképező modulok fejleszthetők ki nem csak az értékek, hanem a kulcsok átalakításához is.

source: <emphasis>For example:</emphasis>
hu: <emphasis>Például:</emphasis>

source: From
hu: Erről

source: To
hu: Erre

source: The mapping layer is not absolutely necessary, a web service can skip it completely depending on the web service configuration and how invokers and operation are implemented. But if some data transformations are needed, is highly recommended to use an existing mapping module or create a new one.
hu: A leképező réteg nem feltétlenül szükséges, egy webszolgáltatás teljesen kihagyhatja azt a webszolgáltatás beállításaitól, valamint a meghívók és műveletek megvalósításának módjától függően. De ha egy kis átalakítás szükséges, akkor erősen ajánlott egy meglévő leképezőmodul használata, vagy egy új létrehozása.
