Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: New <literal>ArticleList()</literal> method is now provided by the article object, and can be used for article listing and locating. This method implements filters and article numbering and returns article meta data only as an ordered list. For example:
hu: Az új <literal>ArticleList()</literal> metódust mostantól a bejegyzés objektum biztosítja, és bejegyzések felsorolásához és kereséséhez használható. Ez a metódus szűrőket és bejegyzésszámozást valósít meg, valamint a bejegyzés metaadatait csak rendezett listaként adja vissza. Például:

source: my @Articles = $ArticleObject->ArticleList( TicketID => 123, CommunicationChannel => 'Email', # optional, to limit to a certain CommunicationChannel SenderType => 'customer', # optional, to limit to a certain article SenderType IsVisibleForCustomer => 1, # optional, to limit to a certain visibility OnlyFirst => 1, # optional, only return first match, or OnlyLast => 1, # optional, only return last match );
hu: my @Articles = $ArticleObject->ArticleList( TicketID => 123, CommunicationChannel => 'Email', # elhagyható, korlátozás egy bizonyos kommunikációs csatornára SenderType => 'customer', # elhagyható, korlátozás egy bizonyos bejegyzés küldőtípusra IsVisibleForCustomer => 1, # elhagyható, korlátozás egy bizonyos láthatóságra OnlyFirst => 1, # elhagyható, csak az első egyezést adja vissza, vagy OnlyLast => 1, # elhagyható, csak az utolsó egyezést adja vissza );

source: Following methods related to articles have been dropped all-together. If you are using any of them in your code, please evaluate possibility of alternatives.
hu: A következő, bejegyzésekre vonatkozó metódusok mindegyike el lett dobva. Ha ezek közül bármelyiket használja a kódjában, akkor értékelje ki az alternatívák lehetőségeit.

source: <literal>ArticleFirstArticle()</literal> (use <literal>ArticleList( OnlyFirst => 1)</literal> instead)
hu: <literal>ArticleFirstArticle()</literal> (használja az <literal>ArticleList( OnlyFirst => 1 )</literal> metódust helyette)

source: <literal>ArticleLastCustomerArticle()</literal> (use <literal>ArticleList( SenderType => 'customer', OnlyLast => 1)</literal> or similar)
hu: <literal>ArticleLastCustomerArticle()</literal> (használja az <literal>ArticleList( SenderType => 'customer', OnlyLast => 1 )</literal> metódust vagy hasonlót)

source: <literal>ArticleCount()</literal> (use <literal>ArticleList()</literal> instead)
hu: <literal>ArticleCount()</literal> (használja az <literal>ArticleList()</literal> metódust helyette)

source: <literal>ArticlePage()</literal> (reimplemented in <literal>AgentTicketZoom</literal>)
hu: <literal>ArticlePage()</literal> (újraírva az <literal>AgentTicketZoom</literal> modulban)

source: <literal>ArticleIndex()</literal> (use <literal>ArticleList()</literal> instead)
hu: <literal>ArticleIndex()</literal> (használja az <literal>ArticleList()</literal> metódust helyette)

source: To work with article data please use new article backend API. To get correct backend object for an article, please use:
hu: A bejegyzésadatokkal való munkához használja az új bejegyzés háttérprogram API-t. A bejegyzés megfelelő háttérprogram-objektumának lekéréséhez használja a következőt:

source: <literal>BackendForArticle()</literal> returns the correct back end for a given article, or the invalid back end, so that you can always expect a back end object instance that can be used for chain-calling.
hu: A <literal>BackendForArticle()</literal> visszaadja a megfelelő háttérprogramot egy adott bejegyzésnél vagy az érvénytelen háttérprogramot azért, hogy mindig számíthasson egy háttérprogram-objektum példányra, amelyet használhat sorozatos hívásoknál.

source: <literal>BackendForChannel()</literal> returns the correct back end for a given communication channel.
hu: A <literal>BackendForChannel()</literal> visszaadja a megfelelő háttérprogramot egy adott kommunikációs csatornánál.

source: Article Backend API
hu: Bejegyzés háttérprogram API

source: All other article data and related methods have been moved to separate backends. Every communication channel now has a dedicated backend API that handles article data and can be used to manipulate it.
hu: Az összes többi bejegyzésadat és a hozzájuk kapcsolódó metódus át lett helyezve külön háttérprogramokba. Minden egyes kommunikációs csatorna mostantól rendelkezik egy dedikált háttérprogram API-val, amely kezeli a bejegyzésadatokat és használható azok manipulálásához.

source: OTRS 6 Free ships with some default channels and corresponding backends:
hu: Az OTRS 6 Free néhány alapértelmezett csatornával és a megfelelő háttérprogramokkal érkezik:

source: Email (equivalent to old <literal>email</literal> article types)
hu: E-mail (egyenértékű a régi <literal>email</literal> bejegyzéstípusokkal)

source: Phone (equivalent to old <literal>phone</literal> article types)
hu: Telefon (egyenértékű a régi <literal>phone</literal> bejegyzéstípusokkal)

source: Internal (equivalent to old <literal>note</literal> article types)
hu: Belső (egyenértékű a régi <literal>note</literal> bejegyzéstípusokkal)

source: Chat (equivalent to old <literal>chat</literal> article types)
hu: Csevegés (egyenértékű a régi <literal>chat</literal> bejegyzéstípusokkal)

source: While chat article backend is available in OTRS 6 Free, it is only utilized when system has a valid <emphasis role="bold">OTRS Business Solution™</emphasis> installed.
hu: Miközben a csevegés bejegyzés háttérprogram elérhető az OTRS 6 Free verziójában, csak akkor használható, ha a rendszer érvényes <emphasis role="bold">OTRS Business Solution™</emphasis> telepítéssel rendelkezik.

source: Article data manipulation can be managed via following backend methods:
hu: A bejegyzés adatainak manipulálása a következő háttérprogram-metódusokon keresztül végezhető el:

source: All of these methods have dropped article type parameter, which must be substituted for <literal>SenderType</literal> and <literal>IsVisibleForCustomer</literal> parameter combination. In addition, all these methods now also require <literal>TicketID</literal> and <literal>UserID</literal> parameters.
hu: Ezen metódusok mindegyikéből el lett dobva a bejegyzéstípus paraméter, amelyet a <literal>SenderType</literal> és az <literal>IsVisibleForCustomer</literal> paraméterek kombinációjával kell helyettesíteni. Ezenkívül mostantól ezen metódusok mindegyike igényli a <literal>TicketID</literal> és a <literal>UserID</literal> paramétereket.

source: Since changes in article API are system-wide, any code using the old API must be ported for OTRS 6. This includes any web service definitions which leverage these methods directly via GenericInterface for example. They will need to be re-assessed and adapted to provide all required parameters to the new API during requests and manage subsequent responses in new format.
hu: Mivel a bejegyzés API-ban lévő változások rendszerszintűek, a régi API-t használó összes kódot át kell írni az OTRS 6-hoz. Ebbe beletartozik például az összes webszolgáltatás meghatározás, amely kihasználja ezeket a metódusokat közvetlenül az általános felületen keresztül. Ezeket újra meg kell vizsgálni és hozzá kell igazítani ahhoz, hogy az összes szükséges paramétert biztosítsák az új API-hoz a kérések közben, és kezeljék a rájuk adott válaszokat az új formátumban.

source: Please note that returning hash of <literal>ArticleGet()</literal> has changed, and some things (like ticket data) might be missing. Utilize parameters like <literal>DynamicFields => 1</literal> and <literal>RealNames => 1</literal> to get more information.
hu: Ne feledje, hogy az <literal>ArticleGet()</literal> visszatérési kivonata megváltozott, és néhány dolog (mint például a jegyadatok) hiányozhatnak. Használja a <literal>DynamicFields => 1</literal> és a <literal>RealNames => 1</literal> paramétereket, hogy további információ kapjon.

source: In addition, attachment data is not returned any more, please use combination of following methods from the article backends:
hu: Ezenkívül a melléklet adatai többé nem lesznek visszaadva, használja a következő metódusok kombinációját a bejegyzés háttérprogramokból:

source: Note that <literal>ArticleAttachmentIndex()</literal> parameters and behavior has changed. Instead of old strip parameter use combination of new <literal>ExcludePlainText</literal>, <literal>ExcludeHTMLBody</literal> and <literal>ExcludeInline</literal>.
hu: Ne feledje, hogy az <literal>ArticleAttachmentIndex()</literal> paraméterei és működése is megváltozott. A régi paraméterdarabok helyett használja az új <literal>ExcludePlainText</literal>, <literal>ExcludeHTMLBody</literal> és <literal>ExcludeInline</literal> kombinációját.

source: As an example, here is how to get all article and attachment data in the same hash:
hu: Példaként itt van, hogy az összes bejegyzés- és mellékletadatot hogyan lehet lekérni ugyanabban a kivonatban:

source: my @Articles = $ArticleObject->ArticleList( TicketID => $TicketID, ); ARTICLE: for my $Article (@Articles) { # Make sure to retrieve backend object for this specific article. my $ArticleBackendObject = $ArticleObject->BackendForArticle( %{$Article} ); my %ArticleData = $ArticleBackendObject->ArticleGet( %{$Article}, DynamicFields => 1, UserID => $UserID, ); $Article = \%ArticleData; # Get attachment index (without attachments). my %AtmIndex = $ArticleBackendObject->ArticleAttachmentIndex( ArticleID => $Article->{ArticleID}, UserID => $UserID, ); next ARTICLE if !%AtmIndex; my @Attachments; ATTACHMENT: for my $FileID ( sort keys %AtmIndex ) { my %Attachment = $ArticleBackendObject->ArticleAttachment( ArticleID => $Article->{ArticleID}, FileID => $FileID, UserID => $UserID, ); next ATTACHMENT if !%Attachment; $Attachment{FileID} = $FileID; $Attachment{Content} = encode_base64( $Attachment{Content} ); push @Attachments, \%Attachment; } # Include attachment data in article hash. $Article->{Atms} = \@Attachments; }
hu: my @Articles = $ArticleObject->ArticleList( TicketID => $TicketID, ); ARTICLE: for my $Article (@Articles) { # Győződjön meg arról, hogy lekérte-e a háttérprogram-objektumot ehhez a bizonyos bejegyzéshez. my $ArticleBackendObject = $ArticleObject->BackendForArticle( %{$Article} ); my %ArticleData = $ArticleBackendObject->ArticleGet( %{$Article}, DynamicFields => 1, UserID => $UserID, ); $Article = \%ArticleData; # Mellékletindex lekérése (mellékletek nélkül). my %AtmIndex = $ArticleBackendObject->ArticleAttachmentIndex( ArticleID => $Article->{ArticleID}, UserID => $UserID, ); next ARTICLE if !%AtmIndex; my @Attachments; ATTACHMENT: for my $FileID ( sort keys %AtmIndex ) { my %Attachment = $ArticleBackendObject->ArticleAttachment( ArticleID => $Article->{ArticleID}, FileID => $FileID, UserID => $UserID, ); next ATTACHMENT if !%Attachment; $Attachment{FileID} = $FileID; $Attachment{Content} = encode_base64( $Attachment{Content} ); push @Attachments, \%Attachment; } # Mellékletadatok felvétele a bejegyzés kivonatába. $Article->{Atms} = \@Attachments; }

source: Article Search Index
hu: Bejegyzéskeresési index

source: To make article indexing more generic, article backends now provide information necessary for properly indexing article data. Index will be created similar to old <literal>StaticDB</literal> mechanism and stored in a dedicated article search table.
hu: A bejegyzésindexelés általánosabbá tételéhez a bejegyzés háttérprogramok mostantól biztosítják a bejegyzésadatok megfelelő indexeléséhez szükséges információkat. Az index hasonlóan lesz létrehozva a régi <literal>StaticDB</literal> mechanizmushoz, és egy dedikált bejegyzéskeresési táblában lesznek eltárolva.

source: Since now every article backend can provide search on arbitrary number of article fields, use <literal>BackendSearchableFieldsGet()</literal> method to get information about them. This data can also be used for forming requests to <literal>TicketSearch()</literal> method. Coincidentally, some <literal>TicketSearch()</literal> parameters have changed their name to also include article backend information, for example:
hu: Mivel mostantól minden egyes bejegyzés háttérprogram képes keresést biztosítani a bejegyzés mezőinek tetszőleges számán, használja a <literal>BackendSearchableFieldsGet()</literal> metódust a velük kapcsolatos információk lekéréséhez. Ezek az adatok használhatók a kérések formázásánál is a <literal>TicketSearch()</literal> metódushoz. Véletlenül néhány <literal>TicketSearch()</literal> paraméter megváltoztatta a nevét, hogy tartalmazza a bejegyzés háttérprogram információit is, például:

source: Old parameter
hu: Régi paraméter

source: New parameter
hu: Új paraméter

source: Additionally, article search indexing will be done in an async call now, in order to off-load index calculation to a separate task. While this is fine for production systems, it might create new problems in certain situations, e.g. unit tests. If you are manually creating articles in your unit test, but expect it to be searchable immediately after created, make sure to manually call the new <literal>ArticleSearchIndexBuild()</literal> method on article object.
hu: Ezenkívül a bejegyzéskeresési indexelés mostantól aszinkron hívásban lesz végrehajtva annak érdekében, hogy kitegye az index kiszámítását egy különálló feladatba. Míg ez rendben van a produktív rendszereknél, aközben új problémákat hozhat létre bizonyos helyzetekben, például egységteszteknél. Ha kézzel hozza létre a bejegyzéseket az egységtesztben, és arra számít, hogy azonnal kereshető lesz a létrehozás után, akkor győződjön meg arról, hogy meghívta-e kézzel az új <literal>ArticleSearchIndexBuild()</literal> metódust a bejegyzésobjektumon.

source: SysConfig API changes
hu: Rendszerbeállítás API változások

source: Note that in OTRS 6 SysConfig API was changed, so you should check if the methods are still existing. For example, <literal>ConfigItemUpdate()</literal> is removed. To replace it you should use combination of the following methods:
hu: Ne feledje, hogy az OTRS 6-ban a rendszerbeállítások API megváltozott, ezért ellenőriznie kell, hogy a metódusok léteznek-e még. Például a <literal>ConfigItemUpdate()</literal> el lett távolítva. A helyettesítéshez a következő metódusok kombinációját kell használnia:

source: In case that you want to update a configuration setting during a <literal>CodeInstall</literal> section of a package, you could use <literal>SettingsSet()</literal>. It does all previously mentioned steps and it can be used for multiple settings at once.
hu: Abban az esetben, ha frissíteni szeretne egy konfigurációs beállítást egy csomag <literal>CodeInstall</literal> szakasza közben, akkor használhatja a <literal>SettingsSet()</literal> metódust. Ez elvégzi a korábban említett összes lépést, és használható egyszerre több beállításnál is.

source: Do not use <literal>SettingSet()</literal> in the SysConfig GUI itself.
hu: Ne használja a <literal>SettingSet()</literal> metódust magán a rendszerbeállítás grafikus felhasználói felületén.

source: my $Success = $SysConfigObject->SettingsSet( UserID => 1, # (required) UserID Comments => 'Deployment comment', # (optional) Comment Settings => [ # (required) List of settings to update. { Name => 'Setting::Name', # (required) EffectiveValue => 'Value', # (optional) IsValid => 1, # (optional) UserModificationActive => 1, # (optional) }, ... ], );
hu: my $Success = $SysConfigObject->SettingsSet( UserID => 1, # (kötelező) Felhasználó-azonosító. Comments => 'Üzembe állítási megjegyzés.', # (elhagyható) Megjegyzés. Settings => [ # (kötelező) Frissítendő beállítások listája. { Name => 'Setting::Name', # (kötelező) EffectiveValue => 'Value', # (elhagyható) IsValid => 1, # (elhagyható) UserModificationActive => 1, # (elhagyható) }, ... ], );

source: <literal>LinkObject</literal> API changes
hu: <literal>LinkObject</literal> API változások

source: Note that <literal>LinkObject</literal> was slightly modified in the OTRS 6 and methods <literal>LinkList()</literal> and <literal>LinkKeyList()</literal> might return different result if <literal>Direction</literal> parameter is used. Consider changing <literal>Direction</literal>.
hu: Ne feledje, hogy a <literal>LinkObject</literal> kissé módosult az OTRS 6-ban, valamint a <literal>LinkList()</literal> és a <literal>LinkKeyList()</literal> metódusok különböző eredményt adhatnak vissza, ha a <literal>Direction</literal> paramétert használják. Fontolja meg a <literal>Direction</literal> paraméter megváltoztatását.

source: Old code:
hu: Régi kód:

source: New code:
hu: Új kód:

source: Communication Log support for additional PostMaster Filters
hu: Kommunikációs napló támogatás a további levelezési szűrőkhöz

source: As part of email handling improvements for OTRS 6, a new logging mechanism was added to OTRS 6, exclusively used for incoming and outgoing communications. All PostMaster filters were enriched with this new <link linkend="log-mechanism-communication-log">Communication Log</link> API, which means any additional filters coming with packages should also leverage the new log feature.
hu: Az OTRS 6 e-mail kezelési továbbfejlesztésének részeként egy új naplózó mechanizmus lett hozzáadva az OTRS 6-hoz, kifejezetten a bejövő és kimenő kommunikációk használatához. Az összes levelezési szűrő fel lett javítva ezzel az új <link linkend="log-mechanism-communication-log">kommunikációs napló</link> API-val, amely azt jelenti, hogy a csomagokkal érkező bármely további szűrő is kihasználhatja az új naplózási funkciót.

source: If your package implements additional PostMaster filters, make sure to get acquainted with <link linkend="log-mechanism-communication-log">API usage instructions</link>. Also, you can get an example of how to implement this logging mechanism by looking the code in the <literal>Kernel::System::PostMaster::NewTicket</literal>.
hu: Ha a csomagja további levelezési szűrőket valósít meg, akkor győződjön meg arról, hogy megismerje az <link linkend="log-mechanism-communication-log">API használati utasításokat</link>. Kap egy példát is azzal kapcsolatban, hogy ezt a naplózási mechanizmust hogyan kell megvalósítani, ha belenéz a <literal>Kernel::System::PostMaster::NewTicket</literal> kódjába.

source: Process MailQueue for unit tests
hu: Levelezési sor feldolgozása az egységtesztekhez

source: As part of email handling improvements for OTRS 6, all emails are now sent asynchronously, that means they are saved in a queue for future processing.
hu: Az OTRS 6 e-mail kezelési továbbfejlesztésének részeként az összes e-mail mostantól aszinkron módon lesz elküldve, amely azt jelenti, hogy egy várakozási sorba lesznek elmentve a későbbi feldolgozáshoz.

source: To the unit tests that depend on emails continue to work properly is necessary to force the processing of the email queue.
hu: Ahhoz, hogy az e-mailektől függő egységtesztek továbbra is megfelelően működjenek, az e-mail várakozási sor feldolgozásának kényszerítése szükséges.

source: Make sure to start with a clean queue:
hu: Győződjön meg arról, hogy egy tiszta várakozási sorral indul:

source: If for some reason you can't clean completely the queue, e.g. selenium unit tests, just delete the items created during the tests:
hu: Ha néhány esetben nem tudja teljesen kitakarítani a várakozási sort (például Selenium egységteszteknél), akkor egyszerűen törölje azokat az elemeket, amelyek a tesztek során jöttek létre:

source: Process the queue after the code that you expect to send emails:
hu: Dolgozza fel a várakozási sort azután a kód után, amely várhatóan elküldi az e-maileket:

source: Or process only the ones created during the tests:
hu: Vagy csak azokat dolgozza fel, amelyek a tesztek során jöttek létre:

source: Depending on your case, you may need to clean the queue after or before processing it.
hu: Az esettől függően esetleg ki kell takarítania a várakozási sort a feldolgozása után vagy előtt.

source: Widget Handling in Ticket Zoom Screen
hu: Felületi elem kezelés a jegynagyítás képernyőn

source: The widgets in the ticket zoom screen have been improved to work in a more generic way. With OTRS 6, it is now possible to add new widgets for the ticket zoom screen via the SysConfig. It is possible to configure the used module, the location of the widget (e.g. Sidebar) and if the content should be loaded synchronously (default) or via AJAX.
hu: A jegynagyítás képernyőn lévő felületi elemek továbbfejlesztésre kerültek, hogy általánosabb módon működjenek. Az OTRS 6-tal mostantól lehetőség van új felületi elemek hozzáadására a jegynagyítás képernyőhöz a rendszerbeállításokon keresztül. Lehetőség van beállítani a használt modult, a felületi elem helyzetét (például oldalsáv) és hogy a tartalmat szinkron módon (alapértelmezett) vagy AJAX kérésen keresztül kell betölteni.

source: Here is an example configuration for the default widgets:
hu: Itt egy beállítási példa az alapértelmezett felületi elemekhez:

source: With this change, the template blocks in the widget code have been removed, so you should check if you use the old widget blocks in some output filters via <literal>Frontend::Template::GenerateBlockHooks</literal> functionality, and implement it in the new fashion.
hu: Ezzel a változtatással a felületi elem kódjában lévő sablonblokkok eltávolításra kerültek, ezért ellenőriznie kell, ha a régi felületi elem blokkokat használja néhány kimeneti szűrőben a <literal>Frontend::Template::GenerateBlockHooks</literal> funkcionalitáson keresztül, és meg kell valósítania az új módszer szerint.
