Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: To translate content, you can run <code>$LayoutObject->Translate()</code> directly. If you need other template features, just define a small template file for your output filter and use it to render your content before injecting it into the main data. It can also be helpful to use jQuery DOM operations to reorder/replace content on the screen in some cases instead of using regular expressions. In this case you would inject the new code somewhere in the page as invisible content (e. g. with the class <literal>Hidden</literal>), and then move it with jQuery to the correct location in the DOM and show it.
hu: A tartalom lefordításához futtathatja közvetlenül a <code>$LayoutObject->Translate()</code> függvényt. Ha egyéb sablonszolgáltatásokra van szüksége, akkor egyszerűen határozzon meg egy kis sablonfájlt a kimenetszűrőhöz, és használja azt a tartalom megjelenítéséhez, mielőtt beültetné azt a fő adatokba. Néhány esetben hasznos lehet a jQuery DOM műveletek használata is a képernyőn lévő tartalom sorrendjének megváltoztatásához vagy cseréjéhez a reguláris kifejezések használata helyett. Ebben az esetben láthatatlan tartalomként kellene beültetnie az új kódot valahova az oldalba (például a <literal>Hidden</literal> osztállyal), majd ezután áthelyezni a jQuery használatával a megfelelő helyre a DOM-ban, és megjeleníteni azt.

source: To make using post output filters easier, there is also a mechanism to request HTML comment hooks for certain templates/blocks. You can add in your module config XML like:
hu: Az utó-kimenetszűrők használatának megkönnyítéséhez létezik egy mechanizmus is a HTML megjegyzéshorgok lekéréséhez bizonyos sablonoknál vagy blokkoknál. Hozzáadhatja a modulbeállító XML-be a következőhöz hasonlóan:

source: This will cause the block <literal>CustomerTable</literal> in <filename>AgentTicketZoom.tt</filename> to be wrapped in HTML comments each time it is rendered:
hu: Ez azt fogja okozni, hogy az <filename>AgentTicketZoom.tt</filename> fájlban lévő <literal>CustomerTable</literal> blokk át lesz alakítva a HTML megjegyzésekben minden alkalommal, amikor megjelenítésre kerül:

source: <!--HookStartCustomerTable--> ... block output ... <!--HookEndCustomerTable-->
hu: <!--HookStartCustomerTable--> ... blokk kimenet ... <!--HookEndCustomerTable-->

source: With this mechanism every package can request just the block hooks it needs, and they are consistently rendered. These HTML comments can then be used in your output filter for easy regular expression matching.
hu: Ezzel a mechanizmussal minden csomag csak azokat a blokkhorgokat kérheti, amelyekre szüksége van, és következetesen kerülnek megjelenítésre. Ezek a HTML megjegyzések használhatók ezután a kimenetszűrőben az egyszerű reguláris kifejezés illesztéshez.

source: This kind of filter allows to process the complete HTML output for the request right before it is sent to the browser. This can be used for global transformations.
hu: Ez a fajta szűrő lehetővé teszi a teljes HTML kimenet feldolgozását a kérésnél közvetlenül azelőtt, hogy kiküldésre kerül a böngészőnek. Ez globális átalakításokhoz használható.

source: This kind of output filter is a plugin for the method <literal>Kernel::Output::HTML::Layout::Ascii2HTML()</literal> and is only active when the parameter <literal>LinkFeature</literal> is set to 1. Thus the <literal>FilterText</literal> output filters are currently only active for the display of the body of plain text articles. Plain text articles are generated by incoming non-HTML mails and when OTRS is configured to not use the Rich Text feature in the frontend.
hu: Ez a fajta kimenetszűrő egy bővítmény a <literal>Kernel::Output::HTML::Layout::Ascii2HTML()</literal> metódushoz, és csak akkor aktív, amikor a <literal>LinkFeature</literal> paraméter 1-re van állítva. Így a <literal>FilterText</literal> kimenetszűrők jelenleg csak az egyszerű szöveges bejegyzések törzsének megjelenítésénél aktívak. Az egyszerű szöveges bejegyzéseket a bejövő nem HTML levelek állítják elő, illetve amikor az OTRS úgy van beállítva, hogy ne használja a Rich Text szolgáltatást az előtétprogramon.

source: See package <literal>TemplateModule</literal>.
hu: Lásd a <literal>TemplateModule</literal> csomagot.

source: Use Cases
hu: Használati esetek

source: Show additional ticket attributes in <literal>AgentTicketZoom</literal>
hu: További jegyattribútumok megjelenítése az <literal>AgentTicketZoom</literal> képernyőn

source: This can be achieved with a <literal>FilterElementPost</literal> output filter.
hu: Ez egy <literal>FilterElementPost</literal> kimenetszűrővel valósítható meg.

source: Show the service selection as a multi level menu
hu: A szolgáltatásválasztás megjelenítése többszintű menüként

source: Use a <literal>FilterElementPost</literal> for this feature. The list of selectable services can be parsed from the processed template output. The multi level selection can be constructed from the service list and inserted into the template content. A <literal>FilterElementPost</literal> output filter must be used for that.
hu: Használjon egy <literal>FilterElementPost</literal> szűrőt ehhez a szolgáltatáshoz. A választható szolgáltatások listája a feldolgozott sablonkimenetből dolgozható fel. A többszintű választás a szolgáltatáslistából építhető fel, és szúrható be a sablontartalomba. Egy <literal>FilterElementPost</literal> kimenetszűrőt kell használni ehhez.

source: Create links within plain text article bodies
hu: Hivatkozások létrehozása az egyszerű szöveges bejegyzés törzseiben

source: A biotech company uses gene names like IPI00217472 in plain text articles. A <literal>FilterText</literal> output filter can be used to create links to a sequence database, e.g. http://srs.ebi.ac.uk/srsbin/cgi-bin/wgetz?-e+[IPI-acc:IPI00217472]+-vn+2, for the gene names.
hu: Egy biotechnológiai vállalat IPI00217472 formátumú génneveket használ az egyszerű szöveges bejegyzésekben. Egy <literal>FilterText</literal> kimenetszűrő használható a szekvencia-adatbázisra mutató hivatkozások létrehozásához a génneveknél, például http://srs.ebi.ac.uk/srsbin/cgi-bin/wgetz?-e+[IPI-acc:IPI00217472]+-vn+2 formában.

source: Prohibit active content
hu: Az aktív tartalom megtiltása

source: There is firewall rule that disallows all active content. In order to avoid rejection by the firewall, the HTML tag <literal>&lt;applet&gt;</literal> can be filtered with a <literal>FilterContent</literal> output filter.
hu: Van egy olyan tűzfalszabály, amely megtiltja az összes aktív tartalmat. Azért, hogy elkerüljük a tűzfal visszautasítását, az <literal>&lt;applet&gt;</literal> HTML-címke kiszűrhető egy <literal>FilterContent</literal> kimenetszűrővel.

source: Every <literal>FilterElementPost</literal> output filter is constructed and run for every configured Template that is needed for the current request. Thus low performance of the output filter or a large number of filters can severely degrade performance.
hu: Minden <literal>FilterElementPost</literal> kimenetszűrő felépítésre és futtatásra kerül minden olyan beállított sablonnál, amely szükséges az aktuális kéréshez. Így a kimenetszűrő alacsony teljesítménye vagy a szűrők nagy száma komolyan csökkentheti a teljesítményt.

source: Best Practices
hu: Bevált gyakorlatok

source: In order to increase flexibility the list of affected templates should be configured in SysConfig.
hu: A rugalmasság növelésének érdekében az érintett sablonok listáját be kell állítani a rendszerbeállításokban.

source: The output filters are available since OTRS 2.4. The type <literal>FilterElementPre</literal> was dropped with OTRS 5.
hu: A kimenetszűrők az OTRS 2.4-es verziójától érhetők el. A <literal>FilterElementPre</literal> típus eldobásra került az OTRS 5-tel.

source: Queue Preferences Module
hu: Várólista beállítások modul

source: There is a DB queue preferences module which come with the OTRS framework. It is also possible to develop your own queue preferences modules. The queue preferences modules are located under <filename>Kernel/System/Queue/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of a queue preferences module. Save it under <filename>Kernel/System/Queue/PreferencesCustom.pm</filename>. You just need 3 functions: <code>new()</code>, <code>QueuePreferencesSet()</code> and <code>QueuePreferencesGet()</code>. Return 1, then the synchronization is ok.
hu: Létezik egy DB várólista beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját várólista beállítási modulok fejlesztésére is. A várólista beállítási modulok a <filename>Kernel/System/Queue/*.pm</filename> alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy várólista beállítások modul példája található. Mentse el a <filename>Kernel/System/Queue/PreferencesCustom.pm</filename> helyre. Mindössze három függvényre van szüksége: <code>new()</code>, <code>QueuePreferencesSet()</code> és <code>QueuePreferencesGet()</code>. Adjon vissza 1-et, és ezután a szinkronizáció rendben van.

source: The interface class is called <literal>Kernel::System::Queue</literal>. The example queue preferences may be called <literal>Kernel::System::Queue::PreferencesCustom</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::Queue</literal>. A példa várólista beállítások hívhatók <literal>Kernel::System::Queue::PreferencesCustom</literal> néven. Lent találhat egy példát.

source: # -- # Kernel/System/Queue/PreferencesCustom.pm - some user functions # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: PreferencesCustom.pm,v 1.5 2009/02/16 11:47:34 tr Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Queue::PreferencesCustom; use strict; use warnings; use vars qw(@ISA $VERSION); sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for (qw(DBObject ConfigObject LogObject)) { $Self->{$_} = $Param{$_} || die "Got no $_!"; } # preferences table data $Self->{PreferencesTable} = 'queue_preferences'; $Self->{PreferencesTableKey} = 'preferences_key'; $Self->{PreferencesTableValue} = 'preferences_value'; $Self->{PreferencesTableQueueID} = 'queue_id'; return $Self; } sub QueuePreferencesSet { my ( $Self, %Param ) = @_; # check needed stuff for (qw(QueueID Key Value)) { if ( !defined( $Param{$_} ) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } # delete old data return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . "$Self->{PreferencesTableQueueID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$Param{QueueID}, \$Param{Key} ], ); $Self->{PreferencesTableValue} .= 'PreferencesCustom'; # insert new data return $Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableQueueID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$Param{QueueID}, \$Param{Key}, \$Param{Value} ], ); } sub QueuePreferencesGet { my ( $Self, %Param ) = @_; # check needed stuff for (qw(QueueID)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } # check if queue preferences are available if ( !$Self->{ConfigObject}->Get('QueuePreferences') ) { return; } # get preferences return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableQueueID} = ?", Bind => [ \$Param{QueueID} ], ); my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # return data return %Data; } 1;
hu: # -- # Kernel/System/Queue/PreferencesCustom.pm - néhány felhasználói függvény # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: PreferencesCustom.pm,v 1.5 2009/02/16 11:47:34 tr Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Queue::PreferencesCustom; use strict; use warnings; use vars qw(@ISA $VERSION); sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for (qw(DBObject ConfigObject LogObject)) { $Self->{$_} = $Param{$_} || die "Nincs $_!"; } # beállítások tábla adatai $Self->{PreferencesTable} = 'queue_preferences'; $Self->{PreferencesTableKey} = 'preferences_key'; $Self->{PreferencesTableValue} = 'preferences_value'; $Self->{PreferencesTableQueueID} = 'queue_id'; return $Self; } sub QueuePreferencesSet { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for (qw(QueueID Key Value)) { if ( !defined( $Param{$_} ) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $_!" ); return; } } # régi adatok törlése return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . "$Self->{PreferencesTableQueueID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$Param{QueueID}, \$Param{Key} ], ); $Self->{PreferencesTableValue} .= 'PreferencesCustom'; # új adatok beszúrása return $Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableQueueID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$Param{QueueID}, \$Param{Key}, \$Param{Value} ], ); } sub QueuePreferencesGet { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for (qw(QueueID)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $_!" ); return; } } # annak ellenőrzése, hogy a várólista beállítások elérhetők-e if ( !$Self->{ConfigObject}->Get('QueuePreferences') ) { return; } # beállítások lekérése return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableQueueID} = ?", Bind => [ \$Param{QueueID} ], ); my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # adatok visszaadása return %Data; } 1;

source: There is the need to activate your custom queue preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni várólista beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.

source: <ConfigItem Name="Queue::PreferencesModule" Required="1" Valid="1"> <Description Lang="en">Default queue preferences module.</Description> <Description Lang="de">Standard Queue Preferences Module.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Queue::Preferences</SubGroup> <Setting> <String Regex="">Kernel::System::Queue::PreferencesCustom</String> </Setting> </ConfigItem>
hu: <ConfigItem Name="Queue::PreferencesModule" Required="1" Valid="1"> <Description Lang="en">Default queue preferences module.</Description> <Description Lang="hu">Alapértelmezett várólista beállítások modul.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Queue::Preferences</SubGroup> <Setting> <String Regex="">Kernel::System::Queue::PreferencesCustom</String> </Setting> </ConfigItem>

source: Useful preferences implementation could be a SOAP or RADIUS backend.
hu: Hasznos beállítások megvalósítás lehet egy SOAP vagy egy RADIUS háttérprogram.

source: Service Preferences Module
hu: Szolgáltatás beállítások modul

source: There is a DB service preferences module which come with the OTRS framework. It is also possible to develop your own service preferences modules. The service preferences modules are located under <filename>Kernel/System/Service/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of a service preferences module. Save it under <filename>Kernel/System/Service/PreferencesCustom.pm</filename>. You just need 3 functions: <code>new()</code>, <code>ServicePreferencesSet()</code> and <code>ServicePreferencesGet()</code>. Return 1, then the synchronization is ok.
hu: Létezik egy DB szolgáltatás beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját szolgáltatás beállítási modulok fejlesztésére is. A szolgáltatás beállítási modulok a <filename>Kernel/System/Service/*.pm</filename> alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy szolgáltatás beállítások modul példája található. Mentse el a <filename>Kernel/System/Service/PreferencesCustom.pm</filename> helyre. Mindössze három függvényre van szüksége: <code>new()</code>, <code>ServicePreferencesSet()</code> és <code>ServicePreferencesGet()</code>. Adjon vissza 1-et, és ezután a szinkronizáció rendben van.

source: The interface class is called <literal>Kernel::System::Service</literal>. The example service preferences may be called <literal>Kernel::System::Service::PreferencesCustom</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::Service</literal>. A példa szolgáltatás beállítások hívhatók <literal>Kernel::System::Service::PreferencesCustom</literal> néven. Lent találhat egy példát.

source: # -- # Kernel/System/Service/PreferencesCustom - some user functions # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: PreferencesCustom.pm,v 1.2 2009/02/16 11:47:34 tr Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Service::PreferencesCustom; use strict; use warnings; use vars qw(@ISA $VERSION); sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for (qw(DBObject ConfigObject LogObject)) { $Self->{$_} = $Param{$_} || die "Got no $_!"; } # preferences table data $Self->{PreferencesTable} = 'service_preferences'; $Self->{PreferencesTableKey} = 'preferences_key'; $Self->{PreferencesTableValue} = 'preferences_value'; $Self->{PreferencesTableServiceID} = 'service_id'; return $Self; } sub ServicePreferencesSet { my ( $Self, %Param ) = @_; # check needed stuff for (qw(ServiceID Key Value)) { if ( !defined( $Param{$_} ) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } # delete old data return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . "$Self->{PreferencesTableServiceID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$Param{ServiceID}, \$Param{Key} ], ); $Self->{PreferencesTableValue} .= 'PreferencesCustom'; # insert new data return $Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableServiceID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$Param{ServiceID}, \$Param{Key}, \$Param{Value} ], ); } sub ServicePreferencesGet { my ( $Self, %Param ) = @_; # check needed stuff for (qw(ServiceID)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } # check if service preferences are available if ( !$Self->{ConfigObject}->Get('ServicePreferences') ) { return; } # get preferences return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableServiceID} = ?", Bind => [ \$Param{ServiceID} ], ); my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # return data return %Data; } 1;
hu: # -- # Kernel/System/Service/PreferencesCustom - néhány felhasználói függvény # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: PreferencesCustom.pm,v 1.2 2009/02/16 11:47:34 tr Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Service::PreferencesCustom; use strict; use warnings; use vars qw(@ISA $VERSION); sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for (qw(DBObject ConfigObject LogObject)) { $Self->{$_} = $Param{$_} || die "Nincs $_!"; } # beállítások tábla adatai $Self->{PreferencesTable} = 'service_preferences'; $Self->{PreferencesTableKey} = 'preferences_key'; $Self->{PreferencesTableValue} = 'preferences_value'; $Self->{PreferencesTableServiceID} = 'service_id'; return $Self; } sub ServicePreferencesSet { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for (qw(ServiceID Key Value)) { if ( !defined( $Param{$_} ) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $_!" ); return; } } # régi adatok törlése return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . "$Self->{PreferencesTableServiceID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$Param{ServiceID}, \$Param{Key} ], ); $Self->{PreferencesTableValue} .= 'PreferencesCustom'; # új adatok beszúrása return $Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableServiceID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$Param{ServiceID}, \$Param{Key}, \$Param{Value} ], ); } sub ServicePreferencesGet { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for (qw(ServiceID)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $_!" ); return; } } # annak ellenőrzése, hogy a szolgáltatás beállítások elérhetők-e if ( !$Self->{ConfigObject}->Get('ServicePreferences') ) { return; } # beállítások lekérése return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableServiceID} = ?", Bind => [ \$Param{ServiceID} ], ); my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # adatok visszaadása return %Data; } 1;

source: There is the need to activate your custom service preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni szolgáltatás beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.

source: <ConfigItem Name="Service::PreferencesModule" Required="1" Valid="1"> <Description Lang="en">Default service preferences module.</Description> <Description Lang="de">Standard Service Preferences Module.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Service::Preferences</SubGroup> <Setting> <String Regex="">Kernel::System::Service::PreferencesCustom</String> </Setting> </ConfigItem>
hu: <ConfigItem Name="Service::PreferencesModule" Required="1" Valid="1"> <Description Lang="en">Default service preferences module.</Description> <Description Lang="hu">Alapértelmezett szolgáltatás beállítások modul.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Service::Preferences</SubGroup> <Setting> <String Regex="">Kernel::System::Service::PreferencesCustom</String> </Setting> </ConfigItem>

source: SLA Preferences Module
hu: SLA beállítások modul
