Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: The <literal>ProviderProcessRequest</literal> function gets the request from the Remote System (in this case the same OTRS) and extracts the data and the operation to perform from the request. For this example the operation is always <literal>test_operation</literal>.
hu: A <literal>ProviderProcessRequest</literal> függvény megkapja a kérést a távoli kiszolgálótól (ebben az esetben ugyanaz az OTRS), és kibontja az adatokat és a műveletet a kérésből a végrehajtáshoz. Ennél a példánál a művelet mindig a <literal>test_operation</literal>.

source: The way this function parses the request to get the data and the operation name, depends completely on the protocol to be implemented and the external modules that are used for.
hu: Annak a módja, ahogy ez a függvény feldolgozza a kérést az adatok és a művelet nevének lekéréséhez, az teljes egészében a megvalósítandó protokolltól és azon külső moduloktól függ, amelyekhez használják azokat.

source: sub ProviderGenerateResponse { my ( $Self, %Param ) = @_; if ( $Self->{TransportConfig}->{Config}->{Fail} ) { return { Success => 0, ErrorMessage => 'Test response generation failed', }; } my $Response; if ( !$Param{Success} ) { $Response = HTTP::Response->new( 500 => ( $Param{ErrorMessage} || 'Internal Server Error' ) ); $Response->protocol('HTTP/1.0'); $Response->content_type("text/plain; charset=UTF-8"); $Response->date(time); } else { # generate a request string from the data my $Request = HTTP::Request::Common::POST( 'http://testhost.local/', Content => $Param{Data} ); $Response = HTTP::Response->new( 200 => "OK" ); $Response->protocol('HTTP/1.0'); $Response->content_type("text/plain; charset=UTF-8"); $Response->add_content_utf8( $Request->content() ); $Response->date(time); } $Self->{DebuggerObject}->Debug( Summary => 'Sending HTTP response', Data => $Response->as_string(), ); # now send response to client print STDOUT $Response->as_string(); return { Success => 1, }; }
hu: sub ProviderGenerateResponse { my ( $Self, %Param ) = @_; if ( $Self->{TransportConfig}->{Config}->{Fail} ) { return { Success => 0, ErrorMessage => 'A tesztválasz előállítása sikertelen.', }; } my $Response; if ( !$Param{Success} ) { $Response = HTTP::Response->new( 500 => ( $Param{ErrorMessage} || 'Internal Server Error' ) ); $Response->protocol('HTTP/1.0'); $Response->content_type("text/plain; charset=UTF-8"); $Response->date(time); } else { # egy kérésszöveg előállítása az adatokból my $Request = HTTP::Request::Common::POST( 'http://testhost.local/', Content => $Param{Data} ); $Response = HTTP::Response->new( 200 => "OK" ); $Response->protocol('HTTP/1.0'); $Response->content_type("text/plain; charset=UTF-8"); $Response->add_content_utf8( $Request->content() ); $Response->date(time); } $Self->{DebuggerObject}->Debug( Summary => 'HTTP-válasz küldése', Data => $Response->as_string(), ); # a válasz elküldése a kliensnek most print STDOUT $Response->as_string(); return { Success => 1, }; }

source: This function sends the response back to the Remote System for the requested operation.
hu: Ez a függvény visszaküldi a választ a távoli rendszernek a kért művelethez.

source: For this particular example we return a standard HTTP response success (200) or not (500), along with the required data on each case.
hu: Ennél a bizonyos példánál minden esetben egy szabványos sikeres HTTP-választ adunk vissza (200) vagy nem (500) a szükséges adatok mellett.

source: sub RequesterPerformRequest { my ( $Self, %Param ) = @_; if ( $Self->{TransportConfig}->{Config}->{Fail} ) { return { Success => 0, ErrorMessage => "HTTP status code: 500", Data => {}, }; } # use custom protocol handler to avoid sending out real network requests LWP::Protocol::implementor( testhttp => 'Kernel::GenericInterface::Transport::HTTP::Test::CustomHTTPProtocol' ); my $UserAgent = LWP::UserAgent->new(); my $Response = $UserAgent->post( 'testhttp://localhost.local/', Content => $Param{Data} ); return { Success => 1, Data => { ResponseContent => $Response->content(), }, }; }
hu: sub RequesterPerformRequest { my ( $Self, %Param ) = @_; if ( $Self->{TransportConfig}->{Config}->{Fail} ) { return { Success => 0, ErrorMessage => "HTTP állapotkód: 500", Data => {}, }; } # egyéni protokollkezelő használata a valódi hálózati kérések kiküldésének elkerüléséhez LWP::Protocol::implementor( testhttp => 'Kernel::GenericInterface::Transport::HTTP::Test::CustomHTTPProtocol' ); my $UserAgent = LWP::UserAgent->new(); my $Response = $UserAgent->post( 'testhttp://localhost.local/', Content => $Param{Data} ); return { Success => 1, Data => { ResponseContent => $Response->content(), }, }; }

source: This is the only function that is used by OTRS as requester. It sends the request to the Remote System and waits for its response.
hu: Ez az egyetlen olyan függvény, amelyet az OTRS mint kérelmező használ. Elküldi a kérést a távoli rendszernek, és várakozik annak válaszára.

source: For this example we use a custom protocol handler to avoid send the request to the real network. This custom protocol is specified below.
hu: Ennél a példánál egy egyéni protokollkezelőt használunk a valódi hálózatra történő kérésküldés elkerüléséhez. Ez az egyéni protokoll az alábbiakban van megadva.

source: package Kernel::GenericInterface::Transport::HTTP::Test::CustomHTTPProtocol; use base qw(LWP::Protocol); sub new { my $Class = shift; return $Class->SUPER::new(@_); } sub request { ## no critic my $Self = shift; my ( $Request, $Proxy, $Arg, $Size, $Timeout ) = @_; my $Response = HTTP::Response->new( 200 => "OK" ); $Response->protocol('HTTP/1.0'); $Response->content_type("text/plain; charset=UTF-8"); $Response->add_content_utf8( $Request->content() ); $Response->date(time); #print $Request->as_string(); #print $Response->as_string(); return $Response; }
hu: package Kernel::GenericInterface::Transport::HTTP::Test::CustomHTTPProtocol; use base qw(LWP::Protocol); sub new { my $Class = shift; return $Class->SUPER::new(@_); } sub request { ## nem kritikus my $Self = shift; my ( $Request, $Proxy, $Arg, $Size, $Timeout ) = @_; my $Response = HTTP::Response->new( 200 => "OK" ); $Response->protocol('HTTP/1.0'); $Response->content_type("text/plain; charset=UTF-8"); $Response->add_content_utf8( $Request->content() ); $Response->date(time); #print $Request->as_string(); #print $Response->as_string(); return $Response; }

source: This is the code for the custom protocol that we use. This approach is only useful for training or for testing environments where the Remote Systems are not available.
hu: Ez a kód ahhoz az egyéni protokollhoz van, amelyet használunk. Ez a megközelítés csak gyakorlásnál vagy olyan tesztelési környezeteknél hasznos, ahol a távoli rendszerek nem érhetők el.

source: For a new module development we do not recommend to use this approach, a real protocol needs to be implemented.
hu: Egy új modul kifejlesztéséhez nem ajánljuk ezen megközelítés használatát, egy valódi protokollt kell megvalósítani.

source: There is the need to register this network transport module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen hálózati átviteli modul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.

source: Log Module
hu: Naplózás modul

source: There is a global log interface for OTRS that provides the possibility to create own log backends.
hu: Létezik egy globális naplózó felület az OTRS-hez, amely a saját naplózó háttérprogramok létrehozásának lehetőségét biztosítja.

source: Writing an own logging backend is as easy as reimplementing the <literal>Kernel::System::Log::Log()</literal> method.
hu: Egy saját naplózó háttérprogram írása olyan egyszerű, mint újra megvalósítani a <literal>Kernel::System::Log::Log()</literal> metódust.

source: Code example: <literal>Kernel::System::Log::CustomFile</literal>
hu: Kódpélda: <literal>Kernel::System::Log::CustomFile</literal>

source: In this small example, we'll write a little file logging backend which works similar to <literal>Kernel::System::Log::File</literal>, but prepends a string to each logging entry.
hu: Ebben a kis példában írni fogunk egy kicsi fájl naplózó háttérprogramot, amely hasonlóan működik mint a <literal>Kernel::System::Log::File</literal>, de egy szöveget fűz minden naplóbejegyzés elé.

source: # -- # Kernel/System/Log/CustomFile.pm - file log backend # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Log::CustomFile; use strict; use warnings; umask "002"; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # get needed objects for (qw(ConfigObject EncodeObject)) { if ( $Param{$_} ) { $Self->{$_} = $Param{$_}; } else { die "Got no $_!"; } } # get logfile location $Self->{LogFile} = '/var/log/CustomFile.log'; # set custom prefix $Self->{CustomPrefix} = 'CustomFileExample'; # Fixed bug# 2265 - For IIS we need to create a own error log file. # Bind stderr to log file, because IIS do print stderr to web page. if ( $ENV{SERVER_SOFTWARE} && $ENV{SERVER_SOFTWARE} =~ /^microsoft\-iis/i ) { if ( !open STDERR, '>>', $Self->{LogFile} . '.error' ) { print STDERR "ERROR: Can't write $Self->{LogFile}.error: $!"; } } return $Self; } sub Log { my ( $Self, %Param ) = @_; my $FH; # open logfile if ( !open $FH, '>>', $Self->{LogFile} ) { # print error screen print STDERR "\n"; print STDERR " >> Can't write $Self->{LogFile}: $! <<\n"; print STDERR "\n"; return; } # write log file $Self->{EncodeObject}->SetIO($FH); print $FH '[' . localtime() . ']'; if ( lc $Param{Priority} eq 'debug' ) { print $FH "[Debug][$Param{Module}][$Param{Line}] $Self->{CustomPrefix} $Param{Message}\n"; } elsif ( lc $Param{Priority} eq 'info' ) { print $FH "[Info][$Param{Module}] $Self->{CustomPrefix} $Param{Message}\n"; } elsif ( lc $Param{Priority} eq 'notice' ) { print $FH "[Notice][$Param{Module}] $Self->{CustomPrefix} $Param{Message}\n"; } elsif ( lc $Param{Priority} eq 'error' ) { print $FH "[Error][$Param{Module}][$Param{Line}] $Self->{CustomPrefix} $Param{Message}\n"; } else { # print error messages to STDERR print STDERR "[Error][$Param{Module}] $Self->{CustomPrefix} Priority: '$Param{Priority}' not defined! Message: $Param{Message}\n"; # and of course to logfile print $FH "[Error][$Param{Module}] $Self->{CustomPrefix} Priority: '$Param{Priority}' not defined! Message: $Param{Message}\n"; } # close file handle close $FH; return 1; } 1;
hu: # -- # Kernel/System/Log/CustomFile.pm - fájlnaplózó háttérprogram # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Log::CustomFile; use strict; use warnings; umask "002"; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok lekérése for (qw(ConfigObject EncodeObject)) { if ( $Param{$_} ) { $Self->{$_} = $Param{$_}; } else { die "Nincs $_!"; } } # a naplófájl helyének lekérése $Self->{LogFile} = '/var/log/CustomFile.log'; # egyéni előtag beállítása $Self->{CustomPrefix} = 'CustomFileExample'; # A 2265. hiba javítása - IIS-nél létre kell hoznunk egy saját hibanapló fájlt. # A szabványos hibakimenet kötése a naplófájlhoz, mert az IIS nem írja # ki a szabványos hibakimenetet a weboldalra. if ( $ENV{SERVER_SOFTWARE} && $ENV{SERVER_SOFTWARE} =~ /^microsoft\-iis/i ) { if ( !open STDERR, '>>', $Self->{LogFile} . '.error' ) { print STDERR "HIBA: nem lehet írni: $Self->{LogFile}.error: $!"; } } return $Self; } sub Log { my ( $Self, %Param ) = @_; my $FH; # naplófájl megnyitása if ( !open $FH, '>>', $Self->{LogFile} ) { # hibaképernyő kiírása print STDERR "\n"; print STDERR " >> Nem lehet írni: $Self->{LogFile}: $! <<\n"; print STDERR "\n"; return; } # naplófájl írása $Self->{EncodeObject}->SetIO($FH); print $FH '[' . localtime() . ']'; if ( lc $Param{Priority} eq 'debug' ) { print $FH "[Debug][$Param{Module}][$Param{Line}] $Self->{CustomPrefix} $Param{Message}\n"; } elsif ( lc $Param{Priority} eq 'info' ) { print $FH "[Info][$Param{Module}] $Self->{CustomPrefix} $Param{Message}\n"; } elsif ( lc $Param{Priority} eq 'notice' ) { print $FH "[Notice][$Param{Module}] $Self->{CustomPrefix} $Param{Message}\n"; } elsif ( lc $Param{Priority} eq 'error' ) { print $FH "[Error][$Param{Module}][$Param{Line}] $Self->{CustomPrefix} $Param{Message}\n"; } else { # hibaüzenetek írása a szabványos hibakimenetre print STDERR "[Error][$Param{Module}] $Self->{CustomPrefix} prioritás: '$Param{Priority}' nincs meghatározva! Üzenet: $Param{Message}\n"; # és természetesen a naplófájlba print $FH "[Error][$Param{Module}] $Self->{CustomPrefix} prioritás: '$Param{Priority}' nincs meghatározva! Üzenet: $Param{Message}\n"; } # fájlkezelő lezárása close $FH; return 1; } 1;

source: Configuration example
hu: Beállítási példa

source: To activate our custom logging module, the administrator can either set the existing configuration item <literal>LogModule</literal> manually to <literal>Kernel::System::Log::CustomFile</literal>. To realize this automatically, you can provide an XML configuration file which overrides the default setting.
hu: Az egyéni naplózómodul bekapcsolásához az adminisztrátor beállíthatja kézzel a meglévő <literal>LogModule</literal> konfigurációs elemet a <literal>Kernel::System::Log::CustomFile</literal> osztályhoz. Ennek automatikus megvalósításához megadhat egy XML beállítófájlt, amely felülbírálja az alapértelmezett beállítást.

source: Use case examples
hu: Használati eset példák

source: Useful logging backends could be logging to a web service or to encrypted files.
hu: Hasznos naplózó háttérprogram lehet egy webszolgáltatásba vagy egy titkosított fájlba történő naplózás.

source: Please note that <literal>Kernel::System::Log</literal> has other methods than <literal>Log()</literal> which cannot be reimplemented, for example code for working with shared memory segments and log data caching.
hu: Ne feledje, hogy a <literal>Kernel::System::Log</literal> a <literal>Log()</literal> metóduson kívül egyéb metódusokkal is rendelkezik, amelyeket nem lehet újra megvalósítani, például az osztott memóriaszakaszokkal történő munkához tartozó kód és a naplóadatok gyorsítótárazása.

source: Notification Module
hu: Értesítési modul

source: Notification modules are used to display a notification below the main navigation. You can write and register your own notification module. There are currently 5 ticket menus in the OTRS framework.
hu: Az értesítési modulokat egy értesítés megjelenítéséhez használják a fő navigáció alatt. Megírhatja és regisztrálhatja a saját értesítési modulját. Jelenleg 5 jegymenü van az OTRS keretrendszerben.

source: The notification modules are located under <filename>Kernel/Output/HTML/TicketNotification*.pm</filename>. Following, there is an example of a notify module. Save it under <filename>Kernel/Output/HTML/TicketNotificationCustom.pm</filename>. You just need 2 functions: <code>new()</code> and <code>Run()</code>.
hu: Az értesítési modulok a <filename>Kernel/Output/HTML/TicketNotification*.pm</filename> alatt találhatók. Ezt követően egy értesítőmodul példája található. Mentse el a <filename>Kernel/Output/HTML/TicketNotificationCustom.pm</filename> fájlba. Mindössze két függvényre van szüksége: <code>new()</code> és <code>Run()</code>.

source: # -- # Kernel/Output/HTML/NotificationCustom.pm # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Output::HTML::NotificationCustom; use strict; use warnings; use Kernel::System::Custom; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # get needed objects for my $Object (qw(ConfigObject LogObject DBObject LayoutObject TimeObject UserID)) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } $Self->{CustomObject} = Kernel::System::Custom->new(%Param); return $Self; } sub Run { my ( $Self, %Param ) = @_; # get session info my %CustomParam = (); my @Customs = $Self->{CustomObject}->GetAllCustomIDs(); my $IdleMinutes = $Param{Config}->{IdleMinutes} || 60 * 2; for (@Customs) { my %Data = $Self->{CustomObject}->GetCustomIDData( CustomID => $_, ); if ( $Self->{UserID} ne $Data{UserID} && $Data{UserType} eq 'User' && $Data{UserLastRequest} && $Data{UserLastRequest} + ( $IdleMinutes * 60 ) > $Self->{TimeObject}->SystemTime() && $Data{UserFirstname} && $Data{UserLastname} ) { $CustomParam{ $Data{UserID} } = "$Data{UserFirstname} $Data{UserLastname}"; if ( $Param{Config}->{ShowEmail} ) { $CustomParam{ $Data{UserID} } .= " ($Data{UserEmail})"; } } } for ( sort { $CustomParam{$a} cmp $CustomParam{$b} } keys %CustomParam ) { if ( $Param{Message} ) { $Param{Message} .= ', '; } $Param{Message} .= "$CustomParam{$_}"; } if ( $Param{Message} ) { return $Self->{LayoutObject}->Notify( Info => 'Custom Message: %s", "' . $Param{Message} ); } else { return ''; } } 1;
hu: # -- # Kernel/Output/HTML/NotificationCustom.pm # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Output::HTML::NotificationCustom; use strict; use warnings; use Kernel::System::Custom; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok lekérése for my $Object (qw(ConfigObject LogObject DBObject LayoutObject TimeObject UserID)) { $Self->{$Object} = $Param{$Object} || die "Nincs $Object!"; } $Self->{CustomObject} = Kernel::System::Custom->new(%Param); return $Self; } sub Run { my ( $Self, %Param ) = @_; # munkamenet-információk lekérése my %CustomParam = (); my @Customs = $Self->{CustomObject}->GetAllCustomIDs(); my $IdleMinutes = $Param{Config}->{IdleMinutes} || 60 * 2; for (@Customs) { my %Data = $Self->{CustomObject}->GetCustomIDData( CustomID => $_, ); if ( $Self->{UserID} ne $Data{UserID} && $Data{UserType} eq 'User' && $Data{UserLastRequest} && $Data{UserLastRequest} + ( $IdleMinutes * 60 ) > $Self->{TimeObject}->SystemTime() && $Data{UserFirstname} && $Data{UserLastname} ) { $CustomParam{ $Data{UserID} } = "$Data{UserFirstname} $Data{UserLastname}"; if ( $Param{Config}->{ShowEmail} ) { $CustomParam{ $Data{UserID} } .= " ($Data{UserEmail})"; } } } for ( sort { $CustomParam{$a} cmp $CustomParam{$b} } keys %CustomParam ) { if ( $Param{Message} ) { $Param{Message} .= ', '; } $Param{Message} .= "$CustomParam{$_}"; } if ( $Param{Message} ) { return $Self->{LayoutObject}->Notify( Info => 'Custom Message: %s", "' . $Param{Message} ); } else { return ''; } } 1;

source: There is the need to activate your custom notification module. This can be done using the XML configuration below. There may be additional parameters in the config hash for your notification module.
hu: Szükség van az egyéni értesítési modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni. Lehetnek további paraméterek is a beállítás kivonatában az értesítési moduljánál.

source: <ConfigItem Name="Frontend::NotifyModule###3-Custom" Required="0" Valid="0"> <Description Lang="en">Module to show custom message in the agent interface.</Description> <Description Lang="de">Mit diesem Modul können eigene Meldungenen innerhalb des Agent-Interfaces angezeigt werden.</Description> <Group>Framework</Group> <SubGroup>Frontend::Agent::ModuleNotify</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::Output::HTML::NotificationCustom</Item> <Item Key="Key1">1</Item> <Item Key="Key2">2</Item> </Hash> </Setting> </ConfigItem>
hu: <ConfigItem Name="Frontend::NotifyModule###3-Custom" Required="0" Valid="0"> <Description Lang="en">Module to show custom message in the agent interface.</Description> <Description Lang="hu">Egy modul egyéni üzenet megjelenítéséhez az ügyintézői felületen.</Description> <Group>Framework</Group> <SubGroup>Frontend::Agent::ModuleNotify</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::Output::HTML::NotificationCustom</Item> <Item Key="Key1">1</Item> <Item Key="Key2">2</Item> </Hash> </Setting> </ConfigItem>

source: Useful ticket menu implementation could be a link to an external tool if parameters (e.g. <literal>FreeTextField</literal>) have been set.
hu: Hasznos jegymenü megvalósítás lehet egy hivatkozás egy külső eszközre, ha a paraméterek (például <literal>FreeTextField</literal>) be lettek állítva.

source: Output Filter
hu: Kimenetszűrő

source: Output filters allow to modify HTML on the fly. It is best practice to use output filters instead of modifying <filename>.tt</filename> files directly. There are three good reasons for that. When the same adaptation has to be applied to several frontend modules then the adaption only has to be implemented once. The second advantage is that when OTRS is upgraded there is a chance that the filter doesn't have to be updated, when the relevant pattern has not changed. When two extensions modify the same file there is a conflict during the installation of the second package. This conflict can be resolved by using two output filters that modify the same frontend module.
hu: A kimenetszűrők lehetővé teszik a HTML módosítását röptében. A bevált gyakorlat a kimenetszűrők használata a <filename>.tt</filename> fájlok közvetlen módosítása helyett. Három jó ok létezik erre. Amikor ugyanazt az átdolgozást kell alkalmazni számos előtétprogram modulon, akkor az átdolgozást csak egyszer kell megvalósítani. A második előnye, hogy amikor az OTRS-t frissítik, akkor megvan az esély arra, hogy a szűrőt nem kell frissíteni, ha a hozzá tartozó minta nem változott. Amikor két kiterjesztés ugyanazt a fájlt módosítja, akkor ütközés lép fel a második csomag telepítése során. Ez az ütközés feloldható két kimenetszűrő használatával, amelyek ugyanazt az előtétprogram modult módosítják.

source: There are three different kinds of output filters. They are active at different stages of the generation of HTML content.
hu: Három különböző fajta kimenetszűrő létezik. Ezek a HTML tartalom előállításának különböző szakaszaiban aktívak.

source: These filters allow to modify the output of a template after it was rendered.
hu: Ezek a szűrők lehetővé teszik egy sablon kimenetének módosítást, miután az megjelenítésre került.
