Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: =head1 NAME Kernel::System::ObjectManager - Central singleton manager and object instance generator =head1 SYNOPSIS # In toplevel scripts only! local $Kernel::OM = Kernel::System::ObjectManager->new(); # Everywhere: get a singleton instance (and create it, if needed). my $ConfigObject = $Kernel::OM->Get('Kernel::Config'); # Remove singleton objects and all their dependencies. $Kernel::OM->ObjectsDiscard( Objects => ['Kernel::System::Ticket', 'Kernel::System::Queue'], ); =head1 DESCRIPTION The ObjectManager is the central place to create and access singleton OTRS objects (via C<L</Get()>>) as well as create regular (unmanaged) object instances (via C<L</Create()>>).
hu: =head1 NAME Kernel::System::ObjectManager - Központi egyke kezelő és objektumpéldány előállító =head1 SYNOPSIS # Csak felső szintű parancsfájlokban! local $Kernel::OM = Kernel::System::ObjectManager->new(); # Bárhol: egyke példány lekérése (és létrehozása, ha szükséges). my $ConfigObject = $Kernel::OM->Get('Kernel::Config'); # Egyke objektumok és az összes függőségük eltávolítása. $Kernel::OM->ObjectsDiscard( Objects => ['Kernel::System::Ticket', 'Kernel::System::Queue'], ); =head1 DESCRIPTION Az objektumkezelő egy központi hely az egyke OTRS objektumok létrehozásához és hozzáféréséhez (a C<L</Get()>> metóduson keresztül), valamint szabályos (nem kezelt) objektumpéldányok létrehozásához (a C<L</Create()>> metóduson keresztül).

source: In case the <literal>DESCRIPTION</literal> does not add any value to the line in the <literal>NAME</literal> section, it should be rewritten or removed altogether.
hu: Abban az esetben, ha a <literal>DESCRIPTION</literal> nem ad hozzá semmilyen értéket a <literal>NAME</literal> szakaszban lévő sorhoz, akkor át kell írni vagy teljesen el kell távolítani.

source: The second important change is that functions are now documented as <literal>=head2</literal> instead of the previously used <literal>=item</literal>.
hu: A második fontos változtatás, hogy a függvények mostantól <literal>=head2</literal> szakaszként vannak dokumentálva a korábban használt <literal>=item</literal> helyett.

source: =head2 Get() Retrieves a singleton object, and if it not yet exists, implicitly creates one for you. my $ConfigObject = $Kernel::OM->Get('Kernel::Config'); # On the second call, this returns the same ConfigObject as above. my $ConfigObject2 = $Kernel::OM->Get('Kernel::Config'); =cut sub Get { ... }
hu: =head2 Get() Lekér egy egyke objektumot, és ha még nem létezik, akkor a háttérben létrehoz egyet. my $ConfigObject = $Kernel::OM->Get('Kernel::Config'); # Második meghíváskor visszaadja ugyanazt a ConfigObject objektumot, mint ami fent van. my $ConfigObject2 = $Kernel::OM->Get('Kernel::Config'); =cut sub Get { ... }

source: These changes lead to an improved online API documentation as can be seen in the ObjectManager documentation for <ulink url="http://otrs.github.io/doc/api/otrs/5.0/Perl/Kernel/System/ObjectManager.pm.html">OTRS 5</ulink> and <ulink url="http://otrs.github.io/doc/api/otrs/6.0/Perl/Kernel/System/ObjectManager.pm.html">OTRS 6</ulink>.
hu: Ezek a változtatások egy továbbfejlesztett internetes API dokumentációhoz vezetnek, amint az objektumkezelő dokumentációjában is látható az <ulink url="http://otrs.github.io/doc/api/otrs/5.0/Perl/Kernel/System/ObjectManager.pm.html">OTRS 5</ulink> és az <ulink url="http://otrs.github.io/doc/api/otrs/6.0/Perl/Kernel/System/ObjectManager.pm.html">OTRS 6</ulink> esetén.

source: Improvements to templating and working with JavaScript
hu: Továbbfejlesztések a sablonozáshoz és a JavaScript használatával végzett munkához

source: JavaScript removed from templates
hu: A JavaScript eltávolításra került a sablonokból

source: With OTRS 6, all JavaScript - especially located in <literal>JSOnDocumentComplete</literal> blocks - is removed from template files and moved to JavaScript files instead. Only in very rare conditions JavaScript needs to be placed within template files. For all other occurrences, place the JS code in module-specific JavaScript files. An <literal>Init()</literal> method within such a JavaScript file is executed automatically on file load (for the initialization of event bindings etc.) if you register the JavaScript file at the OTRS application. This is done by executing <literal>Core.Init.RegisterNamespace(TargetNS, 'APP_MODULE');</literal> at the end of the namespace declaration within the JavaScript file.
hu: Az OTRS 6-tal az összes JavaScript - különösen a <literal>JSOnDocumentComplete</literal> blokkokban lévők - eltávolításra kerültek a sablonfájlokból, és át lettek helyezve JavaScript fájlokba. Csak nagyon ritka feltételek esetén szükséges a JavaScript kódot a sablonfájlokon belül elhelyezni. Minden egyéb előfordulásnál tegye a JS kódot a modulra jellemző JavaScript fájlokba. Az ilyen JavaScript fájlokban lévő <literal>Init()</literal> metódus automatikusan végre lesz hajtva a fájl betöltésekor (az eseménykötések előkészítéséhez, stb.), ha regisztrálja a JavaScript fájlt az OTRS alkalmazásban. Ezt a <literal>Core.Init.RegisterNamespace(TargetNS, 'APP_MODULE');</literal> végrehajtásával lehet elvégezni a névtér meghatározásának végén a JavaScript fájlon belül.

source: Template files for rich text editor removed
hu: A sablonfájlok eltávolításra kerültek a Rich Text szerkesztőből

source: Along with the refactoring of the JavaScript within template files (see above), the template files for the rich text editor (<literal>RichTextEditor.tt</literal> and <literal>CustomerRichTextEditor.tt</literal>) were removed as they are no longer necessary.
hu: A sablonfájlokon belül lévő JavaScript újraírása mellett (lásd fent) a Rich Text szerkesztő (<literal>RichTextEditor.tt</literal> és <literal>CustomerRichTextEditor.tt</literal>) sablonfájljai is eltávolításra kerültek, mivel azok többé nem szükségesek.

source: Typically, these template files were included in the module-specific template files within a block:
hu: Általában ezek a sablonfájlok voltak megtalálhatók a modulra jellemző sablonfájlokban egy blokkon belül:

source: This is no longer needed and can be removed. Instead of calling this block from the Perl module, it is now necessary to set the needed rich text parameters there. Instead of:
hu: Erre többé nincs szükség, és eltávolítható. Ahelyett, hogy meghívná ezt a blokkot a Perl-modulból, mostantól szükség van a szükséges Rich Text paraméter beállítására ott. Ahelyett, hogy:

source: you now have to call:
hu: mostantól ezt kell meghívnia:

source: Same rule applies for customer interface. Remove RichText blocks from <filename>CustomerRichTextEditor.tt</filename> and apply following code instead:
hu: Ugyanez a szabály alkalmazható az ügyfélfelületre is. Távolítsa el a Rich Text blokkokat a <filename>CustomerRichTextEditor.tt</filename> fájlból, és inkább a következő kódot alkalmazza:

source: Translations in JavaScript files
hu: Fordítások a JavaScript fájlokban

source: Adding translatable strings in JavaScript was quite difficult in OTRS. The string had to be translated in Perl or in the template and then sent to the JavaScript function. With OTRS 6, translation of strings is possible directly in the JavaScript file. All other workarounds, especially blocks in the templates only for translating strings, should be removed.
hu: A lefordítható szövegek hozzáadása a JavaScript fájlokban eléggé nehéz volt az OTRS-ben. A szöveget le kellett fordítani a Perl-modulban vagy a sablonban, majd ezután kellett átküldeni a JavaScript függvénynek. Az OTRS 6-tal a szövegek lefordítása közvetlenül a JavaScript fájlokban lehetséges. Az összes egyéb kerülőmegoldást el kell távolítani, különösen a csak a sablonokban lévő, a szövegek lefordításához használt blokkokat.

source: Instead, the new JavaScript translation namespace <literal>Core.Language</literal> should be used to translate strings directly in the JS file:
hu: Ehelyett az új <literal>Core.Language</literal> JavaScript fordítási névteret kell használni a szövegek lefordításához közvetlenül a JavaScript fájlokban:

source: It is also possible to handover JS variables to be replaced in the string directly:
hu: Lehetséges továbbá JavaScript változókat átadni, amelyek ki lesznek cserélve közvetlenül a szövegben:

source: Every <literal>%s</literal> is replaced by the variable given as extra parameter. The number of parameters is not limited.
hu: Minden egyes <literal>%s</literal> helykitöltő a további paraméterként átadott változóval lesz kicserélve. A paraméterek száma nincs korlátozva.

source: Handover data from Perl to JavaScript
hu: Adatok átadása Perlből JavaScriptbe

source: To achieve template files without JavaScript code, some other workarounds had to be replaced with an appropriate solution. Besides translations, also the handover of data from Perl to JavaScript has been a problem in OTRS. The workaround was to add a JavaScript block in the template in which JavaScript variables were declared and filled with template tags based on data handed over from Perl to the template.
hu: A sablonfájlok JavaScript kód nélküli eléréséhez néhány egyéb kerülőmegoldást is meg kellett tenni a megfelelő megoldáshoz. A fordítások mellett az adatok átadása a Perlből a JavaScriptbe továbbra is probléma az OTRS-ben. A kerülőmegoldás az volt, hogy egy JavaScript blokkot adtak a sablonba, amelyben a JavaScript változók meg lettek határozva és fel lettek töltve a sablon címkéivel a Perlből a sablonba átadott adatok alapján.

source: The handover process of data from Perl to JavaScript is now much easier in OTRS 6. To send specific data as variable from Perl to JavaScript, one only has to call a function on Perl-side. The data is than automatically available in JavaScript.
hu: Az adatok Perlből JavaScriptbe történő átadásának folyamata mostantól sokkal egyszerűbb az OTRS 6-ban. Ahhoz, hogy bizonyos adatokat változóként küldjön át a Perlből a JavaScriptbe, valakinek csak egy függvényt kell meghívnia a Perl oldalon. Ezután az adatok automatikusa elérhetők lesznek a JavaScriptben.

source: In Perl you only have to call:
hu: A Perlben csak ezt kell meghívni:

source: The <literal>Value</literal> parameter is automatically converted to a JSON object and can also contain complex data.
hu: A <literal>Value</literal> paraméter automatikusan át lesz alakítva JSON objektummá, és tartalmazhat összetett adatokat is.

source: In JavaScript you can get the data with:
hu: A JavaScriptben az adatokat ezzel kaphatja meg:

source: This replaces all workarounds which need to be removed when porting a module to OTRS 6, because JavaScript in template files is now only allowed in very rare conditions (see above).
hu: Ez felváltja az összes kerülőmegoldást, amiket el kell távolítani egy modul OTRS 6-ra történő átírásakor, mert a sablonfájlokban lévő JavaScript mostantól csak nagyon ritka feltételek esetén engedélyezett (lást fent).

source: HTML templates for JavaScript
hu: HTML sablonok a JavaScripthez

source: OTRS 6 exposes new JavaScript template API via <literal>Core.Template</literal> class. You can use it in your JavaScript code in a similar way as you use <literal>TemplateToolkit</literal> from Perl code.
hu: Az OTRS 6 egy új JavaScript API-t vezet be a <literal>Core.Template</literal> osztályon keresztül. Hasonló módon használhatja a JavaScript kódjában mint ahogy a <literal>TemplateToolkit</literal> modult használta a Perl kódból.

source: Here's an example for porting existing <literal>jQuery</literal> based code to new template API:
hu: Itt egy példa a meglévő <literal>jQuery</literal> alapú kód átírásához az új sablon API-ra:

source: var DivID = 'MyDiv', DivText = 'Hello, world!'; $('<div />').addClass('CSSClass') .attr('id', DivID) .text(DivText) .appendTo('body');
hu: var DivID = 'MyDiv', DivText = 'Helló, Világ!'; $('<div />').addClass('CSSClass') .attr('id', DivID) .text(DivText) .appendTo('body');

source: First, make sure to create a new template file under <literal>Kernel/Output/JavaScript/Templates/Standard</literal> folder. In doing this, you should keep following in mind:
hu: Először győződjön meg arról, hogy létrehozott-e egy új sablonfájlt a <literal>Kernel/Output/JavaScript/Templates/Standard</literal> mappa alatt. Ehhez a következőket kell észben tartania:

source: Create a subfolder with name of your <literal>Module</literal>.
hu: Hozzon létre egy almappát a <literal>Modulja</literal> nevével.

source: You may reuse any existing subfolder structure but only if it makes sense for your component (e.g. <literal>Agent/MyModule/</literal> or <literal>Agent/Admin/MyModule/</literal>).
hu: Újrahasználhatja a meglévő almappa szerkezetet, de csak akkor, ha van értelme a komponensénél (például <literal>Agent/SajatModul/</literal> vagy <literal>Agent/Admin/SajatModul/</literal>).

source: Use <literal>.html.tmpl</literal> as extension for template file.
hu: Használjon <literal>.html.tmpl</literal> kiterjesztést a sablonfájlnál.

source: Name templates succinctly and clearly in order to avoid confusion (i.e. good: <literal>Agent/MyModule/SettingsDialog.html.tmpl</literal>, bad: <literal>Agent/SettingsDialogTemplate.html.tmpl</literal>).
hu: Tömören és világosan nevezze el a sablonokat annak érdekében, hogy elkerülje a félreértéseket (például jó: <literal>Agent/SajatModul/SettingsDialog.html.tmpl</literal>, rossz: <literal>Agent/SettingsDialogTemplate.html.tmpl</literal>).

source: Then, add your HTML to the template file, making sure to use placeholders for any variables you might need:
hu: Ezután adja hozzá a HTML-t a sablonfájlhoz, meggyőződve arról, hogy helykitöltőket használ minden olyan változónál, amire szüksége lehet:

source: Then, just get rendered HTML by calling <literal>Core.Template.Render</literal> method with template path (without extension) and object containing variables for replacement:
hu: Majd egyszerűen jeleníttesse meg a HTML-t a <literal>Core.Template.Render</literal> metódusnak a sablon elérési útjával (kiterjesztés nélkül) és a változókat tartalmazó objektummal való meghívásával a helyettesítéshez:

source: var DivHTML = Core.Template.Render('Agent/MyModule/SettingsDialog', { DivID: 'MyDiv', DivText: 'Hello, world!' }); $(DivHTML).appendTo('body');
hu: var DivHTML = Core.Template.Render('Agent/MyModule/SettingsDialog', { DivID: 'MyDiv', DivText: 'Helló, Világ!' }); $(DivHTML).appendTo('body');

source: Internally, <literal>Core.Template</literal> uses Nunjucks engine for parsing templates. Essentially, any valid Nunjucks syntax is supported, please see <ulink url="https://mozilla.github.io/nunjucks/templating.html">their documentation</ulink> for more information.
hu: Belsőleg a <literal>Core.Template</literal> a Nunjucks motort használja a sablonok feldolgozásához. Lényegében bármilyen érvényes Nunjucks szintaxis támogatott, nézze meg a <ulink url="https://mozilla.github.io/nunjucks/templating.html">dokumentációjukat</ulink> a további információkért.

source: Here are some tips:
hu: Itt van néhány tipp:

source: You can use <literal>| Translate</literal> filter for string translation to current language.
hu: Használhatja a <literal>| Translate</literal> szűrőt a szövegek lefordításához az aktuális nyelvre.

source: All <literal>{{ VarName }}</literal> variable outputs are HTML escaped by default. If you need to output some existing HTML, please use <literal>| safe</literal> filter to bypass escaping.
hu: Az összes <literal>{{ VarName }}</literal> változókimenet alapértelmezetten HTML elfedésben részesített. Ha valamilyen meglévő HTML-t szeretne kiíratni, akkor használja a <literal>| safe</literal> szűrőt az elfedés megkerüléséhez.

source: Use <literal>| urlencode</literal> for encoding URL parameters.
hu: Használja az <literal>| urlencode</literal> szűrőt az URL paramétereinek kódolásához.

source: Complex structures in replacement object are supported, so feel free to pass arrays or hashes and iterate over them right from template. For example, look at <literal>{% for %}</literal> syntax in <ulink url="https://mozilla.github.io/nunjucks/templating.html#for"> Nunjucks documentation</ulink>.
hu: A helyettesítő objektumban lévő összetett szerkezetek is támogatottak, szóval nyugodtan átadhat tömböket vagy kivonatokat, és végiglépkedhet rajtuk közvetlenül a sablonban. Például nézze meg a <literal>{% for %}</literal> szintaxist a <ulink url="https://mozilla.github.io/nunjucks/templating.html#for">Nunjucks dokumentációjában</ulink>.

source: Checking user permissions
hu: Felhasználói jogosultságok ellenőrzése

source: Before OTRS 6, user permissions were stored in the session and passed to the <code>LayoutObject</code> as attributes, which were then in turn accessed to determine user permissions like <code>if ($LayoutObject->{'UserIsGroup[admin]'}) { ... }</code>.
hu: Az OTRS 6 előtt a felhasználói jogosultságok a munkamenetben voltak eltárolva és attribútumként lettek átadva a <code>LayoutObject</code> objektumnak, amely viszont ezután hozzáfért a meghatározott felhasználói jogosultságokhoz, mint például <code>if ($LayoutObject->{'UserIsGroup[admin]'}) { ... }</code>.

source: With OTRS 6, permissions are no longer stored in the session and also not passed to the <code>LayoutObject</code>. Please switch your code to calling <code>PermissionCheck()</code> on <code>Kernel::System::Group</code> (for agents) or <code>Kernel::System::CustomerGroup</code> (for customers). Here's an example:
hu: Az OTRS 6-tal a jogosultságok többé nincsenek a munkamenetben eltárolva, és nem kerülnek átadásra a <code>LayoutObject</code> objektumnak sem. Cserélje ki a kódjában, hogy a <code>PermissionCheck()</code> metódust hívja meg a <code>Kernel::System::Group</code> modulon (ügyintézőknél) vagy a <code>Kernel::System::CustomerGroup</code> modulon (ügyfeleknél). Itt egy példa:

source: Ticket API changes
hu: Jegy API változások

source: For OTRS 6, all extensions need to be checked and ported from <literal>$Ticket{SolutionTime}</literal> to <literal>$Ticket{Closed}</literal> if <literal>TicketGet()</literal> is called with the <literal>Extended</literal> parameter (see bug<ulink url="http://bugs.otrs.org/show_bug.cgi?id=11872">#11872</ulink>).
hu: Az OTRS 6-nál az összes kiterjesztést ellenőrizni kell, és át kell írni a <literal>$Ticket{SolutionTime}</literal> értékről <literal>$Ticket{Closed}</literal> értékre, ha a <literal>TicketGet()</literal> az <literal>Extended</literal> paraméterrel lett meghívva (nézze meg a <ulink url="https://bugs.otrs.org/show_bug.cgi?id=11872">11872</ulink>-s hibát).

source: Additionally, the database column <literal>ticket.create_time_unix</literal> was removed, and likewise the value <literal>CreateTimeUnix</literal> from the <literal>TicketGet()</literal> result data. Please use the value <literal>Created</literal> (database column <literal>ticket.create_time</literal>) instead.
hu: Ezenkívül a <literal>ticket.create_time_unix</literal> adatbázisoszlop eltávolításra került, és hasonlóképpen a <literal>CreateTimeUnix</literal> érték is el lett távolítva a <literal>TicketGet()</literal> eredményeként kapott adatokból. Használja helyette a <literal>Created</literal> értéket (<literal>ticket.create_time</literal> adatbázisoszlop).

source: <literal>LinkObject</literal> Events
hu: <literal>LinkObject</literal> események

source: In OTRS 6, old ticket-specific <literal>LinkObject</literal> events have been dropped:
hu: Az OTRS 6-ban a régi, jegyekre jellemző <literal>LinkObject</literal> események el lettek dobva:

source: Any event handlers listening on these events should be ported to two new events instead:
hu: Ehelyett az ezekre figyelő összes eseménykezelőt át kell írni az két új eseményre:

source: These new events will be triggered any time a link is added or deleted by <literal>LinkObject</literal>, regardless of the object type. <literal>Data</literal> parameter will contain all information your event handlers might need for further processing, e.g.:
hu: Ezek az új események mindig aktiválva lesznek, amikor egy kapcsolatot hozzáad vagy töröl a <literal>LinkObject</literal>, tekintet nélkül az objektum típusára. A <literal>Data</literal> paraméter tartalmazni fogja az összes információt, amire az eseménykezelőjének szüksége lehet a további feldolgozáshoz, például:

source: Name of the link source object (e.g. <literal>Ticket</literal>).
hu: A kapcsolat forrásobjektumának neve (például <literal>Ticket</literal>).

source: Key of the link source object (e.g. <literal>TicketID</literal>).
hu: A kapcsolat forrásobjektumának kulcsa (például <literal>TicketID</literal>).

source: Name of the link target object (e.g. <literal>FAQItem</literal>).
hu: A kapcsolat célobjektumának neve (például <literal>FAQItem</literal>).

source: Key of the link target object (e.g. <literal>FAQItemID</literal>).
hu: A kapcsolat célobjektumának kulcsa (például <literal>FAQItemID</literal>).

source: Type of the link (e.g. <literal>ParentChild</literal>).
hu: A kapcsolat típusa (például <literal>ParentChild</literal>).

source: State of the link (<literal>Valid</literal> or <literal>Temporary</literal>).
hu: A kapcsolat állapota (<literal>Valid</literal> vagy <literal>Temporary</literal>).

source: With these new events in place, any events specific for custom <literal>LinkObject</literal> module implementations can be dropped, and all event handlers ported to use them instead. Since source and target object names are provided in the event itself, it would be trivial to make them run only in specific situations.
hu: Ezekkel az új eseményekkel az egyéni <literal>LinkObject</literal> modulra jellemző bármely esemény megvalósításai eldobhatók, és az összes eseménykezelő átírható ezek használatára helyette. Mivel a forrás- és a célobjektumnevek magában az eseményben is meg vannak adva, magától értetődő lehet, hogy csak különleges helyzetekben legyenek futtatva.

source: To register your event handler for these new events, make sure to add a registration in the configuration, for example:
hu: Ahhoz, hogy az eseménykezelőt regisztrálja ezekhez az új eseményekhez, győződjön meg arról, hogy hozzáadott-e egy regisztrációt a beállításokhoz, például:

source: Article API changes
hu: Bejegyzés API változások

source: In OTRS 6, changes to Article API have been made, in preparations for new <emphasis>Omni Channel</emphasis> infrastructure.
hu: Az OTRS 6-ban változások történtek a bejegyzés API-n az új <emphasis>Omni Channel</emphasis> infrastruktúra előkészítéséhez.

source: Meta Article API
hu: Metabejegyzés API

source: Article object now provides top-level article functions that do not involve back-end related data.
hu: A bejegyzés objektum mostantól olyan felső szintű bejegyzésfüggvényeket biztosít, amelyek nem vonják be a háttérprogramhoz kapcsolódó adatokat.

source: Following methods related to articles have been moved to <literal>Kernel::System::Ticket::Article</literal> object:
hu: A következő, bejegyzésre vonatkozó metódusok át lettek helyezve a <literal>Kernel::System::Ticket::Article</literal> objektumba:

source: If you are referencing any of these methods via <literal>Kernel::System::Ticket</literal> object in your code, please switch to Article object and use it instead. For example:
hu: Ha hivatkozik ezen metódusok bármelyikére a <literal>Kernel::System::Ticket</literal> objektumon keresztül a kódjában, akkor váltson át a bejegyzés objektum használatára helyette. Például:
