Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: We can see that a lot of code is used to load the packages and create the common objects that must be passed to OTRS objects to be used in the script. With OTRS 4, this looks quite different:
hu: Láthatjuk, hogy rengeteg kódot használnak a csomagok betöltéséhez és a gyakori objektumok létrehozásához, amelyet a parancsfájlban át kell adni a használandó OTRS objektumoknak. Az OTRS 4-gyel ez egy kicsit máshogy néz ki:

source: use strict; use warnings; use File::Basename; use FindBin qw($RealBin); use lib dirname($RealBin); use lib dirname($RealBin) . '/Kernel/cpan-lib'; use lib dirname($RealBin) . '/Custom'; use Kernel::System::ObjectManager; # create common objects local $Kernel::OM = Kernel::System::ObjectManager->new( 'Kernel::System::Log' => { LogPrefix => 'OTRS-otrs.CheckDB.pl', }, ); # get database object my $DBObject = $Kernel::OM->Get('Kernel::System::DB');
hu: use strict; use warnings; use File::Basename; use FindBin qw($RealBin); use lib dirname($RealBin); use lib dirname($RealBin) . '/Kernel/cpan-lib'; use lib dirname($RealBin) . '/Custom'; use Kernel::System::ObjectManager; # a szokásos objektumok létrehozása local $Kernel::OM = Kernel::System::ObjectManager->new( 'Kernel::System::Log' => { LogPrefix => 'OTRS-otrs.CheckDB.pl', }, ); # az adatbázis-objektum lekérése my $DBObject = $Kernel::OM->Get('Kernel::System::DB');

source: The new code is a bit shorter than the old. It is no longer necessary to load all the packages, just the <literal>ObjectManager</literal>. Subsequently <literal>$Kernel::OM->Get('My::Perl::Package')</literal> can be used to get instances of objects which only have to be created once. The <literal>LogPrefix</literal> setting controls the log messages that <literal>Kernel::System::Log</literal> writes, it could also be omitted.
hu: Az új kód egy kicsivel rövidebb mint a régi. Többé nem szükséges az összes csomag betöltése, elég csak az <literal>ObjectManager</literal> objektumot. Azután a <literal>$Kernel::OM->Get('Sajat::Perl::Csomag')</literal> használható az objektumok példányainak lekéréséhez, amelyeket csak egyszer kell létrehozni. A <literal>LogPrefix</literal> beállítás vezérli azokat a naplóüzeneteket, amelyeket a <literal>Kernel::System::Log</literal> ír ki, így az szintén elhagyható.

source: From this example you can also deduce the general porting guide when it comes to accessing objects: don't store them in <literal>$Self</literal> any more (unless needed for specific reasons). Just fetch and use the objects on demand like <code>$Kernel::OM->Get('Kernel::System::Log')->Log(...)</code>. This also has the benefit that the <literal>Log</literal> object will only be created if something must be logged. Sometimes it could also be useful to create local variables if an object is used many times in a function, like <literal>$DBObject</literal> in the example above.
hu: Ebből a példából kikövetkeztetheti az általános átírási irányelvet is, amikor az objektumok hozzáférése jön: többé ne tárolja azokat a <literal>$Self</literal> változóban (hacsak bizonyos okokból ez nem szükséges). Egyszerűen kérje le és használja az objektumokat igény szerint, úgymint <code>$Kernel::OM->Get('Kernel::System::Log')->Log(...)</code>. Ennek megvan az az előnye is, hogy a <literal>Log</literal> objektumot csak akkor kell majd létrehozni, ha valamit naplózni kell. Néha hasznos lehet helyi változókat is létrehozni, ha egy objektumot többször használnak egy függvényben, mint például a fenti példában lévő <literal>$DBObject</literal> objektumot.

source: There's not much more to know when porting packages that should be loadable by the <literal>ObjectManager</literal>. They should declare the modules they use (via <code>$Kernel::OM->Get()</code>) like this:
hu: Nem kell sokkal többet tudnia az olyan csomagok átírásakor, amelyeknek betölthetőnek kell lenniük az <literal>ObjectManager</literal> használatával. Meg kell határozniuk azokat a modulokat, amelyeket használnak (a <code>$Kernel::OM->Get()</code> függvényen keresztül) ehhez hasonlóan:

source: The <literal>@ObjectDependencies</literal> declaration is needed for the <literal>ObjectManager</literal> to keep the correct order when destroying the objects.
hu: Az <literal>@ObjectDependencies</literal> meghatározás szükséges az <literal>ObjectManager</literal> objektumhoz a helyes sorrend megtartásához az objektumok megsemmisítésekor.

source: Let's look at <filename>Valid.pm</filename> from OTRS 3.3 and 4 to see the difference. Old:
hu: Nézzük meg a <filename>Valid.pm</filename> fájlt az OTRS 3.3-ból és a 4-ből, hogy lássuk a különbséget. A régi:

source: package Kernel::System::Valid; use strict; use warnings; use Kernel::System::CacheInternal; ... sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for my $Object (qw(DBObject ConfigObject LogObject EncodeObject MainObject)) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } $Self->{CacheInternalObject} = Kernel::System::CacheInternal->new( %{$Self}, Type => 'Valid', TTL => 60 * 60 * 24 * 20, ); return $Self; } ... sub ValidList { my ( $Self, %Param ) = @_; # read cache my $CacheKey = 'ValidList'; my $Cache = $Self->{CacheInternalObject}->Get( Key => $CacheKey ); return %{$Cache} if $Cache; # get list from database return if !$Self->{DBObject}->Prepare( SQL => 'SELECT id, name FROM valid' ); # fetch the result my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # set cache $Self->{CacheInternalObject}->Set( Key => $CacheKey, Value => \%Data ); return %Data; }
hu: package Kernel::System::Valid; use strict; use warnings; use Kernel::System::CacheInternal; ... sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for my $Object (qw(DBObject ConfigObject LogObject EncodeObject MainObject)) { $Self->{$Object} = $Param{$Object} || die "Nincs $Object!"; } $Self->{CacheInternalObject} = Kernel::System::CacheInternal->new( %{$Self}, Type => 'Valid', TTL => 60 * 60 * 24 * 20, ); return $Self; } ... sub ValidList { my ( $Self, %Param ) = @_; # gyorsítótár olvasása my $CacheKey = 'ValidList'; my $Cache = $Self->{CacheInternalObject}->Get( Key => $CacheKey ); return %{$Cache} if $Cache; # lista lekérése az adatbázisból return if !$Self->{DBObject}->Prepare( SQL => 'SELECT id, name FROM valid' ); # az eredmény lekérése my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # gyorsítótár beállítása $Self->{CacheInternalObject}->Set( Key => $CacheKey, Value => \%Data ); return %Data; }

source: New:
hu: Az új:

source: package Kernel::System::Valid; use strict; use warnings; our @ObjectDependencies = ( 'Kernel::System::Cache', 'Kernel::System::DB', 'Kernel::System::Log', ); ... sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); $Self->{CacheType} = 'Valid'; $Self->{CacheTTL} = 60 * 60 * 24 * 20; return $Self; } ... sub ValidList { my ( $Self, %Param ) = @_; # read cache my $CacheKey = 'ValidList'; my $Cache = $Kernel::OM->Get('Kernel::System::Cache')->Get( Type => $Self->{CacheType}, Key => $CacheKey, ); return %{$Cache} if $Cache; # get database object my $DBObject = $Kernel::OM->Get('Kernel::System::DB'); # get list from database return if !$DBObject->Prepare( SQL => 'SELECT id, name FROM valid' ); # fetch the result my %Data; while ( my @Row = $DBObject->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # set cache $Kernel::OM->Get('Kernel::System::Cache')->Set( Type => $Self->{CacheType}, TTL => $Self->{CacheTTL}, Key => $CacheKey, Value => \%Data ); return %Data; }
hu: package Kernel::System::Valid; use strict; use warnings; our @ObjectDependencies = ( 'Kernel::System::Cache', 'Kernel::System::DB', 'Kernel::System::Log', ); ... sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); $Self->{CacheType} = 'Valid'; $Self->{CacheTTL} = 60 * 60 * 24 * 20; return $Self; } ... sub ValidList { my ( $Self, %Param ) = @_; # gyorsítótár olvasása my $CacheKey = 'ValidList'; my $Cache = $Kernel::OM->Get('Kernel::System::Cache')->Get( Type => $Self->{CacheType}, Key => $CacheKey, ); return %{$Cache} if $Cache; # adatbázis-objektum lekérése my $DBObject = $Kernel::OM->Get('Kernel::System::DB'); # lista lekérése az adatbázisból return if !$DBObject->Prepare( SQL => 'SELECT id, name FROM valid' ); # az eredmény lekérése my %Data; while ( my @Row = $DBObject->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # gyorsítótár beállítása $Kernel::OM->Get('Kernel::System::Cache')->Set( Type => $Self->{CacheType}, TTL => $Self->{CacheTTL}, Key => $CacheKey, Value => \%Data ); return %Data; }

source: You can see that the dependencies are declared and the objects are only fetched on demand. We'll talk about the <literal>CacheInternalObject</literal> in the next section.
hu: Láthatja, hogy meg vannak határozva a függőségek, és az objektumok csak igény szerint vannak lekérve. A következő szakaszban a <literal>CacheInternalObject</literal> objektumról fogunk beszélni.

source: <literal>CacheInternalObject</literal> removed
hu: Eltávolított <literal>CacheInternalObject</literal>

source: Since <literal>Kernel::System::Cache</literal> is now also able to cache in-memory, <literal>Kernel::System::CacheInternal</literal> was dropped. Please see the previous example for how to migrate your code: you need to use the global <literal>Cache</literal> object and pass the <literal>Type</literal> settings with every call to <code>Get()</code>, <code>Set()</code>, <code>Delete()</code> and <code>CleanUp()</code>. The <literal>TTL</literal> parameter is now optional and defaults to 20 days, so you only have to specify it in <code>Get()</code> if you require a different <literal>TTL</literal> value.
hu: Mivel a <literal>Kernel::System::Cache</literal> mostantól képes a memóriában is gyorstárazni, a <literal>Kernel::System::CacheInternal</literal> eldobásra került. Nézze meg az előző példát, hogy a kódot hogyan kell átköltöztetni: a globális <literal>Cache</literal> objektumot kell használnia, és át kell adnia a <literal>Type</literal> beállítást a <code>Get()</code>, <code>Set()</code>, <code>Delete()</code> és <code>CleanUp()</code> függvények minden egyes hívásához. A <literal>TTL</literal> paraméter mostantól elhagyható, és alapértelmezetten 20 nap, így csak akkor kell megadnia a <code>Get()</code> függvényben, ha eltérő <literal>TTL</literal> értékre van szüksége.

source: It is especially important to add the <literal>Type</literal> to <code>CleanUp()</code> as otherwise not just the current cache type but the entire cache would be deleted.
hu: Különösen fontos a <literal>Type</literal> paraméter hozzáadása a <code>CleanUp()</code> függvényhez, mivel különben nem csak a jelenlegi gyorsítótártípus, hanem a teljes gyorsítótár törölve lehet.

source: Scheduler backend files moved
hu: Áthelyezett ütemező háttérprogram fájlok

source: The backend files of the scheduler moved from <filename>Kernel/Scheduler</filename> to <filename>Kernel/System/Scheduler</filename>. If you have any custom Task Handler modules, you need to move them also.
hu: Az ütemező háttérprogram fájljai áthelyezésre kerültek a <filename>Kernel/Scheduler</filename> mappából a <filename>Kernel/System/Scheduler</filename> mappába. Ha valamilyen egyéni feladatkezelő moduljai vannak, akkor azokat is át kell helyeznie.

source: Update <link linkend="package-code-install">code sections</link> in SOPM files
hu: <link linkend="package-code-install">Kódszakaszok</link> frissítése az SOPM fájlokban

source: Code tags in SOPM files have to be updated. Please do not use <literal>$Self</literal> any more. In the past this was used to get access to OTRS objects like the <literal>MainObject</literal>. Please use the <literal>ObjectManager</literal> now. Here is an example for the old style:
hu: Az SOPM fájlokban lévő kódcímkéket is frissíteni kell. Többé ne használja a <literal>$Self</literal> változót. Régebben ezt használták az olyan OTRS objektumokhoz való hozzáféréshez, mint például a <literal>MainObject</literal>. Mostantól használja az <literal>ObjectManager</literal> objektumot. Itt egy példa a régi stílusra:

source: <CodeInstall Type="post"> # define function name my $FunctionName = 'CodeInstall'; # create the package name my $CodeModule = 'var::packagesetup::' . $Param{Structure}->{Name}->{Content}; # load the module if ( $Self->{MainObject}->Require($CodeModule) ) { # create new instance my $CodeObject = $CodeModule->new( %{$Self} ); if ($CodeObject) { # start method if ( !$CodeObject->$FunctionName(%{$Self}) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Could not call method $FunctionName() on $CodeModule.pm." ); } } # error handling else { $Self->{LogObject}->Log( Priority => 'error', Message => "Could not call method new() on $CodeModule.pm." ); } } </CodeInstall>
hu: <CodeInstall Type="post"> # függvénynév meghatározása my $FunctionName = 'CodeInstall'; # a csomagnév létrehozása my $CodeModule = 'var::packagesetup::' . $Param{Structure}->{Name}->{Content}; # a modul betöltése if ( $Self->{MainObject}->Require($CodeModule) ) { # új példány létrehozása my $CodeObject = $CodeModule->new( %{$Self} ); if ($CodeObject) { # metódus elindítása if ( !$CodeObject->$FunctionName(%{$Self}) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Nem sikerült meghívni a(z) $FunctionName() metódust ebben: $CodeModule.pm." ); } } # hibakezelés else { $Self->{LogObject}->Log( Priority => 'error', Message => "Nem sikerült meghívni a new() metódust ebben: $CodeModule.pm." ); } } </CodeInstall>

source: Now this should be replaced by:
hu: Most ezt a következővel kell helyettesíteni:

source: <CodeInstall Type="post"><![CDATA[ $Kernel::OM->Get('var::packagesetup::MyPackage')->CodeInstall(); ]]
hu: <CodeInstall Type="post"><![CDATA[ $Kernel::OM->Get('var::packagesetup::SajatCsomag')->CodeInstall(); ]]

source: New Template Engine
hu: Új sablonmotor

source: With OTRS 4, the DTL template engine was replaced by Template::Toolkit. Please refer to the <link linkend="TemplatingMechanism">Templating section</link> for details on how the new template syntax looks like.
hu: Az OTRS 4-gyel a DTL sablonmotort a Template::Toolkit váltotta. A részletekért nézze meg a <link linkend="TemplatingMechanism">sablonozó szakaszt</link>, hogy hogyan néz ki az új sablonszintaxis.

source: These are the changes that you need to apply when converting existing DTL templates to the new Template::Toolkit syntax:
hu: Ezek azok a változtatások, amelyet alkalmaznia kell, amikor a meglévő DTL sablonokat az új Template::Toolkit szintaxisra alakítja át:

source: Template Changes from OTRS 3.3 to 4
hu: Sablonváltoztatások az OTRS 3.3-ról 4-re

source: DTL Tag
hu: DTL címke

source: Template::Toolkit tag
hu: Template::Toolkit címke

source: <literal>$Quote{"Text", "$Length"}</literal>
hu: <literal>$Quote{"Szöveg", "$Length"}</literal>

source: cannot be replaced directly, see examples below
hu: nem lehet közvetlenül lecserélni, lásd a lenti példákat

source: <literal>$Text{"Text with %s placeholders", "String"}</literal>
hu: <literal>$Text{"Szöveg %s helykitöltőkkel", "String"}</literal>

source: <literal>[% Translate("Text with %s placeholders", "String") | html %]</literal>
hu: <literal>[% Translate("Szöveg %s helykitöltőkkel", "String") | html %]</literal>

source: <literal>$Text{"Text with dynamic %s placeholders", "$QData{Name}"}</literal>
hu: <literal>$Text{"Szöveg dinamikus %s helykitöltőkkel", "$QData{Name}"}</literal>

source: <literal>[% Translate("Text with dynamic %s placeholders", Data.Name) | html %]</literal>
hu: <literal>[% Translate("Szöveg dinamikus %s helykitöltőkkel", Data.Name) | html %]</literal>

source: <literal>'$JSText{"Text with dynamic %s placeholders", "$QData{Name}"}'</literal>
hu: <literal>'$JSText{"Szöveg dinamikus %s helykitöltőkkel", "$QData{Name}"}'</literal>

source: <literal>[% Translate("Text with dynamic %s placeholders", Data.Name) | JSON %]</literal>
hu: <literal>[% Translate("Szöveg dinamikus %s helykitöltőkkel", Data.Name) | JSON %]</literal>

source: <literal>"$JSText{"Text with dynamic %s placeholders", "$QData{Name}"}"</literal>
hu: <literal>"$JSText{"Szöveg dinamikus %s helykitöltőkkel", "$QData{Name}"}"</literal>

source: There is also a helper script <filename>bin/otrs.MigrateDTLtoTT.pl</filename> that will automatically port the DTL files to Template::Toolkit syntax for you. It might fail if you have errors in your DTL, please correct these first and re-run the script afterwards.
hu: Létezik egy <filename>bin/otrs.MigrateDTLtoTT.pl</filename> segítő parancsfájl is, amely automatikusan át fogja írni önnek a DTL-fájlokat a Template::Toolkit szintaxisra. Sikertelen lehet, ha hibák találhatók a DTL-jében, ezért először javítsa ki ezeket, és azután futtassa újra a parancsfájlt.

source: There are a few more things to note when porting your code to the new template engine:
hu: Van még további néhány dolog, amelyet tudomásul kell vennie a kód átírásakor az új sablonmotorra:

source: All language files must now have the <literal>use utf8;</literal> pragma.
hu: Az összes nyelvi fájlnak mostantól rendelkeznie kell a <literal>use utf8;</literal> kikötéssel.

source: <code>Layout::Get()</code> is now deprecated. Please use <code>Layout::Translate()</code> instead.
hu: A <code>Layout::Get()</code> mostantól elavult. Használja a <code>Layout::Translate()</code> függvényt helyette.

source: All occurrences of <literal>$Text{""}</literal> in Perl code must now be replaced by calls to <code>Layout::Translate()</code>.
hu: A Perl-kódban a <literal>$Text{""}</literal> összes előfordulását mostantól le kell cserélni a <code>Layout::Translate()</code> hívásaival.

source: This is because in DTL there was no separation between template and data. If DTL-Tags were inserted as part of some data, the engine would still parse them. This is no longer the case in Template::Toolkit, there is a strict separation of template and data.
hu: Ez azért van, mert a DTL-ben nem volt különválasztás a sablon és az adatok között. Ha DTL-címkék voltak beszúrva valamilyen adat részeként, akkor a motornak továbbra is fel kellene dolgozni azokat. Ez többé nincs a Template::Toolkit esetén, mert itt a sablon és az adatok szigorú különválasztása van.

source: Hint: should you ever need to interpolate tags in data, you can use the <literal>Interpolate</literal> filter for this (<literal>[% Data.Name | Interpolate %]</literal>). This is not recommended for security and performance reasons!
hu: Tipp: ha valamikor interpolálnia kell a címkéket az adatokban, akkor ehhez használhatja az <literal>Interpolate</literal> szűrőt (<literal>[% Data.Name | Interpolate %]</literal>). Ez nem ajánlott biztonsági és teljesítménybeli okok miatt!

source: For the same reason, dynamically injected JavaScript that was enclosed by <literal>dtl:js_on_document_complete</literal> will not work any more. Please use <code>Layout::AddJSOnDocumentComplete()</code> instead of injecting this as template data.
hu: Hasonló okból a <literal>dtl:js_on_document_complete</literal> által körbezárt dinamikusan beágyazott JavaScript sem fog működni többé. Használja a <code>Layout::AddJSOnDocumentComplete()</code> függvényt ahelyett, hogy ezt sablonadatként ágyazná be.

source: You can find an example for this in <filename>Kernel/System/DynamicField/Driver/BaseSelect.pm</filename>.
hu: Erre találhat egy példát a <filename>Kernel/System/DynamicField/Driver/BaseSelect.pm</filename> fájlban.

source: Please be careful with <literal>pre</literal> output filters (the ones configured in <literal>Frontend::Output::FilterElementPre</literal>). They still work, but they will prevent the template from being cached. This could lead to serious performance issues. You should definitely not have any <literal>pre</literal> output filters that operate on all templates, but limit them to certain templates via configuration setting.
hu: Legyen óvatos a <literal>pre</literal> kimenetszűrőkkel (a <literal>Frontend::Output::FilterElementPre</literal> objektumban beállítottakkal). Ezek továbbra is működnek, de meg fogják akadályozni a sablont, hogy gyorstárazza azokat. Ez komoly teljesítményproblémákhoz vezethet. Határozottan ne legyen egyetlen olyan <literal>pre</literal> kimenetszűrője sem, amely az összes sablonnal dolgozik, hanem korlátozza azokat bizonyos sablonokra a konfigurációs beállításokon keresztül.

source: The <literal>post</literal> output filters (<literal>Frontend::Output::FilterElementPost</literal>) don't have such strong negative performance effects. However, they should also be used carefully, and not for all templates.
hu: A <literal>post</literal> kimenetszűrőknek (<literal>Frontend::Output::FilterElementPost</literal>) nincsenek ilyen erős negatív teljesítményhatásaik. Azonban ezeket is körültekintéssel kell használni, és nem minden sablonnál.

source: New FontAwesome version
hu: Új FontAwesome verzió

source: With OTRS 4, we've also updated FontAwesome to a new version. As a consequence, the icons CSS classes have changed. While previously icons were defined by using a schema like <literal>icon-{iconname}</literal>, it is now <literal>fa fa-{iconname}</literal>.
hu: Az OTRS 4-gyel egy új verzióra frissítettük a FontAwesome betűkészletet is. Ennek következtében az ikonok CSS-osztályai megváltoztak. Miközben a korábbi ikonok egy <literal>icon-{ikonnév}</literal> szerű sémával voltak meghatározva, ezt mostantól a <literal>fa fa-{ikonnév}</literal> formában kell megadni.

source: Due to this change, you need to make sure to update all custom frontend module registrations which make use of icons (e.g. for the top navigation bar) to use the new schema. This is also true for templates where you're using icon elements like <literal>&lt;i class="icon-{iconname}"&gt;&lt;/i&gt;</literal>.
hu: Ezen változtatás miatt meg kell győződnie arról, hogy frissítette-e az összes olyan egyéni előtétprogram-modul regisztrációit, amelyek ikonokat használnak (például a felső navigációs sávnál) az új séma használatához. Ez igaz az olyan sablonoknál is, ahol ikonelemeket használ, mint például <literal>&lt;i class="icon-{ikonnév}"&gt;&lt;/i&gt;</literal>.

source: With OTRS 4, in Unit Tests <literal>$Self</literal> no longer provides common objects like the <literal>MainObject</literal>, for example. Please always use <code>$Kernel::OM->Get('...')</code> to fetch these objects.
hu: Az OTRS 4-gyel az egységtesztekben a <literal>$Self</literal> többé nem szolgáltat olyan gyakori objektumokat, mint például a <literal>MainObject</literal>. Mindig a <code>$Kernel::OM->Get('...')</code> függvényt használja ezen objektumok lekéréséhez.

source: Custom Ticket History types
hu: Egyéni jegy előzmény típusok

source: If you use any custom ticket history types, you have to take two steps for them to be displayed correctly in <literal>AgentTicketHistory</literal> of OTRS 4+.
hu: Ha bármilyen egyéni jegy előzmény típusokat használ, akkor két lépést kell elvégeznie, hogy azok helyesen legyenek megjelenítve az OTRS 4+ <literal>AgentTicketHistory</literal> képernyőjén.

source: Firstly, you have to register your custom ticket history types via SysConfig. This could look like:
hu: Először regisztrálnia kell az egyéni jegy előzmény típusait a rendszerbeállításokon keresztül. Ez így nézhet ki:

source: The second step is to translate the English text that you provided for the custom ticket history type in your translation files, if needed. That's it!
hu: A második lépés az egyéni jegy előzmény típusnál biztosított angol szöveg lefordítása a nyelvi fájljaiban, ha szükséges. Ennyi!
