Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: If you are interested in the details, please refer to <ulink url="https://github.com/OTRS/otrs/commit/454dfac6d4eb85652a267e5e65514e386d3cf275">this commit</ulink> for additional information about the changes that happened in OTRS.
hu: Ha érdeklődik a részletek iránt, akkor nézze meg <ulink url="https://github.com/OTRS/otrs/commit/454dfac6d4eb85652a267e5e65514e386d3cf275">ezt a véglegesítést</ulink> azon változtatásokkal kapcsolatos további információkról, amelyek az OTRS-ben történtek.

source: From OTRS 4 to 5
hu: OTRS 4-ről 5-re

source: This section lists changes that you need to examine when porting your package from OTRS 4 to 5.
hu: Ez a szakasz azokat a változtatásokat sorolja fel, amelyeket meg kell vizsgálnia, amikor átírja a csomagját az OTRS 4-ről 5-re.

source: <filename>Kernel/Output/HTML</filename> restructured
hu: Átszerkesztett <filename>Kernel/Output/HTML</filename>

source: In OTRS 5, <filename>Kernel/Output/HTML</filename> was restructured. All Perl modules (except <filename>Layout.pm</filename>) were moved to subdirectories (one for every module layer). Template (theme) files were also moved from <filename>Kernel/Output/HTML/Standard</filename> to <filename>Kernel/Output/HTML/Templates/Standard</filename>. Please perform this migration also in your code.
hu: Az OTRS 5-ben a <filename>Kernel/Output/HTML</filename> átszerkesztésre került. Az összes Perl modul (kivéve a <filename>Layout.pm</filename> fájlt) alkönyvtárakba került áthelyezésre (minden modulréteghez egybe). A sablonfájlok (témák) is áthelyezésre kerültek a <filename>Kernel/Output/HTML/Standard</filename> könyvtárból a <filename>Kernel/Output/HTML/Templates/Standard</filename> könyvtárba. Végezze el ezeket a költöztetéseket a saját kódjában is.

source: Pre-Output-Filters
hu: Elő-kimenetszűrők

source: With OTRS 5 there is no support for <literal>pre</literal> output filters any more. These filters changed the template content before it was parsed, and that could potentially lead to bad performance issues because the templates could not be cached any more and had to be parsed and compiled every time.
hu: Az OTRS 5-tel többé nincs támogatás a <literal>pre</literal> kimenetszűrőkhöz. Ezek a szűrők azelőtt változtatták meg a sablon tartalmát, mielőtt az feldolgozásra került volna, és potenciálisan rossz teljesítményproblémákhoz vezethettek, ugyanis a sablonokat többé nem lehetett gyorstárazni, és minden alkalommal fel kellett dolgozni és le kellett fordítani.

source: Just switch from <literal>pre</literal> to <literal>post</literal> output filters. To translate content, you can run <code>$LayoutObject->Translate()</code> directly. If you need other template features, just define a small template file for your output filter and use it to render your content before injecting it into the main data. It can also be helpful to use jQuery DOM operations to reorder/replace content on the screen in some cases instead of using regular expressions. In this case you would inject the new code somewhere in the page as invisible content (e. g. with the class <literal>Hidden</literal>), and then move it with jQuery to the correct location in the DOM and show it.
hu: Egyszerűen váltson a <literal>pre</literal> kimenetszűrőről a <literal>post</literal> kimenetszűrőre. A tartalom lefordításához futtathatja közvetlenül a <code>$LayoutObject->Translate()</code> függvényt. Ha egyéb sablonszolgáltatásokra van szüksége, akkor egyszerűen határozzon meg egy kis sablonfájlt a kimenetszűrőhöz, és használja azt a tartalom megjelenítéséhez, mielőtt beültetné azt a fő adatokba. Néhány esetben hasznos lehet a jQuery DOM műveletek használata is a képernyőn lévő tartalom sorrendjének megváltoztatásához vagy cseréjéhez a reguláris kifejezések használata helyett. Ebben az esetben láthatatlan tartalomként kellene beültetnie az új kódot valahova az oldalba (például a <literal>Hidden</literal> osztállyal), majd ezután áthelyezni a jQuery használatával a megfelelő helyre a DOM-ban, és megjeleníteni azt.

source: To make using post output filters easier, there is also a new mechanism to request HTML comment hooks for certain templates/blocks. You can add in your module config XML like:
hu: Az utó-kimenetszűrők használatának megkönnyítéséhez létezik egy új mechanizmus is a HTML megjegyzéshorgok lekéréséhez bizonyos sablonoknál vagy blokkoknál. Hozzáadhatja a modulbeállító XML-be a következőhöz hasonlóan:

source: IE 8 and IE 9
hu: IE 8 és IE 9

source: Support for IE 8 and 9 <ulink url="https://github.com/OTRS/otrs/commit/3b1aff21984d7b32f626df95e072337245615b36">was dropped</ulink>. You can remove any workarounds in your code for these platforms, as well as any old <literal>&lt;CSS_IE7&gt;</literal> or <literal>&lt;CSS_IE8&gt;</literal> loader tags that might still lurk in your XML config files.
hu: Az IE 8 és IE 9 támogatást <ulink url="https://github.com/OTRS/otrs/commit/3b1aff21984d7b32f626df95e072337245615b36">eldobták</ulink>. Eltávolíthat minden kerülőmegoldást a kódjából, amelyet ezekhez a platformokhoz készített, valamint az összes olyan régi <literal>&lt;CSS_IE7&gt;</literal> vagy <literal>&lt;CSS_IE8&gt;</literal> betöltő címkét, amely még esetleg megbújik az XML beállítófájljaiban.

source: GenericInterface API change in "Ticket" connector
hu: Általános felület API változás a „Ticket” csatlakozóban

source: The operation <code>TicketGet()</code> returns dynamic field data from ticket and articles differently than in OTRS 4. Now they are cleanly separated from the rest of the static ticket and article fields - they are now grouped in a list called <literal>DynamicField</literal>. Please adapt any applications using this operation accordingly.
hu: A <code>TicketGet()</code> művelet másképpen ad vissza dinamikus mező adatokat a jegyből és a bejegyzésből mint az OTRS 4-ben. Mostantól ezek tisztán el vannak választva a többi statikus jegy- és bejegyzésmezőktől - innentől kezdve csoportosítva vannak egy <literal>DynamicField</literal> nevű listába. Eszerint alakítson át minden olyan alkalmazást, amely ezt a műveletet használja.

source: # changed from: Ticket => [ { TicketNumber => '20101027000001', Title => 'some title', ... DynamicField_X => 'value_x', }, ] # to: Ticket => [ { TicketNumber => '20101027000001', Title => 'some title', ... DynamicField => [ { Name => 'some name', Value => 'some value', }, ], }, ]
hu: # megváltoztatva erről: Ticket => [ { TicketNumber => '20101027000001', Title => 'valamilyen cím', ... DynamicField_X => 'x_ertek', }, ] # erre: Ticket => [ { TicketNumber => '20101027000001', Title => 'valamilyen cím', ... DynamicField => [ { Name => 'valamilyen név', Value => 'valamilyen érték', }, ], }, ]

source: Preview functions in dynamic statistics
hu: Előnézeti függvények a dinamikus statisztikákban

source: The new statistics GUI provides a preview for the current configuration. This must be implemented in the statistic modules and usually returns fake / random data for speed reasons. So for any dynamic (matrix) statistic that provides the method <code>GetStatElement()</code> you should also add a method <code>GetStatElementPreview()</code>, and for every dynamic (table) statistic that provides <code>GetStatTable()</code> you should accordingly add <code>GetStatTablePreview()</code>. Otherwise the preview in the new statistics GUI will not work for your statistics. You can find example implementations in the default OTRS statistics.
hu: Az új statisztikák grafikus felhasználói felülete egy előnézetet biztosít a jelenlegi beállításhoz. Ezt meg kell valósítani a statisztikák moduljaiban, és általában hamis vagy véletlenszerű adatokat adnak vissza sebességi okokból. Így minden olyan dinamikus (mátrix) statisztikánál, amely a <code>GetStatElement()</code> metódust biztosítja, hozzá kell adnia egy <code>GetStatElementPreview()</code> metódust is, valamint minden olyan dinamikus (tábla) statisztikánál, amely a <code>GetStatTable()</code> metódust biztosítja, hozzá kell adnia egy <code>GetStatTablePreview()</code> metódust ennek megfelelően. Egyébként az új statisztikák grafikus felhasználói felületén lévő előnézet nem fog működni a saját statisztikáinál. Példamegvalósításokat találhat az alapértelmezett OTRS statisztikákban.

source: HTML print discarded
hu: Eldobott HTML nyomtatás

source: Until OTRS 5, the Perl module <literal>PDF::API2</literal> was not present on all systems. Therefore a fallback HTML print mode existed. With OTRS 5, the module is now bundled and HTML print was dropped. <code>$LayoutObject->PrintHeader()</code> and <code>PrintFooter()</code> are not available any more. Please remove the HTML print fallback from your code and change it to generate PDF if necessary.
hu: Az OTRS 5-ig a <literal>PDF::API2</literal> Perl modul nem volt megtalálható minden rendszeren. Ezért létezett egy tartalék HTML nyomtatási mód. Az OTRS 5-tel a modul mostantól mellékelve van, és a HTML nyomtatás eldobásra került. A <code>$LayoutObject->PrintHeader()</code> és a <code>PrintFooter()</code> többé nem érhető el. Távolítsa el a tartalék HTML nyomtatást a kódjából, és változtassa meg a PDF előállításához, ha szükséges.

source: Translation string extraction improved
hu: Továbbfejlesztett fordítási szöveg kinyerés

source: Until OTRS 5, translatable strings could not be extracted from Perl code and Database XML definitions. This is now possible and makes dummy templates like <filename>AAA*.tt</filename> obsolete. Please see <link linkend="localization-translation-mechanism">this section</link> for details.
hu: Az OTRS 5-ig a lefordítható szövegeket nem lehetett kinyerni a Perl kódból és az adatbázis XML meghatározásokból. Ez mostantól lehetséges, és elavulttá tette az olyan üres sablonokat, mint például az <filename>AAA*.tt</filename> sablont. A részletekért nézze meg <link linkend="localization-translation-mechanism">ezt a szakaszt</link>.

source: From OTRS 5 to 6
hu: OTRS 5-ről 6-ra

source: This section lists changes that you need to examine when porting your package from OTRS 5 to 6.
hu: Ez a szakasz azokat a változtatásokat sorolja fel, amelyeket meg kell vizsgálnia, amikor átírja a csomagját az OTRS 5-ről 6-ra.

source: Date and time calculation
hu: Dátum- és időszámítás

source: In OTRS 6, a new module for date and time calculation was added: <literal>Kernel::System::DateTime</literal>. The module <literal>Kernel::System::Time</literal> is now deprecated and should not be used for new code anymore.
hu: Az OTRS 6-ban egy új modul lett hozzáadva a dátum- és időszámításhoz: <literal>Kernel::System::DateTime</literal>. A <literal>Kernel::System::Time</literal> modul mostantól elavult, és többé nem szabad használni új kódoknál.

source: The main advantage of the new <literal>Kernel::System::DateTime</literal> module is the support for real time zones like <literal>Europe/Berlin</literal> instead of time offsets in hours like <literal>+2</literal>. Note that also the old <literal>Kernel::System::Time</literal> module has been improved to support time zones. Time offsets have been completely dropped. This means that any code that uses time offsets for calculations has to be ported to use the new <literal>DateTime</literal> module instead. Code that doesn't fiddle around with time offsets itself can be left untouched in most cases. You just have to make sure that upon creation of a <literal>Kernel::System::Time</literal> object a valid time zone will be given.
hu: Az új <literal>Kernel::System::DateTime</literal> modul legfőbb előnye, hogy támogatja a valódi időzónákat (mint például <literal>Europe/Berlin</literal>) az órákban számított időeltolások (mint például <literal>+2</literal>) helyett. Ne feledje, hogy a régi <literal>Kernel::System::Time</literal> modult is továbbfejlesztették az időzónák támogatásához. Az időeltolások teljes mértékben eldobásra kerültek. Ez azt jelenti, hogy az összes olyan kódot, amely időeltolásokat használ a számításokhoz, át kell írni az új <literal>DateTime</literal> modul használatához. Azok a kódok, amelyek önmaguk nem foglalkoznak az időeltolásokkal, a legtöbb esetben maradhatnak érintetlenül. Mindössze arról kell meggyőződnie, hogy a <literal>Kernel::System::Time</literal> objektum létrehozásakor érvényes időzóna legyen megadva.

source: Here's an example for porting time offset code to time zones:
hu: Itt egy példa az időeltolásos kód időzónákra történő átírásához:

source: Code using the new <literal>Kernel::System::DateTime</literal> module:
hu: Az új <literal>Kernel::System::DateTime</literal> modult használó kód:

source: Please note that the returned time values with the new <code>Get()</code> function in the <literal>Kernel::System::DateTime</literal> module are without leading zero instead of the old <code>SystemTime2Date()</code> function in the <literal>Kernel::System::Time</literal> module. In the new <literal>Kernel::System::DateTime</literal> module the function <code>Format()</code> returns the date/time as string formatted according to the given format.
hu: Ne feledje, hogy a <literal>Kernel::System::DateTime</literal> modulban lévő új <code>Get()</code> függvénnyel visszaadott időértékek vezető nulla nélkül lesznek a <literal>Kernel::System::Time</literal> modulban lévő <code>SystemTime2Date()</code> függvény által visszaadottak helyett. Az új <literal>Kernel::System::DateTime</literal> modulban a <code>Format()</code> függvény szövegként adja vissza a dátumot és időt a megadott formátum szerint.

source: Adding the drag &amp; drop multiupload
hu: A fogd és vidd többszörös feltöltés hozzáadása

source: For OTRS 6, a multi attachment upload functionality was added. To implement the multi attachment upload in other extensions it is necessary to remove the attachment part from the template file, also the <code>JSOnDocumentComplete</code> parts (<literal>AttachmentDelete</literal> and <literal>AttachmentUpload</literal>). Please keep in mind, in some cases the JavaScript parts are already outsourced in <filename>Core.Agent.XXX</filename> files.
hu: Az OTRS 6-nál egy több mellékletet feltöltő funkcionalitás lett hozzáadva. Ahhoz, hogy a több melléklet feltöltését megvalósítsa az egyéb kiterjesztésekben, a melléklet rész, valamint a <code>JSOnDocumentComplete</code> részek eltávolítása szükséges a sablonfájlokból (<literal>AttachmentDelete</literal> és <literal>AttachmentUpload</literal>). Tartsa észben, hogy néhány esetben a JavaScript részek már kihelyezésre kerültek a <filename>Core.Agent.XXX</filename> fájlokba.

source: Please note that this is currently only applicable for places where it actually makes sense to have the possibility to upload multiple files (like <literal>AgentTicketPhone</literal>, <literal>AgentTicketCompose</literal>, etc.). This is not usable out of the box for admin screens.
hu: Ne feledje, hogy ez jelenleg csak olyan helyeknél alkalmazható, ahol tulajdonképpen van értelme a több fájl feltöltési lehetőségének (mint például <literal>AgentTicketPhone</literal>, <literal>AgentTicketCompose</literal>, stb.). Ez nem használható mindenféle beállítás nélkül az adminisztrátori képernyőknél.

source: To include the new multi attachment upload in the template, replace the existing <code>input type="file"</code> with the following code in your <filename>.tt</filename> template file:
hu: Ahhoz, hogy az új több melléklet feltöltést tartalmazza a sablon, cserélje le a meglévő <code>input type="file"</code> elemet a következő kódra a <filename>.tt</filename> sablonfájlban:

source: It is also necessary to remove the <code>IsUpload</code> variable and all other <code>IsUpload</code> parts from the Perl module. Code parts like following are not needed anymore:
hu: Az is szükséges, hogy eltávolítsa az <code>IsUpload</code> változót és az összes egyéb <code>IsUpload</code> részt a Perl-modulból. Az olyan kódrészek nem szükségesek többé, mint a következők:

source: Additional to that, the Attachment Layout Block needs to be replaced:
hu: Ezenkívül a melléklet megjelenítő blokkot is le kell cserélni:

source: Replace it with this code:
hu: Cserélje le erre a kódra:

source: If the module where you want to integrate multi upload supports standard templates, make sure to add a section to have a human readable file size format right after the attachments of the selected template have been loaded (see e.g. <literal>AgentTicketPhone</literal> for reference):
hu: Ha a modul, ahová integrálni szeretné a többszörös feltöltést, támogatja a szabványos sablonokat, akkor győződjön meg arról, hogy hozzáadott-e egy szakaszt az ember által olvasható fájlméret formátumok megjelenítéséhez közvetlenül azután, hogy a kiválasztott sablon melléklete be lett töltve (nézze meg az <literal>AgentTicketPhone</literal> modult hivatkozásként):

source: When adding selenium unit tests for the modules you ported, please take a look at <filename>Selenium/Agent/MultiAttachmentUpload.t</filename> for reference.
hu: Mikor Selenium egységteszteket ad az átírt modulokhoz, akkor vessen egy pillantást a <filename>Selenium/Agent/MultiAttachmentUpload.t</filename> fájlra hivatkozásként.

source: Improvements to administration screens
hu: Az adminisztrációs képernyők továbbfejlesztései

source: Add breadcrumbs to administration screens
hu: Kenyérmorzsák hozzáadása az adminisztrációs képernyőkhöz

source: In OTRS 6, all admin modules should have a breadcrumb. The breadcrumb only needs to be added on the <filename>.tt</filename> template file and should be placed right after the h1 headline on top of the file. Additionally, the headline should receive the class <code>InvisibleText</code> to make it only <emphasis>visible</emphasis> for screen readers.
hu: Az OTRS 6-ban az összes adminisztrációs modulnak tartalmaznia kell egy kenyérmorzsát. A kenyérmorzsát csak a <filename>.tt</filename> sablonfájlban kell hozzáadni, és közvetlenül a h1 címsor után kell elhelyezni a fájl felső részén. Ezenkívül a címsornak meg kell kapnia az <code>InvisibleText</code> osztályt, hogy csak a képernyőfelolvasóknak legye <emphasis>láthatóvá</emphasis>.

source: Please make sure to add the correct breadcrumb for all levels of your admin module (e.g. <literal>Subaction</literal>s):
hu: Győződjön meg arról, hogy hozzáadta-e a megfelelő kenyérmorzsát az adminisztrációs modul összes szintjéhez (például <literal>Subaction</literal>):

source: Add <emphasis>Save</emphasis> and <emphasis>Save and finish</emphasis> buttons to administration screens
hu: <emphasis>Mentés</emphasis> és <emphasis>Mentés és befejezés</emphasis> gombok hozzáadása az adminisztrációs képernyőkhöz

source: Admin modules in OTRS 6 should not only have a <emphasis>Save</emphasis> button, but also a <emphasis>Save and finish</emphasis> button. <emphasis>Save</emphasis> should leave the user on the same edit page after saving, <emphasis>Save and finish</emphasis> should lead back to the overview of the entity the user is currently working on. Please see existing OTRS admin screens for reference.
hu: Az OTRS 6-ban az adminisztrációs modulok nemcsak egy <emphasis>Mentés</emphasis> gombot tartalmaznak, hanem egy <emphasis>Mentés és befejezés</emphasis> gombot is. A <emphasis>Mentés</emphasis> gombnak ugyanazon a szerkesztőoldalon kell hagynia a felhasználót mentés után, míg a <emphasis>Mentés és befejezés</emphasis> gombnak vissza kell vinnie annak az entitásnak az áttekintőjére, amin a felhasználó jelenleg dolgozik. Nézze meg a meglévő OTRS adminisztrációs képernyőit hivatkozásként.

source: Migrate configuration files
hu: Beállítófájlok költöztetése

source: XML configuration file format
hu: XML beállítófájl formátum

source: OTRS 6 uses a new <link linkend="xml-config">XML configuration file format</link> and the location of configuration files moved from <filename>Kernel/Config/Files</filename> to <filename>Kernel/Config/Files/XML</filename>. To convert existing XML configuration files to the new format and location, you can use the following tool that is part of the OTRS framework:
hu: Az OTRS 6 egy új <link linkend="xml-config">XML beállítófájl formátumot</link> használ, és a beállítófájlok helye áthelyezésre került a <filename>Kernel/Config/Files</filename> mappából a <filename>Kernel/Config/Files/XML</filename> mappába. A meglévő XML beállítófájloknak az új formátumra és helyre történő átalakításához használhatja a következő eszközt, amely az OTRS keretrendszer része:

source: Perl configuration file format
hu: Perl beállítófájl formátum

source: OTRS 6 speeds up configuration file loading by dropping support for the old configuration format (1) that just used sequential Perl code and had to be run by <literal>eval</literal> and instead enforcing the new package-based format (1.1) for Perl configuration files. OTRS 6+ can only load files with this format, please make sure to convert any custom developments to it (see <filename>Kernel/Config/Files/ZZZ*.pm</filename> for examples). Every Perl configuration file needs to contain a package with a <literal>Load()</literal> method.
hu: Az OTRS 6 felgyorsítja a beállítófájlok betöltését a régi beállítási formátum (1) támogatásának eldobásával, amely csak egymás utáni Perl kódot használ, és az <literal>eval</literal> által kellett futtatni, és ehelyett kényszerítve az új csomagalapú formátumot (1.1) a Perl beállítófájloknál. Az OTRS 6+ csak az ebben a formátumban lévő fájlokat tudja betölteni, ezért győződjön meg arról, hogy átalakította-e az összes egyéni fejlesztést erre (lásd <filename>Kernel/Config/Files/ZZZ*.pm</filename> például). Minden egyes Perl beállítófájlnak tartalmaznia kell egy csomagot a <literal>Load()</literal> metódussal.

source: In the past, Perl configuration files were sometimes misused as an autoload mechanism to override code in existing packages. This is not necessary any more as OTRS 6 features a dedicated <literal>Autoload</literal> mechanism. Please see <filename>Kernel/Autoload/Test.pm</filename> for a demonstration on how to use this mechanism to add a method in an existing file.
hu: Régebben a Perl beállítófájlokat néha rossz célra használták egy automatikus betöltő mechanizmusként a meglévő csomagokban lévő kód felülírásához. Ez többé nem szükséges, mivel az OTRS 6 biztosít egy dedikált <literal>Autoload</literal> mechanizmust. Nézze meg a <filename>Kernel/Autoload/Test.pm</filename> fájlt annak bemutatásához, hogy hogyan kell használni ezt a mechanizmust egy metódus hozzáadásához egy meglévő fájlba.

source: Perldoc structure changed
hu: Megváltoztatott Perl-dokumentáció szerkezet

source: The structure of POD in Perl files was slightly improved and should be adapted in all files. POD is now also enforced to be syntactically correct.
hu: A Perl-fájlokban lévő POD szerkezete kis mértékben javítva lett, és alkalmazni kell az összes fájlban. A POD mostantól kényszerítve van, hogy szintaktikailag helyes legyen.

source: What was previously called <literal>SYNOPSIS</literal> is now changed to <literal>DESCRIPTION</literal>, as a synopsis typically provides a few popular code usage examples and not a description of the module itself. An additional synopsis can be provided, of course. Here's how an example:
hu: Amit korábban <literal>SYNOPSIS</literal> szakasznak hívtak, azt most <literal>DESCRIPTION</literal> névre változtatták, mivel a szinopszis jellemzően néhány népszerű kódhasználati példát biztosít, és nem magának a modulnak a leírását. Természetesen megadható további szinopszis. Itt egy példa arra, hogy hogyan:
