Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: Conditions can be quite complex and there can be "chained" conditions (linked with logical 'or' or 'and' operations). When coding for OTRS, you have to be aware of several situations.
hu: A feltételek meglehetősen összetettek lehetnek, és lehetnek „láncolt” feltételek is (logikai „és” vagy „vagy” operátorral összekapcsolva). Az OTRS kódolásakor tisztában kell lennie számos helyzettel.

source: Perl Best Practices says, that high precedence operators (<literal>&amp;&amp;</literal> and <literal>||</literal>) shouldn't mixed up with low precedence operators (<literal>and</literal> and <literal>or</literal>). To avoid confusion, we always use the high precedence operators.
hu: A bevált Perl gyakorlatok azt mondják, hogy a magas precedenciájú operátorokat (<literal>&amp;&amp;</literal> és <literal>||</literal>) nem kellene keverni az alacsony precedenciájú operátorokkal (<literal>and</literal> és <literal>or</literal>). A zűrzavar elkerülése érdekében mindig a magas precedenciájú operátorokat használjuk.

source: if ( $Condition1 && $Condition2 ) { ... } # instead of if ( $Condition and $Condition2 ) { ... }
hu: if ( $Condition1 && $Condition2 ) { ... } # e helyett if ( $Condition and $Condition2 ) { ... }

source: This means that you have to be aware of traps. Sometimes you need to use parenthesis to make clear what you want.
hu: Ez azt jelenti, hogy tisztában kell lennie a buktatókkal. Néha zárójeleket kell használnia, hogy világossá tegye, mit szeretne.

source: If you have long conditions (line is longer than 120 characters over all), you have to break it in several lines. And the start of the conditions is in a new line (not in the line of the <literal>if</literal>).
hu: Ha hosszú feltételei vannak (a sor 120 karakternél hosszabb), akkor több sorra kell tördelnie azt. Továbbá a feltételek kezdete egy új sorban van (nem az <literal>if</literal> sorában).

source: if ( $Condition1 && $Condition2 ) { ... } # instead of if ( $Condition1 && $Condition2 ) { ... }
hu: if ( $Feltétel1 && $Feltétel2 ) { ... } # e helyett: if ( $Feltétel1 && $Feltétel2 ) { ... }

source: Also note, that the right parenthesis is in a line on its own and the left curly bracket is also in a new line and with the same indentation as the <literal>if</literal>. The operators are at the beginning of a new line! The subsequent examples show how to do it...
hu: Jegyezze meg azt is, hogy a jobboldali zárójel egyedül áll a sorban, valamint a baloldali kapcsos zárójel szintén új sorban van, és ugyanolyan behúzással rendelkezik mint az <literal>if</literal>. Az operátorok egy új sor elején vannak! A következő példák bemutatják, hogyan kell ezt csinálni…

source: Postfix <literal>if</literal>
hu: Hátul álló <literal>if</literal>

source: Generally we use "postfix <literal>if</literal>" statements to reduce the number of levels. But we don't use it for multiline statements and is only allowed when involves return statements in functions or to end a loop or to go next iteration.
hu: Általánosan azért használunk „hátul álló <literal>if</literal>” utasításokat, hogy csökkentsük a szintek számát. De ne használjuk többsoros utasításoknál, és csak akkor megengedett, amikor visszatérési utasításokat hoz magával a függvény, vagy egy ciklus befejezéséhez, illetve a következő iterációra való ugráshoz.

source: This is correct:
hu: Ez helyes:

source: This is wrong:
hu: Ez hibás:

source: return $Self->{LogObject}->Log( Priority => 'error', Message => 'ItemID needed!', ) if !$ItemId;
hu: return $Self->{LogObject}->Log( Priority => 'error', Message => 'ItemID szükséges!', ) if !$ItemId;

source: This is less maintainable than this:
hu: Ez kevésbé karbantartható ennél:

source: Restrictions for the use of some Perl builtins
hu: Néhány beépített Perl szubrutin használatának korlátozása

source: Some builtin subroutines of Perl may not be used in every place:
hu: A Perl néhány beépített szubrutinját nem lehet használni semmilyen helyen:

source: Don't use <literal>die</literal> and <literal>exit</literal> in <filename>.pm</filename> files.
hu: Ne használja a <literal>die</literal> és <literal>exit</literal> szubrutinokat a <filename>.pm</filename> fájlokban.

source: Don't use the <literal>Dumper</literal> function in released files.
hu: Ne használja a <literal>Dumper</literal> függvényt a kiadott fájlokban.

source: Don't use <literal>print</literal> in <filename>.pm</filename> files.
hu: Ne használja a <literal>print</literal> utasítást a <filename>.pm</filename> fájlokban.

source: Don't use <literal>require</literal>, use <literal>Main::Require()</literal> instead.
hu: Ne használja a <literal>require</literal> kulcsszót, inkább használja a <literal>Main::Require()</literal> metódust.

source: Use the functions of the <literal>DateTimeObject</literal> instead of the builtin functions like <literal>time()</literal>, <literal>localtime()</literal>, etc.
hu: Használja a <literal>DateTimeObject</literal> függvényeit az olyan beépített függvények helyett, mint például a <literal>time()</literal>, <literal>localtime()</literal>, stb.

source: Regular Expressions
hu: Reguláris kifejezések

source: For regular expressions <emphasis>in the source code</emphasis>, we always use the <literal>m//</literal> operator with curly braces as delimiters. We also use the modifiers <literal>x</literal>, <literal>m</literal> and <literal>s</literal> by default. The <literal>x</literal> modifier allows you to comment your regex and use spaces to visually separate logical groups.
hu: A reguláris kifejezéseknél <emphasis>a forráskódban</emphasis> mindig kapcsos zárójelekkel használjuk az <literal>m//</literal> operátort elválasztóként. Használjuk az <literal>x</literal>, <literal>m</literal> és <literal>s</literal> módosítókat is alapértelmezetten. Az <literal>x</literal> módosító lehetővé teszi a reguláris kifejezések megjegyzéssel történő ellátását, és szóközök használatát a logikai csoportok megjelenésbeli elkülönítéséhez.

source: $Date =~ m{ \A \d{4} - \d{2} - \d{2} \z }xms $Date =~ m{ \A # beginning of the string \d{4} - # year \d{2} - # month [^\n] # everything but newline #.. }xms;
hu: $Date =~ m{ \A \d{4} - \d{2} - \d{2} \z }xms $Date =~ m{ \A # a szöveg kezdete \d{4} - # év \d{2} - # hónap [^\n] # minden, kivéve az új sort #.. }xms;

source: As the space no longer has a special meaning, you have to use a single character class to match a single space (<literal>[ ]</literal>). If you want to match any whitespace you can use <literal>\s</literal>.
hu: Mivel a szóköznek többé nincs különleges jelentése, ezért egy egyedüli karakterosztályt kell használnia egy egyedülálló szóköz illesztéséhez (<literal>[ ]</literal>). Ha akármennyi szóközre szeretne illeszteni, akkor azt a <literal>\s</literal> használatával teheti meg.

source: In the regex, the dot (<literal>.</literal>) includes the newline (whereas in regex without <literal>s</literal> modifier the dot means 'everything but newline'). If you want to match anything but newline, you have to use the negated single character class (<literal>[^\n]</literal>).
hu: A reguláris kifejezésben a pont (<literal>.</literal>) tartalmazza az új sort (minthogy az <literal>s</literal> módosító nélküli reguláris kifejezésben a pont azt jelenti, hogy „minden, kivéve az új sor”). Ha bármire szeretne illeszteni az új sort kivéve, akkor a tagadott egyedüli karakterosztályt kell használnia (<literal>[^\n]</literal>).

source: $Text =~ m{ Test [ ] # there must be a space between 'Test' and 'Regex' Regex }xms;
hu: $Text =~ m{ Teszt [ ] # itt szóköznek kell lennie a „Teszt” és a „Regex” között Regex }xms;

source: An exception to the convention above applies to all cases where regular expressions are not written statically in the code but instead are <emphasis>supplied by users</emphasis> in one form or another (for example via SysConfig or in a PostMaster filter configuration). Any evaluation of such a regular expression has to be done without any modifiers (e.g. <literal>$Variable =~ m{$Regex}</literal>) in order to match the expectation of (mostly inexperienced) users and also to be backwards compatible.
hu: A fenti megegyezésre vonatkozó kivétel minden olyan esetre vonatkozik, amikor a reguláris kifejezéseket nem írják statikusan a kódba, hanem a <emphasis>felhasználók adják meg</emphasis> egy űrlapon vagy máshol (például a rendszerbeállításokon vagy egy levelezési szűrő beállításán keresztül). Egy ilyen reguláris kifejezés bármely kiértékelését mindenféle módosító nélkül kell elvégezni (például <literal>$Variable =~ m{$Regex}</literal>) annak érdekében, hogy megfeleljen a (többnyire tapasztalatlan) felhasználók elvárásainak és visszafelé kompatibilis legyen.

source: If modifiers are strictly necessary for user supplied regular expressions, it is always possible to use embedded modifiers (e.g. <literal>(?:(?i)SmAlL oR lArGe)</literal>). For details, please see <ulink url="http://perldoc.perl.org/perlretut.html#Embedding-comments-and-modifiers-in-a-regular-expression">perlretut</ulink>.
hu: Ha a módosítók pontosan szükségesek a felhasználó által megadott reguláris kifejezésekhez, akkor mindig lehetséges beágyazott módosítók használata (például <literal>(?:(?i)KiCsI vAgY nAgY)</literal>). A részletekért nézze meg a <ulink url="http://perldoc.perl.org/perlretut.html#Embedding-comments-and-modifiers-in-a-regular-expression">perlretut</ulink> dokumentációját.

source: Usage of the <literal>r</literal> modifier is encouraged, e.g. if you need to extract part of a string into another variable. This modifier keeps the matched variable intact and instead provides the substitution result as a return value.
hu: Az <literal>r</literal> módosító használata erősen javasolt, például ha ki kell nyernie egy szöveg egy részét egy másik változóba. Ez a módosító érintetlenül hagyja az illesztett változót, ahelyett hogy a helyettesítés eredményt nyújtaná visszatérési értékként.

source: Example: Use this...
hu: Példa: használja ezt…

source: instead of this...
hu: ehelyett…

source: If you want to match for start and end of a <emphasis>string</emphasis>, you should generally use <literal>\A</literal> and <literal>\z</literal> instead of the more generic <literal>^</literal> and <literal>$</literal> unless you really need to match start or end of <emphasis>lines</emphasis> within a multiline string.
hu: Ha egy <emphasis>szöveg</emphasis> elejénél vagy végénél szeretne illeszteni, akkor általában az <literal>\A</literal> és a <literal>\z</literal> módosítót kell használnia az általánosabb <literal>^</literal> és <literal>$</literal> helyett, kivéve hogyha valóban a <emphasis>sorok</emphasis> elejére vagy végére szeretne illeszteni egy többsoros szövegen belül.

source: $Text =~ m{ \A # beginning of the string Content # some string \z # end of the string }xms; $MultilineText =~ m{ \A # beginning of the string .* (?: \n Content $ )+ # one or more lines containing the same string .* \z # end of the string }xms;
hu: $Text =~ m{ \A # a szöveg eleje Tartalom # valamilyen szöveg \z # a szöveg vége }xms; $MultilineText =~ m{ \A # a szöveg eleje .* (?: \n Tartalom $ )+ # egy vagy több sor, amely ugyanazt a szöveget tartalmazza .* \z # a szöveg vége }xms;

source: Usage of named capture groups is also encouraged, particularly for multi-matches. Named capture groups are easier to read/understand, prevent mix-ups when matching more than one capture group and allow extension without accidentally introducing bugs.
hu: Az elnevezett elfogási csoportok használata szintén erősen javasolt, különösen többszörös illesztéseknél. Az elnevezett elfogási csoportokat egyszerűbb olvasni és megérteni, megakadályozzák az összekeverést, amikor egynél több elfogási csoportot illeszt, és lehetővé teszik a kiterjesztést, anélkül hogy véletlenül programhibákat vinne a rendszerbe.

source: Naming
hu: Elnevezés

source: Names and comments are written in English. Variables, objects and methods must be descriptive nouns or noun phrases with the first letter set upper case (<ulink url="https://en.wikipedia.org/wiki/CamelCase">CamelCase</ulink>).
hu: A neveket és a megjegyzéseket angolul kell írni. A változókat, objektumokat és metódusokat leíró főnevekkel vagy főnévi igenevekkel írjuk úgy, hogy az első betű nagybetűs legyen (<ulink url="https://hu.wikipedia.org/wiki/CamelCase">CamelCase</ulink>).

source: Names should be as descriptive as possible. A reader should be able to say what is meant by a name without digging too deep into the code. E.g. use <literal>$ConfigItemID</literal> instead of <literal>$ID</literal>. Examples: <literal>@TicketIDs</literal>, <literal>$Output</literal>, <literal>StateSet()</literal>, etc.
hu: A neveknek annyira leírónak kell lenniük, amennyire csak lehetséges. Az olvasónak egy név alapján meg kell tudni mondania, hogy az mit jelent anélkül, hogy túl mélyre ásná magát a kódban. Például használja a <literal>$ConfigItemID</literal> nevet az <literal>$ID</literal> helyett. Példák: <literal>@TicketIDs</literal>, <literal>$Output</literal>, <literal>StateSet()</literal>, stb.

source: Declaration
hu: Deklaráció

source: If you have several variables, you can declare them in one line if they "belong together":
hu: Ha több változója van, akkor deklarálhatja azokat egyetlen sorban, ha azok „összetartoznak”:

source: Otherwise break it into separate lines:
hu: Egyébként tördelje azokat külön sorokba:

source: Do not set to <literal>undef</literal> or <literal>''</literal> in the declaration as this might hide mistakes in code.
hu: Ne állítson be <literal>undef</literal> vagy <literal>''</literal> kezdeti értéket a deklarációban, ugyanis ez elrejtheti a hibákat a kódban.

source: my $Variable = undef; # is the same as my $Variable;
hu: my $Variable = undef; # ugyanaz mint my $Variable;

source: You can set a variable to <literal>''</literal> if you want to concatenate strings:
hu: Akkor állíthat be egy változót <literal>''</literal> értékre, ha szövegeket szeretne összefűzni:

source: Otherwise you would get an "uninitialized" warning.
hu: Egyébként „előkészítetlen” figyelmeztetést kaphat.

source: Subroutines
hu: Szubrutinok

source: Handling of parameters
hu: Paraméterek kezelése

source: To fetch the parameters passed to subroutines, OTRS normally uses the hash <literal>%Param</literal> (not <literal>%Params</literal>). This leads to more readable code as every time we use <literal>%Param</literal> in the subroutine code we know it is the parameter hash passed to the subroutine.
hu: A szubrutinoknak átadott paraméterek lekéréséhez az OTRS normális esetben a <literal>%Param</literal> kivonatot használja (nem a <literal>%Params</literal> kivonatot). Ez jobban olvasható kódot eredményez, mivel minden esetben tudjuk, hogy amikor <literal>%Param</literal> kivonatot használjuk a szubrutin kódokban, akkor paraméterkivonat került átadásra a szubrutinnak.

source: Just in some exceptions a regular list of parameters should be used. So we want to avoid something like this:
hu: Csak néhány kivételnél kell a paraméterek szabályos listáját használni. Így el szeretnénk kerülni az ehhez hasonlókat:

source: We want to use this instead:
hu: Inkább ezt szeretnénk használni:

source: This has several advantages: We do not have to change the code in the subroutine when a new parameter should be passed, and calling a function with named parameters is much more readable.
hu: Ennek számos előnye van: nem kell megváltoztatnunk a kódot a szubrutinban, amikor egy új paramétert kell átadni, és egy elnevezett paraméterekkel rendelkező függvény hívása sokkal olvashatóbb.

source: Multiple named parameters
hu: Több elnevezett paraméter

source: If a function call requires more than one named parameter, split them into multiple lines:
hu: Ha egy függvényhívás egynél több elnevezett paramétert igényel, akkor tördelje azokat több sorba:

source: Instead of:
hu: E helyett:

source: <literal>return</literal> statements
hu: <literal>return</literal> utasítások

source: Subroutines have to have a <literal>return</literal> statement. The explicit <literal>return</literal> statement is preferred over the implicit way (result of last statement in subroutine) as this clarifies what the subroutine returns.
hu: A szubrutinoknak rendelkezniük kell egy <literal>return</literal> utasítással. Az explicit <literal>return</literal> utasítás előnyben részesített az implicit módszernél (az utolsó utasítás eredménye a szubrutinban), mivel ez tisztázza, hogy mit ad vissza a szubrutin.

source: sub TestSub { ... return; # return undef, but not the result of the last statement }
hu: sub TestSub { ... return; # undef visszaadása, de nem az utolsó utasítás eredménye }

source: Explicit return values
hu: Explicit visszatérési értékek

source: Explicit return values means that you should not have a <literal>return</literal> statement followed by a subroutine call.
hu: Az explicit visszatérési értékek azt jelentik, hogy nem kell egy <literal>return</literal> utasítást tenni egy szubrutinhívást követően.

source: The following example is better as this says explicitly what is returned. With the example above the reader doesn't know what the return value is as he might not know what <literal>Do()</literal> returns.
hu: A következő példa jobb, mivel ez explicit módon megmondja, hogy mi kerül visszaadásra. A fenti példával az olvasó nem tudja, hogy mi a visszatérési érték, mivel nem tudhatja, hogy a <literal>Do()</literal> mit ad vissza.

source: If you assign the result of a subroutine to a variable, a "good" variable name indicates what was returned:
hu: Ha egy szubrutin eredményét hozzárendeli egy változóhoz, akkor egy „jó” változónév jelzi, hogy mi lett visszaadva:

source: Packages
hu: Csomagok

source: <literal>use</literal> statements
hu: <literal>use</literal> utasítások

source: <literal>use strict</literal> and <literal>use warnings</literal> have to be the first two "use"s in a module. This is correct:
hu: A <literal>use strict</literal> és <literal>use warnings</literal> utasításoknak kell az első két „use”-nak lennie a modulban. Ez helyes:

source: Objects and their allocation
hu: Objektumok és azok lefoglalása

source: In OTRS many objects are available. But you should not use every object in every file to keep the frontend/backend separation.
hu: Az OTRS-ben sok objektum érhető el. De nem kell minden egyes objektumot használnia minden fájlban az előtétprogram/háttérprogram elválasztásának megtartásához.

source: Don't use the <literal>LayoutObject</literal> in core modules (<filename>Kernel/System</filename>).
hu: Ne használja a <literal>LayoutObject</literal> objektumot az alapmodulokban (<filename>Kernel/System</filename>).

source: Don't use the <literal>ParamObject</literal> in core modules (<filename>Kernel/System</filename>).
hu: Ne használja a <literal>ParamObject</literal> objektumot az alapmodulokban (<filename>Kernel/System</filename>).

source: Don't use the <literal>DBObject</literal> in frontend modules (<filename>Kernel/Modules</filename>).
hu: Ne használja a <literal>DBObject</literal> objektumot az előtétprogram modulokban (<filename>Kernel/Modules</filename>).

source: Writing good documentation
hu: Jó dokumentáció írása

source: Documenting backend modules
hu: Háttérprogram-modulok dokumentálása

source: 'NAME' section
hu: A <literal>NAME</literal> szakasz

source: This section should include the module name, ' - ' as separator and a brief description of the module purpose.
hu: Ennek a szakasznak kell tartalmaznia a modul nevét, a „ - ” karaktert elválasztóként és a modul céljának rövid leírását.

source: =head1 NAME Kernel::System::MyModule - Functions to read from and write to files
hu: =head1 NAME Kernel::System::MyModule - Függvények fájlból olvasáshoz és fájlba íráshoz

source: 'SYNOPSIS' section
hu: A <literal>SYNOPSIS</literal> szakasz

source: This section should give a short usage example of commonly used module functions.
hu: Ennek a szakasznak a gyakran használt modulfüggvények rövid használati példáját kell adnia.

source: Usage of this section is optional.
hu: A szakasz használata elhagyható.

source: =head1 SYNOPSIS my $Object = $Kernel::OM->Get('Kernel::System::MyModule'); Read data my $FileContent = $Object->Read( File => '/tmp/testfile', ); Write data $Object->Write( Content => 'my file content', File => '/tmp/testfile', );
hu: =head1 SYNOPSIS my $Object = $Kernel::OM->Get('Kernel::System::MyModule'); Adatolvasás my $FileContent = $Object->Read( File => '/tmp/testfile', ); Adatírás $Object->Write( Content => 'a fájl tartalma', File => '/tmp/testfile', );

source: 'DESCRIPTION' section
hu: A <literal>DESCRIPTION</literal> szakasz

source: This section should give more in-depth information about the module if deemed necessary (instead of having a long 'NAME' section).
hu: Ennek a szakasznak mélyebb információkat kell adnia a modullal kapcsolatban, ha szükségesnek tekintik (egy hosszú <literal>NAME</literal> szakasz megléte helyett).

source: =head1 DESCRIPTION This module does not only handle files. It is also able to: - brew coffee - turn lead into gold - bring world peace
hu: =head1 DESCRIPTION Ez a modul nem csak fájlokat kezel. Képes még továbbá: - kávét főzni - ólmot arannyá változtatni - elhozni a világbékét

source: 'PUBLIC INTERFACE' section
hu: A <literal>PUBLIC INTERFACE</literal> szakasz

source: This section marks the begin of all functions that are part of the API and therefore meant to be used by other modules.
hu: Ez a szakasz jelöli az összes olyan függvény kezdetét, amely az API része, és ennélfogva egyéb modulok használni kívánják.

source: 'PRIVATE FUNCTIONS' section
hu: A <literal>PRIVATE FUNCTIONS</literal> szakasz

source: This section marks the begin of private functions.
hu: Ez a szakasz jelzi a privát függvények kezdetét.

source: Functions below are not part of the API, to be used only within the module and therefore not considered stable.
hu: A lenti függvények nem részei az API-nak, csak a modulon belül használhatók, és ennélfogva nem tekinthetők stabilnak.

source: It is advisable to use this section whenever one or more private functions exist.
hu: Javasolt ennek a szakasznak a használata, amikor egy vagy több privát függvény létezik.

source: Documenting subroutines
hu: Szubrutinok dokumentálása

source: Subroutines should always be documented. The documentation contains a general description about what the subroutine does, a sample subroutine call and what the subroutine returns. It should be in this order. A sample documentation looks like this:
hu: A szubrutinokat mindig dokumentálni kell. A dokumentum tartalmaz egy általános leírást arról, hogy mit csinál a szubrutin, egy minta szubrutinhívást, és hogy mit ad vissza a szubrutin. Ezeknek ebben a sorrendben kell lenniük. Egy minta dokumentáció így néz ki:

source: =head2 LastTimeObjectChanged() Calculates the last time the object was changed. It returns a hash reference with information about the object and the time. my $Info = $Object->LastTimeObjectChanged( Param => 'Value', ); This returns something like: my $Info = { ConfigItemID => 1234, HistoryType => 'foo', LastTimeChanged => '08.10.2009', }; =cut
hu: =head2 LastTimeObjectChanged() Kiszámolja az objektum megváltoztatásának utolsó idejét. Egy kivonat hivatkozást ad vissza az objektummal és az idővel kapcsolatos információkkal. my $Info = $Object->LastTimeObjectChanged( Param => 'Value', ); Valami ilyesmit ad vissza: my $Info = { ConfigItemID => 1234, HistoryType => 'foo', LastTimeChanged => '08.10.2009', }; =cut

source: You can copy and paste a <literal>Data::Dumper</literal> output for the return values.
hu: Lemásolhat és beilleszthet egy <literal>Data::Dumper</literal> kimenetet a visszatérési értékekhez.
