Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # -- # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- ## no critic (Modules::RequireExplicitPackage) use strict; use warnings; use utf8; use vars (qw($Self)); use Kernel::GenericInterface::Debugger; use Kernel::GenericInterface::Operation::Test::Test; use Kernel::System::VariableCheck qw(:all); # Skip SSL certificate verification (RestoreDatabase must not be used in this test). $Kernel::OM->ObjectParamAdd( 'Kernel::System::UnitTest::Helper' => { SkipSSLVerify => 1, }, ); my $Helper = $Kernel::OM->Get('Kernel::System::UnitTest::Helper'); # get a random number my $RandomID = $Helper->GetRandomNumber(); # create a new user for current test my $UserLogin = $Helper->TestUserCreate( Groups => ['users'], ); my $Password = $UserLogin; my $UserID = $Kernel::OM->Get('Kernel::System::User')->UserLookup( UserLogin => $UserLogin, ); # set web-service name my $WebserviceName = '-Test-' . $RandomID; # create web-service object my $WebserviceObject = $Kernel::OM->Get('Kernel::System::GenericInterface::Webservice'); $Self->Is( 'Kernel::System::GenericInterface::Webservice', ref $WebserviceObject, "Create web service object", ); my $WebserviceID = $WebserviceObject->WebserviceAdd( Name => $WebserviceName, Config => { Debugger => { DebugThreshold => 'debug', }, Provider => { Transport => { Type => '', }, }, }, ValidID => 1, UserID => 1, ); $Self->True( $WebserviceID, "Added Web Service", ); # get remote host with some precautions for certain unit test systems my $Host = $Helper->GetTestHTTPHostname(); my $ConfigObject = $Kernel::OM->Get('Kernel::Config'); # prepare web-service config my $RemoteSystem = $ConfigObject->Get('HttpType') . '://' . $Host . '/' . $ConfigObject->Get('ScriptAlias') . '/nph-genericinterface.pl/WebserviceID/' . $WebserviceID; my $WebserviceConfig = { Description => 'Test for Ticket Connector using SOAP transport backend.', Debugger => { DebugThreshold => 'debug', TestMode => 1, }, Provider => { Transport => { Type => 'HTTP::SOAP', Config => { MaxLength => 10000000, NameSpace => 'http://otrs.org/SoapTestInterface/', Endpoint => $RemoteSystem, }, }, Operation => { Test => { Type => 'Test::Test', }, }, }, Requester => { Transport => { Type => 'HTTP::SOAP', Config => { NameSpace => 'http://otrs.org/SoapTestInterface/', Encoding => 'UTF-8', Endpoint => $RemoteSystem, }, }, Invoker => { Test => { Type => 'Test::TestSimple' , # requester needs to be Test::TestSimple in order to simulate a request to a remote system }, }, }, }; # update web-service with real config # the update is needed because we are using # the WebserviceID for the Endpoint in config my $WebserviceUpdate = $WebserviceObject->WebserviceUpdate( ID => $WebserviceID, Name => $WebserviceName, Config => $WebserviceConfig, ValidID => 1, UserID => $UserID, ); $Self->True( $WebserviceUpdate, "Updated Web Service $WebserviceID - $WebserviceName", ); # debugger object my $DebuggerObject = Kernel::GenericInterface::Debugger->new( DebuggerConfig => { DebugThreshold => 'debug', TestMode => 1, }, WebserviceID => $WebserviceID, CommunicationType => 'Provider', ); $Self->Is( ref $DebuggerObject, 'Kernel::GenericInterface::Debugger', 'DebuggerObject instantiate correctly', ); # define test cases my @Tests = ( { Name => 'Test case name', SuccessRequest => 1, # 1 or 0 RequestData => { # ... add test data }, ExpectedReturnLocalData => { Data => { # ... add expected local results }, Success => 1, # 1 or 0 }, ExpectedReturnRemoteData => { Data => { # ... add expected remote results }, Success => 1, # 1 or 0 }, Operation => 'Test', }, # ... add more test cases ); TEST: for my $Test (@Tests) { # create local object my $LocalObject = "Kernel::GenericInterface::Operation::Test::$Test->{Operation}"->new( DebuggerObject => $DebuggerObject, WebserviceID => $WebserviceID, ); $Self->Is( "Kernel::GenericInterface::Operation::Test::$Test->{Operation}", ref $LocalObject, "$Test->{Name} - Create local object", ); my %Auth = ( UserLogin => $UserLogin, Password => $Password, ); if ( IsHashRefWithData( $Test->{Auth} ) ) { %Auth = %{ $Test->{Auth} }; } # start requester with our web-service my $LocalResult = $LocalObject->Run( WebserviceID => $WebserviceID, Invoker => $Test->{Operation}, Data => { %Auth, %{ $Test->{RequestData} }, }, ); # check result $Self->Is( 'HASH', ref $LocalResult, "$Test->{Name} - Local result structure is valid", ); # create requester object my $RequesterObject = $Kernel::OM->Get('Kernel::GenericInterface::Requester'); $Self->Is( 'Kernel::GenericInterface::Requester', ref $RequesterObject, "$Test->{Name} - Create requester object", ); # start requester with our web-service my $RequesterResult = $RequesterObject->Run( WebserviceID => $WebserviceID, Invoker => $Test->{Operation}, Data => { %Auth, %{ $Test->{RequestData} }, }, ); # check result $Self->Is( 'HASH', ref $RequesterResult, "$Test->{Name} - Requester result structure is valid", ); $Self->Is( $RequesterResult->{Success}, $Test->{SuccessRequest}, "$Test->{Name} - Requester successful result", ); # ... add tests for the results } # delete web service my $WebserviceDelete = $WebserviceObject->WebserviceDelete( ID => $WebserviceID, UserID => $UserID, ); $Self->True( $WebserviceDelete, "Deleted Web Service $WebserviceID", ); # also delete any other added data during the this test, since RestoreDatabase must not be used. 1;
hu: # -- # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- ## no critic (Modules::RequireExplicitPackage) use strict; use warnings; use utf8; use vars (qw($Self)); use Kernel::GenericInterface::Debugger; use Kernel::GenericInterface::Operation::Test::Test; use Kernel::System::VariableCheck qw(:all); # SSL-tanúsítvány ellenőrzésének kihagyása (a RestoreDatabase használata tilos ebben a tesztben). $Kernel::OM->ObjectParamAdd( 'Kernel::System::UnitTest::Helper' => { SkipSSLVerify => 1, }, ); my $Helper = $Kernel::OM->Get('Kernel::System::UnitTest::Helper'); # véletlen szám kérése my $RandomID = $Helper->GetRandomNumber(); # új felhasználó létrehozása a jelenlegi teszthez my $UserLogin = $Helper->TestUserCreate( Groups => ['users'], ); my $Password = $UserLogin; my $UserID = $Kernel::OM->Get('Kernel::System::User')->UserLookup( UserLogin => $UserLogin, ); # webszolgáltatás nevének beállítása my $WebserviceName = '-Test-' . $RandomID; # webszolgáltatás objektum létrehozása my $WebserviceObject = $Kernel::OM->Get('Kernel::System::GenericInterface::Webservice'); $Self->Is( 'Kernel::System::GenericInterface::Webservice', ref $WebserviceObject, "Webszolgáltatás objektum létrehozása", ); my $WebserviceID = $WebserviceObject->WebserviceAdd( Name => $WebserviceName, Config => { Debugger => { DebugThreshold => 'debug', }, Provider => { Transport => { Type => '', }, }, }, ValidID => 1, UserID => 1, ); $Self->True( $WebserviceID, "Webszolgáltatás hozzáadása", ); # távoli gép lekérése néhány óvintézkedéssel bizonyos egységteszt rendszereknél my $Host = $Helper->GetTestHTTPHostname(); my $ConfigObject = $Kernel::OM->Get('Kernel::Config'); # webszolgáltatás beállításának előkészítése my $RemoteSystem = $ConfigObject->Get('HttpType') . '://' . $Host . '/' . $ConfigObject->Get('ScriptAlias') . '/nph-genericinterface.pl/WebserviceID/' . $WebserviceID; my $WebserviceConfig = { Description => 'Teszt a SOAP-átviteli háttérprogramot használó jegycsatlakozóhoz.', Debugger => { DebugThreshold => 'debug', TestMode => 1, }, Provider => { Transport => { Type => 'HTTP::SOAP', Config => { MaxLength => 10000000, NameSpace => 'http://otrs.org/SoapTestInterface/', Endpoint => $RemoteSystem, }, }, Operation => { Test => { Type => 'Test::Test', }, }, }, Requester => { Transport => { Type => 'HTTP::SOAP', Config => { NameSpace => 'http://otrs.org/SoapTestInterface/', Encoding => 'UTF-8', Endpoint => $RemoteSystem, }, }, Invoker => { Test => { Type => 'Test::TestSimple' , # a meghívónak Test::TestSimple típusúnak kell lennie azért, # hogy egy kérést szimuláljon egy távoli rendszerhez }, }, }, }; # webszolgáltatás frissítése valódi beállítással # a frissítés szükséges, mert a webszolgáltatás-azonosítót # használjuk a végponthoz a beállításban my $WebserviceUpdate = $WebserviceObject->WebserviceUpdate( ID => $WebserviceID, Name => $WebserviceName, Config => $WebserviceConfig, ValidID => 1, UserID => $UserID, ); $Self->True( $WebserviceUpdate, "A webszolgáltatás frissítve: $WebserviceID - $WebserviceName", ); # hibakereső objektum my $DebuggerObject = Kernel::GenericInterface::Debugger->new( DebuggerConfig => { DebugThreshold => 'debug', TestMode => 1, }, WebserviceID => $WebserviceID, CommunicationType => 'Provider', ); $Self->Is( ref $DebuggerObject, 'Kernel::GenericInterface::Debugger', 'A hibakereső-objektum helyesen lett példányosítva', ); # tesztesetek meghatározása my @Tests = ( { Name => 'Teszteset neve', SuccessRequest => 1, # 1 vagy 0 RequestData => { # ...és a tesztadatok }, ExpectedReturnLocalData => { Data => { # ...elvárt helyi eredmények hozzáadása }, Success => 1, # 1 vagy 0 }, ExpectedReturnRemoteData => { Data => { # ...elvárt távoli eredmények hozzáadása }, Success => 1, # 1 vagy 0 }, Operation => 'Test', }, # ...további tesztesetek hozzáadása ); TEST: for my $Test (@Tests) { # helyi objektum létrehozása my $LocalObject = "Kernel::GenericInterface::Operation::Test::$Test->{Operation}"->new( DebuggerObject => $DebuggerObject, WebserviceID => $WebserviceID, ); $Self->Is( "Kernel::GenericInterface::Operation::Test::$Test->{Operation}", ref $LocalObject, "$Test->{Name} - Helyi objektum létrehozása", ); my %Auth = ( UserLogin => $UserLogin, Password => $Password, ); if ( IsHashRefWithData( $Test->{Auth} ) ) { %Auth = %{ $Test->{Auth} }; } # kérő indítása a webszolgáltatásunkkal my $LocalResult = $LocalObject->Run( WebserviceID => $WebserviceID, Invoker => $Test->{Operation}, Data => { %Auth, %{ $Test->{RequestData} }, }, ); # eredmény ellenőrzése $Self->Is( 'HASH', ref $LocalResult, "$Test->{Name} - A helyi eredményszerkezet helyes", ); # kérő objektum létrehozása my $RequesterObject = $Kernel::OM->Get('Kernel::GenericInterface::Requester'); $Self->Is( 'Kernel::GenericInterface::Requester', ref $RequesterObject, "$Test->{Name} - Kérő objektum létrehozása", ); # kérő indítása a webszolgáltatásunkkal my $RequesterResult = $RequesterObject->Run( WebserviceID => $WebserviceID, Invoker => $Test->{Operation}, Data => { %Auth, %{ $Test->{RequestData} }, }, ); # eredmény ellenőrzése $Self->Is( 'HASH', ref $RequesterResult, "$Test->{Name} - A kérő eredményszerkezete helyes", ); $Self->Is( $RequesterResult->{Success}, $Test->{SuccessRequest}, "$Test->{Name} - A kérő sikeres eredményt adott", ); # ...tesztek hozzáadása az eredményekhez } # webszolgáltatás törlése my $WebserviceDelete = $WebserviceObject->WebserviceDelete( ID => $WebserviceID, UserID => $UserID, ); $Self->True( $WebserviceDelete, "Webszolgáltatás törölve: $WebserviceID", ); # törölni kell a teszt alatt minden egyéb hozzáadott adatot, mivel a RestoreDatabase használata tilos. 1;

source: WSDL Extension Example
hu: WSDL-kiterjesztés példa

source: WSDL files contains the definitions of the web services and its operations for SOAP messages, in case we will extend <filename>development/webservices/GenericTickeConnectorSOAP.wsdl</filename> in some places:
hu: A WSDL-fájlok tartalmazzák a webszolgáltatás és a SOAP-üzenethez tartozó műveleteinek meghatározásait abban az esetben, a kibővítjük a <filename>development/webservices/GenericTickeConnectorSOAP.wsdl</filename> fájlt néhány helyen:

source: Port Type:
hu: Port típusa:

source: Binding:
hu: Kötés:

source: Type:
hu: Típus:

source: Message:
hu: Üzenet:

source: WADL Extension Example
hu: WADL-kiterjesztés példa

source: WADL files contains the definitions of the web services and its operations for REST interface, add a new resource to <filename>development/webservices/GenericTickeConnectorREST.wadl</filename>.
hu: A WADL-fájlok tartalmazzák a webszolgáltatás és a REST-felülethez tartozó műveleteinek meghatározásait. Adjon hozzá egy új erőforrást a <filename>development/webservices/GenericTickeConnectorREST.wadl</filename>fájlhoz.

source: Web Service SOAP Extension Example
hu: Webszolgáltatás SOAP-kiterjesztés példa

source: Web services can be imported into OTRS by a YAML with with a predefined structure in this case we will extend <filename>development/webservices/GenericTickeConnectorSOAP.yml</filename> for a SOAP web service.
hu: A webszolgáltatások importálhatók az OTRS-be egy előre meghatározott szerkezettel rendelkező YAML-fájllal. Ebben az esetben a <filename>development/webservices/GenericTickeConnectorSOAP.yml</filename> fájlt bővítjük ki egy SOAP webszolgáltatáshoz.

source: Provider: Operation: # ... Test: Description: This is only a test MappingInbound: {} MappingOutbound: {} Type: Test::Test
hu: Provider: Operation: # ... Test: Description: Ez csak egy teszt MappingInbound: {} MappingOutbound: {} Type: Test::Test

source: Web Service REST Extension Example
hu: Webszolgáltatás REST-kiterjesztés példa

source: Web services can be imported into OTRS by a YAML with with a predefined structure in this case we will extend <filename>development/webservices/GenericTickeConnectorREST.yml</filename> for a REST web service.
hu: A webszolgáltatások importálhatók az OTRS-be egy előre meghatározott szerkezettel rendelkező YAML-fájllal. Ebben az esetben a <filename>development/webservices/GenericTickeConnectorREST.yml</filename> fájlt bővítjük ki egy REST webszolgáltatáshoz.

source: Provider: Operation: # ... Test: Description: This is only a test MappingInbound: {} MappingOutbound: {} Type: Test::Test # ... Transport: Config: # ... RouteOperationMapping: # .. Test: RequestMethod: - GET Route: /Test
hu: Provider: Operation: # ... Test: Description: Ez csak egy teszt MappingInbound: {} MappingOutbound: {} Type: Test::Test # ... Transport: Config: # ... RouteOperationMapping: # .. Test: RequestMethod: - GET Route: /Test

source: Network Transport
hu: Hálózati átvitel

source: The network transport is used as method to send and receive information between OTRS and a Remote System. The Generic Interface configuration allows a web service to use different network transport modules for provider and requester, but the most common scenario is that the same transport module is used for both.
hu: A hálózati átvitelt használják az információk küldésének és fogadásának módszereként az OTRS és egy távoli rendszer között. Az általános felület beállításai lehetővé teszik egy webszolgáltatásnak, hogy különböző hálózati átviteli modulokat használjon a szolgáltatónál és a kérelmezőnél, de a leggyakoribb forgatókönyv az, hogy ugyanazt az átviteli modult használják mindkettőnél.

source: <emphasis>OTRS as provider:</emphasis>
hu: <emphasis>OTRS mint szolgáltató:</emphasis>

source: OTRS uses the network transport modules to get the data from the Remote System and the operation to be executed. After the operation is performed OTRS uses them again to send the response back to the Remote System.
hu: Az OTRS arra használja a hálózati átviteli modulokat, hogy lekérje az adatokat a távoli rendszertől, valamint lekérje a végrehajtandó műveleteket. A művelet végrehajtása után az OTRS ismét azokat használja a válasz visszaküldéséhez a távoli rendszernek.

source: <emphasis>OTRS as requester:</emphasis>
hu: <emphasis>OTRS mint kérelmező:</emphasis>

source: OTRS uses the network transport modules to send petitions to the Remote System to perform a remote action along with the required data. OTRS waits for the Remote System response and send it back to the Requester module.
hu: Az OTRS arra használja a hálózati átviteli modulokat, hogy kérelmeket küldjön a távoli rendszernek egy távoli művelet végrehajtásához a szükséges adatok mellett. Az OTRS várakozik a távoli rendszer válaszára, és visszaküldi azt a kérelmező modulnak.

source: In both ways network transport modules deal with the data in the Remote System format. It is not recommended to do any data transformation in this modules, as the Mapping layer is the responsible to perform any data transformation needed during the communication. An exception of this is the data conversion that is required specifically by for the transport e.g. XML or JSON from / to Perl conversions.
hu: Mindkét irányban a hálózati átviteli modulok foglalkoznak a távoli rendszer formátumában lévő adatokkal. Nem ajánlott semmilyen adatátalakítás végrehajtása sem ezekben a modulokban, mivel a leképező réteg felelős a kommunikáció során szükséges bármilyen adatátalakítás végrehajtásáért. Egy kivétel erre az olyan adatátalakítás, amely kifejezetten az átvitelnél szükséges, például XML vagy JSON és Perl átalakítások.

source: Transport backend
hu: Átviteli háttérprogram

source: Next we will show how to develop a new transport backend. Each transport backend has to implement these subroutines:
hu: Ezután be fogjuk mutatni, hogy hogyan kell egy új átviteli háttérprogramot kifejleszteni. Minden egyes átviteli háttérprogramnak meg kell valósítania ezeket a szubrutinokat:

source: We should implement each one of this methods in order to be able to communicate correctly with a Remote System in both ways. All network transport backends are handled by the transport module (<filename>Kernel/GenericInterface/Transport.pm</filename>).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk mindkét irányban helyesen kommunikálni egy távoli rendszerrel. Az összes átviteli háttérprogramot az átviteli modul kezeli (<filename>Kernel/GenericInterface/Transport.pm</filename>).

source: Currently Generic Interface implements the HTTP SOAP and HTTP REST transports. If the planned web service can use HTTP SOAP or HTTP SOAP there is no need to create a new network transport module, instead we recommend to take a look into HTTP SOAP or HTTP REST configurations to check their settings and how it can be tuned according to the remote system.
hu: Jelenleg az általános felület megvalósítja a HTTP SOAP és a HTTP REST átviteleket. Ha a tervezett webszolgáltatás használhat HTTP SOAP vagy HTTP SOAP átviteleket, akkor nincs szükség egy új hálózati átviteli modul létrehozására, hanem ahelyett azt ajánljuk, hogy vessen egy pillantást a HTTP SOAP vagy HTTP REST konfigurációira a beállításaik ellenőrzéséhez, valamint hogy hogyan hangolhatók a távoli rendszernek megfelelően.

source: In case that the provided network transports does not match the web service needs, then in this section a sample network transport module is shown and each subroutine is explained. Normally transport modules uses CPAN modules as backends. For example the HTTP SOAP transport modules uses <literal>SOAP::Lite</literal> module as backend.
hu: Abban az esetben, ha a biztosított hálózati átvitelek nem illeszkednek a webszolgáltatás igényeire, akkor ebben a szakaszban egy minta hálózati átviteli modul van bemutatva, és minden egyes szubrutin elmagyarázásra kerül. Normális esetben az átviteli modulok CPAN modulokat használnak háttérprogramokként. Például a HTTP SOAP átviteli modulok a <literal>SOAP::Lite</literal> modult használják háttérprogramként.

source: For this example a custom package is used to return the data without doing a real network request to a Remote System, instead this custom module acts as a loop-back interface.
hu: Ennél a példánál egy egyéni csomagot használnak az adatok visszaadásához anélkül, hogy valódi hálózati kérést intéznének egy távoli rendszerhez, ehelyett ez az egyéni modul működik visszacsatolási felületként.

source: # -- # Kernel/GenericInterface/Transport/HTTP/Test.pm - GenericInterface network transport interface for testing # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Transport::HTTP::Test; use strict; use warnings; use HTTP::Request::Common; use LWP::UserAgent; use LWP::Protocol; # prevent 'Used once' warning for Kernel::OM use Kernel::System::ObjectManager; our $ObjectManagerDisabled = 1;
hu: # -- # Kernel/GenericInterface/Transport/HTTP/Test.pm - általános felület hálózati átviteli felület teszteléshez # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::GenericInterface::Transport::HTTP::Test; use strict; use warnings; use HTTP::Request::Common; use LWP::UserAgent; use LWP::Protocol; # A „Used once” figyelmeztetés megakadályozása a Kernel::OM objektumnál use Kernel::System::ObjectManager; our $ObjectManagerDisabled = 1;

source: This is common header that can be found in common OTRS modules. The class/package name is declared via the <literal>package</literal> keyword. Transports can not be instantiated by the Object Manager.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a <literal>package</literal> kulcsszón keresztül van deklarálva. Az átvitelek nem példányosíthatók az objektumkezelővel.

source: sub new { my ( $Type, %Param ) = @_; my $Self = {}; bless( $Self, $Type ); for my $Needed (qw( DebuggerObject TransportConfig)) { $Self->{$Needed} = $Param{$Needed} || return { Success => 0, ErrorMessage => "Got no $Needed!" }; } return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; my $Self = {}; bless( $Self, $Type ); for my $Needed (qw( DebuggerObject TransportConfig)) { $Self->{$Needed} = $Param{$Needed} || return { Success => 0, ErrorMessage => "Nincs $Needed!" }; } return $Self; }

source: sub ProviderProcessRequest { my ( $Self, %Param ) = @_; if ( $Self->{TransportConfig}->{Config}->{Fail} ) { return { Success => 0, ErrorMessage => "HTTP status code: 500", Data => {}, }; } my $ParamObject = $Kernel::OM->Get('Kernel::System::Web::Request'); my %Result; for my $ParamName ( $ParamObject->GetParamNames() ) { $Result{$ParamName} = $ParamObject->GetParam( Param => $ParamName ); } # special handling for empty post request if ( scalar keys %Result == 1 && exists $Result{POSTDATA} && !$Result{POSTDATA} ) { %Result = (); } if ( !%Result ) { return $Self->{DebuggerObject}->Error( Summary => 'No request data found.', ); } return { Success => 1, Data => \%Result, Operation => 'test_operation', }; }
hu: sub ProviderProcessRequest { my ( $Self, %Param ) = @_; if ( $Self->{TransportConfig}->{Config}->{Fail} ) { return { Success => 0, ErrorMessage => "HTTP állapotkód: 500", Data => {}, }; } my $ParamObject = $Kernel::OM->Get('Kernel::System::Web::Request'); my %Result; for my $ParamName ( $ParamObject->GetParamNames() ) { $Result{$ParamName} = $ParamObject->GetParam( Param => $ParamName ); } # különleges kezelés az üres POST kérésnél if ( scalar keys %Result == 1 && exists $Result{POSTDATA} && !$Result{POSTDATA} ) { %Result = (); } if ( !%Result ) { return $Self->{DebuggerObject}->Error( Summary => 'Nem található kért adat.', ); } return { Success => 1, Data => \%Result, Operation => 'test_operation', }; }
