Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # -- # Kernel/System/HelloWorld.pm - core module # Copyright (C) (year) (name of author) (email of author) # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::HelloWorld; use strict; use warnings; # list your object dependencies (e.g. Kernel::System::DB) here our @ObjectDependencies = ( # 'Kernel::System::DB', ); =head1 NAME HelloWorld - Little "Hello World" module =head1 DESCRIPTION Little OTRS module that displays the text 'Hello World' when called up. =head2 new() Create an object. Do not use it directly, instead use: my $HelloWorldObject = $Kernel::OM->Get('Kernel::System::HelloWorld'); =cut sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless ($Self, $Type); return $Self; } =head2 GetHelloWorldText() Return the "Hello World" text. my $HelloWorldText = $HelloWorldObject->GetHelloWorldText(); =cut sub GetHelloWorldText { my ( $Self, %Param ) = @_; # Get the DBObject from the central object manager # my $DBObject = $Kernel::OM->Get('Kernel::System::DB'); my $HelloWorld = $Self->_FormatHelloWorldText( String => 'Hello World', ); return $HelloWorld; } =begin Internal: =cut =head2 _FormatHelloWorldText() Format "Hello World" text to uppercase my $HelloWorld = $Self->_FormatHelloWorldText( String => 'Hello World', ); sub _FormatHelloWorldText{ my ( $Self, %Param ) = @_; my $HelloWorld = uc $Param{String}; return $HelloWorld; } =end Internal: 1;
hu: # -- # Kernel/System/HelloWorld.pm - alapmodul # Copyright (C) (év) (szerző neve) (szerző e-mail címe) # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::HelloWorld; use strict; use warnings; # sorolja fel az objektumfüggőségeket (például Kernel::System::DB) itt our @ObjectDependencies = ( # 'Kernel::System::DB', ); =head1 NAME HelloWorld - Kicsi „Helló, Világ” modul =head1 DESCRIPTION Kicsi OTRS modul, amely a „Helló, Világ” szöveget jeleníti meg, ha meghívják. =head2 new() Egy objektum létrehozása. Ne használja közvetlenül, inkább így használja: my $HelloWorldObject = $Kernel::OM->Get('Kernel::System::HelloWorld'); =cut sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumnak my $Self = {}; bless ($Self, $Type); return $Self; } =head2 GetHelloWorldText() A „Helló, Világ” szöveg visszaadása. my $HelloWorldText = $HelloWorldObject->GetHelloWorldText(); =cut sub GetHelloWorldText { my ( $Self, %Param ) = @_; # A DBObject lekérése a központi objektumkezelőtől # my $DBObject = $Kernel::OM->Get('Kernel::System::DB'); my $HelloWorld = $Self->_FormatHelloWorldText( String => 'Helló, Világ', ); return $HelloWorld; } =begin Internal: =cut =head2 _FormatHelloWorldText() A „Helló, Világ” szöveg nagybetűsre formázásra my $HelloWorld = $Self->_FormatHelloWorldText( String => 'Helló, Világ', ); sub _FormatHelloWorldText{ my ( $Self, %Param ) = @_; my $HelloWorld = uc $Param{String}; return $HelloWorld; } =end Internal: 1;

source: Template File
hu: Sablonfájl

source: The last thing missing before the new module can run is the relevant HTML template. Thus, we create the following file:
hu: Az utolsó hiányzó dolog, mielőtt az új modul futtatható lenne, a hozzá tartozó HTML sablon. Ezért hozzuk létre az alábbi fájlt:

source: # -- # Kernel/Output/HTML/Templates/Standard/AgentHelloWorld.tt - overview # Copyright (C) (year) (name of author) (email of author) # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- <h1>[% Translate("Overview") | html %]: [% Translate("HelloWorld") %]</h1> <p> [% Data.HelloWorldText | Translate() | html %] </p>
hu: # -- # Kernel/Output/HTML/Templates/Standard/AgentHelloWorld.tt - áttekintő # Copyright (C) (év) (szerző neve) (szerző e-mail címe) # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- <h1>[% Translate("Overview") | html %]: [% Translate("HelloWorld") %]</h1> <p> [% Data.HelloWorldText | Translate() | html %] </p>

source: The module is working now and displays the text 'Hello World' when called.
hu: A modul most már működik, és a meghívásakor megjeleníti a „Hello World” szöveget.

source: Language File
hu: Nyelvi fájl

source: If the text 'Hello World!' is to be translated into for instance German, you can create a translation file for this language in <filename>HelloWorld/Kernel/Language/de_AgentHelloWorld.pm</filename>. Example:
hu: Ha a „Hello World!” szöveget le kell fordítani például magyarra, akkor létrehozhat egy fordítási fájlt ehhez a nyelvhez a <filename>HelloWorld/Kernel/Language/hu_AgentHelloWorld.pm</filename> helyre. Példa:

source: package Kernel::Language::de_AgentHelloWorld; use strict; use warnings; sub Data { my $Self = shift; $Self->{Translation}->{'Hello World!'} = 'Hallo Welt!'; return 1; } 1;
hu: package Kernel::Language::hu_AgentHelloWorld; use strict; use warnings; sub Data { my $Self = shift; $Self->{Translation}->{'Hello World!'} = 'Helló, Világ!'; return 1; } 1;

source: Summary
hu: Összefoglaló

source: The example given above shows that it is not too difficult to write a new module for OTRS. It is important, though, to make sure that the module and file name are unique and thus do not interfere with the framework or other expansion modules. When a module is finished, an OPM package must be generated from it (see chapter <link linkend="package-building">Package Building</link>).
hu: A fent megadott példa azt mutatja be, hogy nem túl bonyolult egy új modult írni az OTRS-hez. Fontos azonban meggyőződni arról, hogy a modul és a fájlnév egyedi legyen, és ennélfogva ne ütközzenek a keretrendszerrel vagy egyéb kiterjesztő modulokkal. Amikor egy modul elkészült, akkor egy OPM csomagot kell előállítani belőle (lásd a <link linkend="package-building">csomagkészítés</link> fejezetet).

source: Agent Authentication Module
hu: Ügyintézői hitelesítő modul

source: There are several agent authentication modules (DB, LDAP and HTTPBasicAuth) which come with the OTRS framework. It is also possible to develop your own authentication modules. The agent authentication modules are located under <filename>Kernel/System/Auth/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of a simple agent auth module. Save it under <filename>Kernel/System/Auth/Simple.pm</filename>. You just need 3 functions: <code>new()</code>, <code>GetOption()</code> and <code>Auth()</code>. Return the uid, then the authentication is ok.
hu: Számos ügyintézői hitelesítő modul létezik (DB, LDAP és HTTPBasicAuth), amelyek az OTRS keretrendszerrel érkeznek. Lehetőség van saját hitelesítő modulok fejlesztésére is. Az ügyintézői hitelesítő modulok a <filename>Kernel/System/Auth/*.pm</filename> alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. Ezt követően egy egyszerű ügyintézői hitelesítő modul példája található. Mentse el a <filename>Kernel/System/Auth/Simple.pm</filename> helyre. Mindössze három függvényre van szüksége: <code>new()</code>, <code>GetOption()</code> és <code>Auth()</code>. Adja vissza az uid-t, és ezután a hitelesítés rendben van.

source: Code Example
hu: Kódpélda

source: The interface class is called <literal>Kernel::System::Auth</literal>. The example agent authentication may be called <literal>Kernel::System::Auth::CustomAuth</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::Auth</literal>. A példa ügyintézői hitelesítés hívható <literal>Kernel::System::Auth::CustomAuth</literal> néven. Lent találhat egy példát.

source: # -- # Kernel/System/Auth/CustomAuth.pm - provides the CustomAuth authentication # based on Martin Edenhofer's Kernel::System::Auth::DB # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # ID: CustomAuth.pm,v 1.1 2010/05/10 15:30:34 fk Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Auth::CustomAuth; use strict; use warnings; use Authen::CustomAuth; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for (qw(LogObject ConfigObject DBObject)) { $Self->{$_} = $Param{$_} || die "No $_!"; } # Debug 0=off 1=on $Self->{Debug} = 0; # get config $Self->{Die} = $Self->{ConfigObject}->Get( 'AuthModule::CustomAuth::Die' . $Param{Count} ); # get user table $Self->{CustomAuthHost} = $Self->{ConfigObject}->Get( 'AuthModule::CustomAuth::Host' . $Param{Count} ) || die "Need AuthModule::CustomAuth::Host$Param{Count}."; $Self->{CustomAuthSecret} = $Self->{ConfigObject}->Get( 'AuthModule::CustomAuth::Password' . $Param{Count} ) || die "Need AuthModule::CustomAuth::Password$Param{Count}."; return $Self; } sub GetOption { my ( $Self, %Param ) = @_; # check needed stuff if ( !$Param{What} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need What!" ); return; } # module options my %Option = ( PreAuth => 0, ); # return option return $Option{ $Param{What} }; } sub Auth { my ( $Self, %Param ) = @_; # check needed stuff if ( !$Param{User} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need User!" ); return; } # get params my $User = $Param{User} || ''; my $Pw = $Param{Pw} || ''; my $RemoteAddr = $ENV{REMOTE_ADDR} || 'Got no REMOTE_ADDR env!'; my $UserID = ''; my $GetPw = ''; # just in case for debug! if ( $Self->{Debug} > 0 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: '$User' tried to authenticate with Pw: '$Pw' ($RemoteAddr)", ); } # just a note if ( !$User ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "No User given!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # just a note if ( !$Pw ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: $User authentication without Pw!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # Create a RADIUS object my $CustomAuth = Authen::CustomAuth->new( Host => $Self->{CustomAuthHost}, Secret => $Self->{CustomAuthecret}, ); if ( !$CustomAuth ) { if ( $Self->{Die} ) { die "Can't connect to $Self->{CustomAuthHost}: $@"; } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Can't connect to $Self->{CustomAuthHost}: $@", ); return; } } my $AuthResult = $CustomAuth->check_pwd( $User, $Pw ); # login note if ( defined($AuthResult) && $AuthResult == 1 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: $User authentication ok (REMOTE_ADDR: $RemoteAddr).", ); return $User; } # just a note else { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: $User authentication with wrong Pw!!! (REMOTE_ADDR: $RemoteAddr)" ); return; } } 1;
hu: # -- # Kernel/System/Auth/CustomAuth.pm - a CustomAuth hitelesítést biztosítja # Martin Edenhofer Kernel::System::Auth::DB osztálya alapján # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # ID: CustomAuth.pm,v 1.1 2010/05/10 15:30:34 fk Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Auth::CustomAuth; use strict; use warnings; use Authen::CustomAuth; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for (qw(LogObject ConfigObject DBObject)) { $Self->{$_} = $Param{$_} || die "Nincs $_!"; } # Hibakeresés: 0=ki 1=be $Self->{Debug} = 0; # beállítás lekérése $Self->{Die} = $Self->{ConfigObject}->Get( 'AuthModule::CustomAuth::Die' . $Param{Count} ); # felhasználótábla lekérése $Self->{CustomAuthHost} = $Self->{ConfigObject}->Get( 'AuthModule::CustomAuth::Host' . $Param{Count} ) || die "Szükséges: AuthModule::CustomAuth::Host$Param{Count}."; $Self->{CustomAuthSecret} = $Self->{ConfigObject}->Get( 'AuthModule::CustomAuth::Password' . $Param{Count} ) || die "Szükséges: AuthModule::CustomAuth::Password$Param{Count}."; return $Self; } sub GetOption { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése if ( !$Param{What} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Mi szükséges!" ); return; } # modulbeállítások my %Option = ( PreAuth => 0, ); # beállítás visszaadása return $Option{ $Param{What} }; } sub Auth { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése if ( !$Param{User} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Felhasználó szükséges!" ); return; } # paraméterek lekérése my $User = $Param{User} || ''; my $Pw = $Param{Pw} || ''; my $RemoteAddr = $ENV{REMOTE_ADDR} || 'Nincs REMOTE_ADDR környezet!'; my $UserID = ''; my $GetPw = ''; # csak hibakeresés esetén! if ( $Self->{Debug} > 0 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: „$User” megpróbált hitelesíteni ezzel a jelszóval: „$Pw” ($RemoteAddr)", ); } # csak egy jegyzet if ( !$User ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Nincs felhasználó megadva!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # csak egy jegyzet if ( !$Pw ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: $User hitelesítés jelszó nélkül!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # Egy RADIUS objektum létrehozása my $CustomAuth = Authen::CustomAuth->new( Host => $Self->{CustomAuthHost}, Secret => $Self->{CustomAuthecret}, ); if ( !$CustomAuth ) { if ( $Self->{Die} ) { die "Nem lehet kapcsolódni ehhez: $Self->{CustomAuthHost}: $@"; } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Nem lehet kapcsolódni ehhez: $Self->{CustomAuthHost}: $@", ); return; } } my $AuthResult = $CustomAuth->check_pwd( $User, $Pw ); # bejelentkezési jegyzet if ( defined($AuthResult) && $AuthResult == 1 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: $User hitelesítése rendben (REMOTE_ADDR: $RemoteAddr).", ); return $User; } # csak egy jegyzet else { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: $User hitelesítése rossz jelszóval!!! (REMOTE_ADDR: $RemoteAddr)" ); return; } } 1;

source: Configuration Example
hu: Beállítási példa

source: There is the need to activate your custom agent authenticate module. This can be done using the Perl configuration below. It is not recommended to use the XML configuration because you can lock you out via the sysconfig.
hu: Szükség van az egyéni ügyintézői hitelesítés modul bekapcsolására. Ezt a lenti Perl beállítás használatával lehet megtenni. Nem ajánlott az XML beállítás használata, mert kizárhatja magát a rendszerbeállításokon keresztül.

source: Use Case Example
hu: Használati eset példa

source: A useful example of an authentication implementation could be a SOAP backend.
hu: Egy hitelesítési megvalósítás hasznos példája lehet egy SOAP háttérprogram.

source: Release Availability
hu: Kiadási elérhetőség

source: Name
hu: Név

source: Release
hu: Kiadás

source: Authentication Synchronization Module
hu: Hitelesítés szinkronizációs modul

source: There is an LDAP authentication synchronization module which come with the OTRS framework. It is also possible to develop your own authentication modules. The authentication synchronization modules are located under <filename>Kernel/System/Auth/Sync/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of an authentication synchronization module. Save it under <filename>Kernel/System/Auth/Sync/CustomAuthSync.pm</filename>. You just need 2 functions: <code>new()</code> and <code>Sync()</code>. Return 1, then the synchronization is ok.
hu: Létezik egy LDAP hitelesítés szinkronizációs modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját hitelesítés modulok fejlesztésére is. A hitelesítés szinkronizációs modulok a <filename>Kernel/System/Auth/Sync/*.pm</filename> alatt találhatók. A beállításaikkal kapcsolatban további információkért nézze meg az adminisztrációs kézikönyvet. A következőkben egy hitelesítés szinkronizációs modul példája található. Mentse el a <filename>Kernel/System/Auth/Sync/CustomAuthSync.pm</filename> fájlba. Mindössze két függvényre van szüksége: <code>new()</code> és <code>Sync()</code>. Adjon vissza 1-et, és ezután a szinkronizáció rendben van.

source: The interface class is called <literal>Kernel::System::Auth</literal>. The example agent authentication may be called <literal>Kernel::System::Auth::Sync::CustomAuthSync</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::Auth</literal>. A példa ügyintézői hitelesítés hívható <literal>Kernel::System::Auth::Sync::CustomAuthSync</literal> néven. Lent találhat egy példát.

source: # -- # Kernel/System/Auth/Sync/CustomAuthSync.pm - provides the CustomAuthSync # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: CustomAuthSync.pm,v 1.9 2010/03/25 14:42:45 martin Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Auth::Sync::CustomAuthSync; use strict; use warnings; use Net::LDAP; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for (qw(LogObject ConfigObject DBObject UserObject GroupObject EncodeObject)) { $Self->{$_} = $Param{$_} || die "No $_!"; } # Debug 0=off 1=on $Self->{Debug} = 0; ... return $Self; } sub Sync { my ( $Self, %Param ) = @_; # check needed stuff for (qw(User)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } ... return 1; }
hu: # -- # Kernel/System/Auth/Sync/CustomAuthSync.pm - az ügyfél hitelesítésének szinkronizációját biztosítja # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: CustomAuthSync.pm,v 1.9 2010/03/25 14:42:45 martin Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Auth::Sync::CustomAuthSync; use strict; use warnings; use Net::LDAP; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumnak my $Self = {}; bless( $Self, $Type ); # szükséges objektumok ellenőrzése for (qw(LogObject ConfigObject DBObject UserObject GroupObject EncodeObject)) { $Self->{$_} = $Param{$_} || die "No $_!"; } # Hibakeresés: 0=ki 1=be $Self->{Debug} = 0; ... return $Self; } sub Sync { my ( $Self, %Param ) = @_; # szükséges dolgok ellenőrzése for (qw(User)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } ... return 1; }

source: You should activate your custom synchronization module. This can be done using the Perl configuration below. It is not recommended to use the XML configuration because this would allow you to lock yourself out via SysConfig.
hu: Be kell kapcsolnia az egyéni szinkronizációs modult. Ezt a lenti Perl beállítás használatával lehet megtenni. Nem ajánlott az XML beállítás használata, mert az lehetővé teheti, hogy kizárja magát a rendszerbeállításokon keresztül.

source: Use Case Examples
hu: Használati eset példák

source: Useful synchronization implementation could be a SOAP or RADIUS backend.
hu: Hasznos szinkronizációs megvalósítás lehet egy SOAP vagy egy RADIUS háttérprogram.

source: Caveats and Warnings
hu: Ellenjavaslatok és figyelmeztetések

source: Please note that the synchronization was part of the authentication class <literal>Kernel::System::Auth</literal> before framework 2.4.
hu: Ne feledje, hogy a szinkronizáció a <literal>Kernel::System::Auth</literal> hitelesítési osztály része volt a 2.4-es keretrendszer előtt.

source: Customer Authentication Module
hu: Ügyfél hitelesítő modul

source: There are several customer authentication modules (DB, LDAP and HTTPBasicAuth) which come with the OTRS framework. It is also possible to develop your own authentication modules. The customer authentication modules are located under <filename>Kernel/System/CustomerAuth/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of a simple customer auth module. Save it under <filename>Kernel/System/CustomerAuth/Simple.pm</filename>. You just need 3 functions: <code>new()</code>, <code>GetOption()</code> and <code>Auth()</code>. Return the uid, then the authentication is ok.
hu: Számos ügyfél hitelesítő modul létezik (DB, LDAP és HTTPBasicAuth), amelyek az OTRS keretrendszerrel érkeznek. Lehetőség van saját hitelesítő modulok fejlesztésére is. Az ügyfél hitelesítő modulok a <filename>Kernel/System/CustomerAuth/*.pm</filename> alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. Ezt követően egy egyszerű ügyfél hitelesítő modul példája található. Mentse el a <filename>Kernel/System/CustomerAuth/Simple.pm</filename> helyre. Mindössze három függvényre van szüksége: <code>new()</code>, <code>GetOption()</code> és <code>Auth()</code>. Adja vissza az uid-t, és ezután a hitelesítés rendben van.

source: The interface class is called <literal>Kernel::System::CustomerAuth</literal>. The example customer authentication may be called <literal>Kernel::System::CustomerAuth::CustomAuth</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::CustomerAuth</literal>. A példa ügyfél hitelesítés hívható <literal>Kernel::System::CustomerAuth::CustomAuth</literal> néven. Lent találhat egy példát.
