Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: If data parameters are given to the templates by the application module, these data can be output to the template. <literal>[% Data.Name %]</literal> is the most simple, but also most dangerous one. It will insert the data parameter whose name is <literal>Name</literal> into the template as it is, without further processing.
hu: Ha az alkalmazásmodul adatparamétereket ad meg a sablonoknak, akkor ezeket az adatokat ki lehet íratni a sablonra. A <literal>[% Data.Name %]</literal> a legegyszerűbb, de a legveszélyesebb is. Azt az adatparamétert fogja további feldolgozás nélkül beszúrni a sablonba úgy ahogy van, amely neve <literal>Name</literal>.

source: Because of the missing HTML quoting, this can result in security problems. Never output data that was input by a user without quoting in HTML context. The user could - for example - just insert a <literal>&lt;script&gt;</literal> tag, and it would be output on the HTML page generated by OTRS.
hu: A hiányzó HTML idézés miatt ez biztonsági problémákat eredményezhet. Sose írasson ki olyan adatokat, amelyeket egy felhasználó adott meg, anélkül, hogy idézné azokat a HTML környezetben. A felhasználó például egyszerűen beszúrhat egy <literal>&lt;script&gt;</literal> címkét, és az kiíródhat az OTRS által előállított HTML oldalon.

source: Whenever possible, use <link linkend="data-html"><literal>[% Data.Name | html %]</literal></link> (in HTML) or <link linkend="data-uri"><literal>[% Data.Name | uri %]</literal></link> (in Links) instead.
hu: Amikor csak lehetséges, használjon <link linkend="data-html"><literal>[% Data.Name | html %]</literal></link> (HTML-ben) vagy <link linkend="data-uri"><literal>[% Data.Name | uri %]</literal></link> (hivatkozásokban) paramétert helyette.

source: Example: Whenever we generate HTML in the application, we need to output it to the template without HTML quoting, like <literal>&lt;select&gt;</literal> elements, which are generated by the function <literal>Layout::BuildSelection()</literal> in OTRS.
hu: Példa: Amikor HTML kimenetet állítunk elő az alkalmazásban, akkor HTML idézés nélkül kell kiíratnunk azt a sablonba, mint például a <literal>&lt;select&gt;</literal> elemeket, amelyeket a <literal>Layout::BuildSelection()</literal> függvény állít elő az OTRS-ben.

source: <label for="Dropdown">Example Dropdown</label> [% Data.DropdownString"]
hu: <label for="Dropdown">Példa legördülő</label> [% Data.DropdownString"]

source: If you have data entries with complex names containing special characters, you cannot use the dot (<literal>.</literal>) notation to access this data. Use <literal>item()</literal> instead: <literal>[% Data.item('Complex-name') %]</literal>.
hu: Ha speciális karaktereket tartalmazó, összetett nevű adatbejegyzései vannak, akkor nem használhatja a pont (<literal>.</literal>) jelölést az adathoz való hozzáféréshez. Az <literal>item()</literal> függvényt használja helyette: <literal>[% Data.item('Összetett-név') %]</literal>.

source: This command has the same function as <link linkend="data-raw">the previous one</link>, but it performs HTML quoting on the data as it is inserted to the template.
hu: Ennek a parancsnak ugyanaz a funkciója mint <link linkend="data-raw">az előzőnek</link>, de HTML idézést hajt végre az adatokon, amint beszúrásra kerülnek a sablonba.

source: The name of the author is [% Data.Name | html %].
hu: A szerző neve [% Data.Name | html %].

source: It's also possible specify a maximum length for the value. If, for example, you just want to show 8 characters of a variable (result will be "SomeName[...]"), use the following:
hu: Lehetséges az érték legnagyobb hosszának megadása is. Ha például egy változónak csak 9 karakterét szeretné megjeleníteni (az eredmény „ValamiNév[...]” lesz), akkor használja a következőt:

source: The first 20 characters of the author's name: [% Data.Name | truncate(20) | html %].
hu: A szerző nevének első 20 karaktere: [% Data.Name | truncate(20) | html %].

source: This command performs <ulink url="http://en.wikipedia.org/wiki/Percent-encoding">URL encoding</ulink> on the data as it is inserted to the template. This should be used to output single parameter names or values of URLs, to prevent security problems. It cannot be used for complete URLs because it will also mask <literal>=</literal>, for example.
hu: Ez a parancs <ulink url="https://hu.wikipedia.org/wiki/URL-k%C3%B3dol%C3%A1s">URL-kódolást</ulink> hajt végre az adatokon, amint az beszúrásra kerül a sablonba. Ezt kell használni az URL-ek egyedülálló paraméternevei vagy értékei kiíratásánál a biztonsági problémák megakadályozásához. Nem használható teljes URL-eknél, mert ki fogja maszkolni például az <literal>=</literal> karaktert is.

source: This command outputs a string or another data structure as a JavaScript JSON string.
hu: Ez a parancs JavaScript JSON szövegként írat ki egy szöveget vagy más adatszerkezetet.

source: Please note that the filter notation will only work for simple strings. To output complex data as JSON, please use it as a function:
hu: Vegye figyelembe, hogy a szűrőjelölés csak egyszerű szövegeknél fog működni. Összetett adatok JSON szövegként való kiíratásához függvényként használja azt:

source: Inserts environment variables provided by the <literal>LayoutObject</literal>. Some examples:
hu: A <literal>LayoutObject</literal> által szolgáltatott környezeti változókat szúrja be. Néhány példa:

source: The current user name is: [% Env("UserFullname") %] Some other common predefined variables are: [% Env("Action") %] --> the current action [% Env("Baselink") %] --> the baselink --> index.pl?SessionID=... [% Env("CGIHandle") %] --> the current CGI handle e. g. index.pl [% Env("SessionID") %] --> the current session id [% Env("Time") %] --> the current time e. g. Thu Dec 27 16:00:55 2001 [% Env("UserFullname") %] --> e. g. Dirk Seiffert [% Env("UserIsGroup[admin]") %] = Yes [% Env("UserIsGroup[users]") %] = Yes --> user groups (useful for own links) [% Env("UserLogin") %] --> e. g. mgg@x11.org
hu: A jelenlegi felhasználó neve: [% Env("UserFullname") %] Néhány egyéb gyakori előre meghatározott változó: [% Env("Action") %] --> a jelenlegi művelet [% Env("Baselink") %] --> az alaphivatkozás --> index.pl?SessionID=... [% Env("CGIHandle") %] --> a jelenlegi CGI-kezelő, például index.pl [% Env("SessionID") %] --> a jelenlegi munkamenet-azonosító [% Env("Time") %] --> a jelenlegi idő, például Thu Dec 27 16:00:55 2001 [% Env("UserFullname") %] --> például Kovács János [% Env("UserIsGroup[admin]") %] = Igen [% Env("UserIsGroup[users]") %] = Igen --> felhasználócsoportok (hasznos saját hivatkozásoknál) [% Env("UserLogin") %] --> például mgg@x11.org

source: Don't forget to add the <literal>| html</literal> filter where appropriate.
hu: Ne felejtse el a <literal>| html</literal> szűrőt hozzáadni, ahol az helyénvaló.

source: Inserts config variables into the template. Let's see an example <filename>Kernel/Config.pm</filename>:
hu: Beállítási változókat szúr be a sablonba. Nézzünk egy példa <filename>Kernel/Config.pm</filename> fájlt:

source: [Kernel/Config.pm] # FQDN # (Full qualified domain name of your system.) $Self->{FQDN} = 'otrs.example.com'; # AdminEmail # (Email of the system admin.) $Self->{AdminEmail} = 'admin@example.com'; [...]
hu: [Kernel/Config.pm] # FQDN # (A rendszer teljesen minősített tartományneve.) $Self->{FQDN} = 'otrs.example.com'; # AdminEmail # (A rendszer adminisztrátorának e-mail címe.) $Self->{AdminEmail} = 'admin@example.com'; [...]

source: To output values from it in the template, use:
hu: Változók kiíratásához ebből fájlból a sablonba a következőt használja:

source: The hostname is '$Config{"FQDN"}' The admin email address is '[% Config("AdminEmail") %]'
hu: A gépnév „$Config{"FQDN"}” Az adminisztrátori e-mail cím „[% Config("AdminEmail") %]”

source: Because of the missing HTML quoting, this can result in security problems.
hu: A hiányzó HTML idézés miatt ez biztonsági problémákat eredményezhet.

source: Localization Commands
hu: Honosítási parancsok

source: Translates a string into the current user's selected language. If no translation is found, the original string will be used.
hu: Lefordít egy szöveget a felhasználó által kiválasztott jelenlegi nyelve. Ha nem található fordítás, akkor az eredeti szöveget fogja használni.

source: Translate this text: [% Translate("Help") | html %]
hu: Ezen szöveg lefordítása: [% Translate("Help") | html %]

source: You can also translate dynamic data by using <literal>Translate</literal> as a filter:
hu: Lefordíthat dinamikus adatokat is a <literal>Translate</literal> szűrőként való használatával:

source: Translate data from the application: [% Data.Type | Translate | html %]
hu: Adatok lefordítása az alkalmazásból: [% Data.Type | Translate | html %]

source: You can also specify one or more parameters (<literal>%s</literal>) inside of the string which should be replaced with dynamic data:
hu: Egy vagy több paramétert (<literal>%s</literal>) is megadhat a szövegen belül, amelyeket dinamikus adatokkal kell kicserélni:

source: Translate this text and insert the given data: [% Translate("Change %s settings", Data.Type) | html %]
hu: Ezen szöveg lefordítása és a megadott adatok beszúrása: [% Translate("Change %s settings", Data.Type) | html %]

source: Strings in JavaScript can be translated and processed with <link linkend="data-json">the JSON filter</link>.
hu: A JavaScriptben lévő szövegek is lefordíthatók és feldolgozhatók a <link linkend="data-json">JSON szűrővel</link>.

source: Outputs data according to the current language/locale.
hu: Kiírja az adatokat a jelenlegi nyelv vagy területi beállítás szerint.

source: In different cultural areas, different convention for date and time formatting are used. For example, what is the 01.02.2010 in Germany, would be 02/01/2010 in the USA. <literal>[% Localize() %]</literal> abstracts this away from the templates. Let's see an example:
hu: Különböző kulturális területeken különböző egyezményt használnak a dátum és idő formázásához. Például ami Németországban 01.02.2010 formátum, annak az USA-ban 02/01/2010 formátumban kellene lennie. A <literal>[% Localize() %]</literal> függvény elvonatkoztatja ezt a sablontól. Nézzünk egy példát:

source: [% Data.CreateTime ǀ Localize("TimeLong") %] # Result for US English locale: 06/09/2010 15:45:41
hu: [% Data.CreateTime ǀ Localize("TimeLong") %] # Eredmény az US English területi beállításnál: 06/09/2010 15:45:41

source: First, the data is inserted from the application module with <literal>Data</literal>. Here always an ISO UTC timestamp (2010-06-09 15:45:41) must be passed as data to <literal>[% Localize() %]</literal>. Then it will be output it according to the date/time definition of the current locale.
hu: Először is az adatok a <literal>Data</literal> segítségével kerülnek beszúrásra az alkalmazásmodulból. Itt mindig egy ISO UTC időbéleget (2010-06-09 15:45:41) kell átadni adatként a <literal>[% Localize() %]</literal> függvénynek. Ezután lesz kiíratva a jelenlegi területi beállítás dátum és idő meghatározása szerint.

source: The data passed to <literal>[% Localize() %]</literal> must be UTC. If a time zone offset is specified for the current agent, it will be applied to the UTC timestamp before the output is generated.
hu: A <literal>[% Localize() %]</literal> függvénynek átadott adatoknak UTC formátumban kell lenniük. Ha időzóna-eltolás van meghatározva a jelenlegi ügyintézőnél, akkor az alkalmazva lesz az UTC időbélyegen a kimenet előállítása előtt.

source: There are different possible date/time output formats: <literal>TimeLong</literal> (full date/time), <literal>TimeShort</literal> (no seconds) and <literal>Date</literal> (no time).
hu: Különböző lehetséges dátum és idő kimeneti formátumok léteznek: <literal>TimeLong</literal> (teljes dátum és idő), <literal>TimeShort</literal> (nincsenek másodpercek) és <literal>Date</literal> (nincs idő).

source: [% Data.CreateTime ǀ Localize("TimeLong") %] # Result for US English locale: 06/09/2010 15:45:41 [% Data.CreateTime ǀ Localize("TimeShort") %] # Result for US English locale: 06/09/2010 15:45 [% Data.CreateTime ǀ Localize("Date") %] # Result for US English locale: 06/09/2010
hu: [% Data.CreateTime ǀ Localize("TimeLong") %] # Eredmény a US English területi beállításnál: 06/09/2010 15:45:41 [% Data.CreateTime ǀ Localize("TimeShort") ]") %] # Eredmény a US English területi beállításnál: 06/09/2010 15:45 [% Data.CreateTime ǀ Localize("Date") %] # Eredmény a US English területi beállításnál: 06/09/2010

source: Also the output of human readable file sizes is available as an option <literal>Localize('Filesize')</literal> (just pass the raw file size in bytes).
hu: Ember által olvasható fájlméretek kimenete is elérhető lehetőségként <literal>Localize('Filesize')</literal> (egyszerűen adja át a nyers fájlméretet bájtokban).

source: [% Data.Filesize ǀ Localize("Filesize") %] # Result for US English locale: 23 MB
hu: [% Data.Filesize ǀ Localize("Filesize") %] # Eredmény az US English területi beállításnál: 23 MB

source: Replaces placeholders (%s) in strings with passed parameters.
hu: Kicseréli a helykitöltőket (%s) a szövegekben az átadott paraméterekre.

source: In certain cases, you might want to insert HTML code in translations, instead of placeholders. On the other hand, you also need to take care of sanitization, since translated strings should not be trusted as-is. For this, you can first translate the string, pass it through the HTML filter and finally replace placeholders with static (safe) HTML code.
hu: Bizonyos esetekben érdemes lehet HTML kódot beszúrni a fordításokba a helykitöltők helyett. Másrészt viszont gondoskodnia kellfertőtlenítésről, mivel a lefordított szövegekben nem szabad megbízni úgy, ahogy vannak. Ehhez először fordítsa le a szöveget, küldje át a HTML szűrőn, és végül cserélje ki a helykitöltőket statikus (biztonságos) HTML kóddal.

source: Number of parameters to <literal>ReplacePlaceholders()</literal> filter should match number of placeholders in the original string.
hu: A <literal>ReplacePlaceholders()</literal> szűrőnek átadott paraméterek számának meg kell egyeznie az eredeti szövegben lévő helykitöltők számával.

source: You can also use <literal>[% ReplacePlaceholders() %]</literal> in function format, in case you are not translating anything. In this case, first parameter is the target string, and any found placeholders in it are substituted with subsequent parameters.
hu: Használhatja a <literal>[% ReplacePlaceholders() %]</literal> szűrőt függvény formában is abban az esetben, ha nem fordít le semmit sem. Ebben az esetben az első paraméter a célszöveg, és a benne talált bármilyen helykitöltő helyettesítve lesz az azt követő paraméterekkel.

source: Template Processing Commands
hu: Sablonfeldolgozó parancsok

source: Comment
hu: Megjegyzés

source: Lines starting with a # at the beginning of will not be shown in the html output. This can be used both for commenting the Template code or for disabling parts of it.
hu: Azok a sorok, amelyek # karakterrel kezdődnek az elején, nem lesznek láthatók a HTML kimeneten. Ez használható a sablonkód magyarázatához, vagy annak egyes részei letiltásához is.

source: # this section is temporarily disabled # <div class="AsBlock"> # <a href="...">link</a> # </div>
hu: # ez a szakasz átmenetileg le van tiltva # <div class="AsBlock"> # <a href="...">hivatkozás</a> # </div>

source: Please note that the <literal>InsertTemplate</literal> command was added to provide better backwards compatibility to the old DTL system. It might be deprecated in a future version of OTRS and removed later. If you don't use <link linkend="block">block commands</link> in your included template, you don't need <literal>InsertTemplate</literal> and can use standard Template::Toolkit syntax like <literal>INCLUDE/PROCESS</literal> instead.
hu: Felhívjuk a figyelmét, hogy az <literal>InsertTemplate</literal> parancs azért lett hozzáadva, hogy jobb visszafelé kompatibilitást nyújtson a régi DTL rendszerhez. Ez esetleg elavulttá válhat az OTRS jövőbeli verzióiban, és később eltávolításra kerülhet. Ha nem használ <link linkend="block">blokk parancsokat</link> a felvett sablonjában, akkor nincs szüksége az <literal>InsertTemplate</literal> parancsra, és használhatja helyette a szabványos Template::Toolkit szintaxist, úgymint <literal>INCLUDE/PROCESS</literal>.

source: Includes another template file into the current one. The included file may also contain template commands.
hu: Felvesz egy másik sablonfájlt a jelenlegibe. A felvett fájl is tartalmazhat sablonparancsokat.

source: # include Copyright.tt [% InsertTemplate("Copyright") %]
hu: # a Copyright.tt felvétele [% InsertTemplate("Copyright") %]

source: Please note this is not the same as Template::Toolkit's <literal>[% INCLUDE %]</literal> command, which just processes the referenced template. <literal>[% InsertTemplate() %]</literal> actually adds the content of the referenced template into the current template, so that it can be processed together. That makes it possible for the embedded template to access the same environment/data as the main template.
hu: Felhívjuk a figyelmét, hogy ez nem ugyanaz mint a Template::Toolkit <literal>[% INCLUDE %]</literal> parancsa, amely csak feldolgozza a hivatkozott sablont. Az <literal>[% InsertTemplate() %]</literal> tulajdonképpen hozzáadja a hivatkozott sablon tartalmát a jelenlegi sablonhoz azért, hogy együtt legyenek feldolgozhatók. Ez lehetővé teszi a beágyazott sablon számára, hogy ugyanazon környezethez vagy adatokhoz férjen hozzá mint a fő sablon.

source: Please note that the blocks commands were added to provide better backwards compatibility to the old DTL system. They might be deprecated in a future version of OTRS and removed later. We advise you to develop any new code without using the blocks commands. You can use standard Template::Toolkit syntax like <literal>IF/ELSE</literal>, <literal>LOOP</literal>s and other helpful things for conditional template output.
hu: Vegye figyelembe, hogy a blokk parancsok azért lettek hozzáadva, hogy jobb visszafelé kompatibilitást nyújtsanak a régi DTL rendszerhez. Ezek esetleg elavulttá válhatnak az OTRS jövőbeli verzióiban, és később eltávolításra kerülhetnek. Azt javasoljuk, hogy blokk parancsok használata nélkül fejlesszen bármilyen új kódot. Használhatja a szabványos Template::Toolkit szintaxist a feltételes sablonkimenethez, mint például <literal>IF/ELSE</literal>, <literal>LOOP</literal>-ok és egyéb hasznos dolgok.

source: With this command, one can specify parts of a template file as a block. This block needs to be explicitly filled with a function call from the application, to be present in the generated output. The application can call the block 0 (it will not be present in the output), 1 or more times (each with possibly a different set of data parameters passed to the template).
hu: Ezzel a paranccsal lehet megadni egy sablonfájl részeit blokként. Ezt a blokkot határozottan ki kell tölteni egy függvényhívással az alkalmazásból, hogy megjelenjen az előállított kimeneten. Az alkalmazás meghívhatja a blokkot 0-szor (nem fog megjelenni a kimeneten), illetve 1 vagy többször (esetleg mindegyiket a sablonnak átadott adatparaméterek különböző halmazával).

source: One common use case is the filling of a table with dynamic data:
hu: Egy gyakori használati eset egy táblázat kitöltése dinamikus adatokkal:

source: The surrounding table with the header is always generated. If no data was found, the block <literal>NoDataFoundMsg</literal> is called once, resulting in a table with one data row with the message "No data found."
hu: A körülvevő táblázat a fejléccel mindig elő lesz állítva. Ha nem található adat, akkor a <literal>NoDataFoundMsg</literal> blokk egyszer lesz meghívva egy olyan táblázatot eredményezve, amelynek egy adatsora van a „Nem található adat.” üzenettel.

source: If data was found, for each row there is one function call made for the block <literal>OverViewResultRow</literal> (each time passing in the data for this particular row), resulting in a table with as many data rows as results were found.
hu: Ha találhatók adatok, akkor minden egyes sornál egy függvényhívás történik az <literal>OverViewResultRow</literal> blokknál (minden alkalommal átadva az adatokat ehhez a bizonyos sorhoz) egy olyan táblázatot eredményezve, amelynek annyi sora van, ahány eredmény található.

source: Let's look at how the blocks are called from the application module:
hu: Nézzük meg, hogyan vannak meghívva a blokkok az alkalmazásmodulból:

source: my %List = $Kernel::OM->Get('Kernel::System::State)->StateList( UserID => 1, Valid => 0, ); # if there are any states, they are shown if (%List) { # get valid list my %ValidList = $Kernel::OM->Get('Kernel::System::Valid')->ValidList(); for my $ListKey ( sort { $List{$a} cmp $List{$b} } keys %List ) { my %Data = $Kernel::OM->Get('Kernel::System::State)->StateGet( ID => $ListKey ); $Kernel::OM->Get('Kernel::Output::HTML::Layout')->Block( Name => 'OverviewResultRow', Data => { Valid => $ValidList{ $Data{ValidID} }, %Data, }, ); } } # otherwise a no data found msg is displayed else { $Kernel::OM->Get('Kernel::Output::HTML::Layout')->Block( Name => 'NoDataFoundMsg', Data => {}, ); }
hu: my %List = $Kernel::OM->Get('Kernel::System::State)->StateList( UserID => 1, Valid => 0, ); # ha van bármilyen állapot, akkor azok meg fognak jelenni if (%List) { # érvényes lista beszerzése my %ValidList = $Kernel::OM->Get('Kernel::System::Valid')->ValidList(); for my $ListKey ( sort { $List{$a} cmp $List{$b} } keys %List ) { my %Data = $Kernel::OM->Get('Kernel::System::State)->StateGet( ID => $ListKey ); $Kernel::OM->Get('Kernel::Output::HTML::Layout')->Block( Name => 'OverviewResultRow', Data => { Valid => $ValidList{ $Data{ValidID} }, %Data, }, ); } } # egyébként egy „Nem található adat” üzenet jelenik meg else { $Kernel::OM->Get('Kernel::Output::HTML::Layout')->Block( Name => 'NoDataFoundMsg', Data => {}, ); }

source: Note how the blocks have both their name and an optional set of data passed in as separate parameters to the block function call. Data inserting commands inside a block always need the data provided to the block function call of this block, not the <link linkend="using-templates">general template rendering call</link>.
hu: Figyelje meg, hogy a blokkoknak hogyan kell átadniuk mind a nevüket, mind egy opcionális adathalmazt különálló paraméterekként a blokkfüggvény hívásnak. Az adatbeszúró parancsoknak egy blokkon belül mindig az ezen blokk blokkfüggvény hívásához megadott adatokra van szükségük, nem az <link linkend="using-templates">általános sablonmegjelenítő híváshoz</link>.

source: For details, please refer to the documentation of <literal>Kernel::Output::HTML::Layout</literal> on <ulink url="http://otrs.github.io/doc">otrs.github.io/doc</ulink>.
hu: A részletekért nézze meg a <literal>Kernel::Output::HTML::Layout</literal> dokumentációját az <ulink url="http://otrs.github.io/doc">otrs.github.io/doc</ulink> oldalon.

source: Marks JavaScript code which should be executed after all CSS, JavaScript and other external content has been loaded and the basic JavaScript initialization was finished. Again, let's look at an example:
hu: Megjelöli azt a JavaScript kódot, amelyet azután kell lefuttatni, miután az összes CSS, JavaScript és egyéb külső tartalom betöltődött, és az alapvető JavaScript előkészítés befejeződött. Vessünk egy pillantást ismét egy példára:

source: This snippet creates a small form and puts an <literal>onchange</literal> handler on the <literal>&lt;select&gt;</literal> element which triggers an AJAX based form update.
hu: Ez a kódrészlet egy kicsi űrlapot hoz létre, és rátesz egy <literal>onchange</literal> kezelőt a <literal>&lt;select&gt;</literal> elemre, amely aktivál egy AJAX-alapú űrlapfrissítést.
