Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: With <literal>Set()</literal> you can either change certain components of the <literal>DateTime</literal> object (year, month, day, hour, minute, second) or you can set a date and time based on a given string ('2016-05-24 23:04:12'). Note that you cannot change the time zone with this method.
hu: A <literal>Set()</literal> metódussal megváltoztathatja a <literal>DateTime</literal> objektum bizonyos összetevőit (év, hónap, nap, óra, perc, másodperc) vagy beállíthat egy dátumot és időt egy adott szöveg alapján ('2016-05-24 23:04:12'). Ne feledje, hogy nem tudja megváltoztatni az időzónát ezzel a metódussal.

source: Time zone methods
hu: Időzóna metódusok

source: To change the time zone of a <literal>DateTime</literal> object use method <literal>ToTimeZone()</literal> or as a shortcut for converting to OTRS time zone <literal>ToOTRSTimeZone()</literal>.
hu: Egy <literal>DateTime</literal> objektum időzónájának megváltoztatásához használja a <literal>ToTimeZone()</literal> metódust vagy egyszerűsítésként a <literal>ToOTRSTimeZone()</literal> metódust az OTRS időzóna átalakításához.

source: To retrieve the configured OTRS time zone or user default time zone, always use method <literal>OTRSTimeZoneGet()</literal> or <literal>UserDefaultTimeZoneGet()</literal>. Never retrieve these manually via <literal>Kernel::Config</literal>.
hu: A beállított OTRS időzóna vagy a felhasználó alapértelmezett időzónájának lekéréséhez mindig az <literal>OTRSTimeZoneGet()</literal> vagy a <literal>UserDefaultTimeZoneGet()</literal> metódusokat használja. Sose kérje le ezeket kézzel a <literal>Kernel::Config</literal> használatával.

source: Comparison operators and methods
hu: Összehasonlító operátorok és metódusok

source: <literal>Kernel::System::DateTime</literal> uses operator overloading for comparisons. So you can simply compare two <literal>DateTime</literal> objects with &lt;, &lt;=, ==, !=, &gt;= and &gt;. <literal>Compare()</literal> is usable in Perl's sort context as it returns -1, 0 or 1.
hu: A <literal>Kernel::System::DateTime</literal> operátortúlterhelést használ az összehasonlításhoz. Így egyszerűen összehasonlíthat két <literal>DateTime</literal> objektumot a &lt;, &lt;=, ==, !=, &gt;= and &gt; operátorokkal. A <literal>Compare()</literal> metódus használható a Perl rendezési környezetében, mivel -1, 0 vagy 1 a visszatérési értéke.

source: Deprecated package Kernel::System::Time
hu: Elavult Kernel::System::Time csomag

source: The now deprecated package <literal>Kernel::System::Time</literal> has been extended to fully support time zones instead of time offsets. This has been done to ensure that existing code works without (bigger) changes.
hu: A mostanra elavult <literal>Kernel::System::Time</literal> csomag ki lett bővítve, hogy teljesen támogassa az időzónákat az időeltolások helyett. Ez azért történt, hogy biztosítsa a meglévő kód működését (nagyobb) módosítások nélkül.

source: However, there is a case in which you have to change existing code. If you have code that uses the old time offsets to calculate a new date/time or a difference, you have to migrate this code to use the new <literal>DateTime</literal> object.
hu: Azonban van egy eset, amikor meg kell változtatnia a meglévő kódot. Ha olyan kódja van, amely a régi időeltolásokat használja egy új dátum és idő kiszámításához vagy különbségéhez, akkor át kell költöztetnie ezt a kódot, hogy az új <literal>DateTime</literal> objektumot használja.

source: Example (old code):
hu: Példa (régi kód):

source: my $TimeObject = $Kernel::OM->Get('Kernel::System::Time'); # Assume a time offset of 0 for this time object my $SystemTime = $TimeObject->TimeStamp2SystemTime( String => '2004-08-14 22:45:00' ); my $UserTimeZone = '+2'; # normally retrieved via config or param my $UserSystemTime = $SystemTime + $UserTimeZone * 3600; my $UserTimeStamp = $TimeObject->SystemTime2TimeStamp( SystemTime => $UserSystemTime );
hu: # Feltételezzünk egy 0 időeltolást ennél az objektumnál. my $TimeObject = $Kernel::OM->Get('Kernel::System::Time'); my $SystemTime = $TimeObject->TimeStamp2SystemTime( String => '2004-08-14 22:45:00' ); # Általában beállításon vagy paraméteren keresztül van lekérve. my $UserTimeZone = '+2'; my $UserSystemTime = $SystemTime + $UserTimeZone * 3600; my $UserTimeStamp = $TimeObject->SystemTime2TimeStamp( SystemTime => $UserSystemTime );

source: Example (new code):
hu: Példa (új kód):

source: my $DateTimeObject = $Kernel::OM->Create('Kernel::System::DateTime'); # This implicitly sets the configured OTRS time zone my $UserTimeZone = 'Europe/Berlin'; # normally retrieved via config or param $DateTimeObject->ToTimeZone( TimeZone => $UserTimeZone ); my $SystemTime = $DateTimeObject->ToEpoch(); # note that the epoch is independent from the time zone, it's always calculated for UTC my $UserTimeStamp = $DateTimeObject->ToString();
hu: # Ez hallgatólagosan beállítja a beállított OTRS időzónát. my $DateTimeObject = $Kernel::OM->Create('Kernel::System::DateTime'); # Általában beállításon vagy paraméteren keresztül van lekérve. my $UserTimeZone = 'Europe/Berlin'; $DateTimeObject->ToTimeZone( TimeZone => $UserTimeZone ); # Ne feledje, hogy az epoch független az időzónától, mindig az UTC-hez lesz kiszámítva. my $SystemTime = $DateTimeObject->ToEpoch(); my $UserTimeStamp = $DateTimeObject->ToString();

source: The CSS and JavaScript "Loader"
hu: A CSS és JavaScript „betöltő”

source: Starting with OTRS 3.0, the CSS and JavaScript code in OTRS grew to a large amount. To be able to satisfy both development concerns (good maintainability by a large number of separate files) and performance issues (making few HTTP requests and serving minified content without unneccessary whitespace and documentation) had to be addressed. To achieve these goals, the Loader was invented.
hu: Az OTRS 3.0-val kezdve az OTRS-ben lévő CSS és JavaScript kód hatalmas mennyiségre nőtt. Hogy képes legyen kielégíteni mind a fejlesztői szempontokat (jó karbantarthatóság különálló fájlok nagy mennyiségével), mind a teljesítmény problémákat (kevés HTTP-kérés megtétele és minimalizált tartalom kiszolgálása felesleges üres karakterek és dokumentáció nélkül), foglalkozni kellett ezzel. A célok eléréséhez kitalálták a betöltőt.

source: To put it simple, the Loader
hu: Leegyszerűsítve, a betöltő

source: determines for each request precisely which CSS and JavaScript files are needed at the client side by the current application module
hu: minden egyes kérésnél pontosan meghatározza, hogy mely CSS és JavaScript fájlok szükségesek a kliens oldalhoz a jelenlegi alkalmazásmodulnál

source: collects all the relevant data
hu: összegyűjti az összes ide vonatkozó adatot

source: minifies the data, removing unnecessary whitespace and documentation
hu: minimalizálja az adatokat a felesleges üres karakterek és dokumentáció eltávolításával

source: serves it to the client in only a few HTTP requests instead of many individual ones, allowing the client to cache these snippets in the browser cache
hu: kiszolgálja a kliens oldalnak mindössze néhány HTTP-kérésben a sok egyedüli helyett, lehetővé téve a kliensnek, hogy a gyorstárazza ezeket a töredékeket a böngésző gyorsítótárába

source: performs these tasks in a highly performing way, utilizing the caching mechanisms of OTRS.
hu: végrehajtja ezeket a feladatokat egy jól teljesítő módon az OTRS gyorsítótárazó mechanizmusait használva.

source: Of course, there is a little bit more detailed involved, but this should suffice as a first overview.
hu: Természetesen van egy kicsivel részletesebb magyarázat is, de ennek elegendőnek kell lennie első áttekintésként.

source: Basic Operation
hu: Alapvető működés

source: With the configuration settings <literal>Loader::Enabled::CSS</literal> and <literal>Loader::Enabled::JavaScript</literal>, the loader can be turned on and off for CSS and JavaScript, respectively (it is on by default).
hu: A <literal>Loader::Enabled::CSS</literal> és a <literal>Loader::Enabled::JavaScript</literal> konfigurációs beállításokkal kapcsolható be és ki a betöltő a CSS-t és a JavaScriptet illetőleg (alapértelmezetten be van kapcsolva).

source: Because of rendering problems in Internet Explorer, the Loader cannot be turned off for CSS files for this client browser (config setting will be overridden). Up to version 8, Internet Explorer cannot handle more than 32 CSS files on a page.
hu: Az Internet Explorer böngészőben lévő megjelenítési problémák miatt a betöltőt nem lehet kikapcsolni a CSS-fájlokhoz ennél a kliens böngészőnél (a konfigurációs beállítás felül lesz bírálva). A 8-as verzióig az Internet Explorer nem tud 32 CSS-fájlnál többet kezelni egy oldalon.

source: To learn about how the Loader works, please turn it off in your OTRS installation with the aforementioned configuration settings. Now look at the source code of the application module that you are currently using in this OTRS system (after a reload, of course). You will see that there are many CSS files loaded in the <literal>&lt;head&gt;</literal> section of the page, and many JavaScript files at the bottom of the page, just before the closing <literal>&lt;/body&gt;</literal> element.
hu: Ha többet szeretne megtudni arról, hogy a betöltő hogyan működik, akkor kapcsolja ki az OTRS telepítésében a fent említett konfigurációs beállításokkal. Most nézze meg annak az alkalmazásmodulnak a forráskódját, amelyet jelenleg használ ezen az OTRS rendszeren (természetesen egy újratöltés után). Látni fogja, hogy számos CSS-fájl töltődött be az oldal <literal>&lt;head&gt;</literal> szakaszában, és sok JavaScript fájl van az oldal alján közvetlenül a lezáró <literal>&lt;/body&gt;</literal> elem előtt.

source: Having the content like this in many individual files with a readable formatting makes the development much easier, and even possible at all. However, this has the disadvantage of a large number of HTTP requests (network latency has a big effect) and unnecessary content (whitespace and documentation) which needs to be transferred to the client.
hu: Ehhez hasonlóan számos egyedülálló fájlban lévő olvashatóan formázott tartalom megléte sokkal egyszerűbbé teszi a fejlesztést, és akár egyáltalán lehetségessé téve azt. Azonban ennek megvan az a hátránya, hogy nagyszámú HTTP-kérést (a hálózati késleltetésnek nagy hatása van) és felesleges tartalmakat (üres karaktereket és dokumentációt) szükséges átvinni a kliensnek.

source: The Loader solves this problem by performing the steps outlined in the short description above. Please turn on the Loader again and reload your page now. Now you can see that there are only very few CSS and JavaScript tags in the HTML code, like this:
hu: A betöltő megoldja ezt a problémát a fenti rövid leírásban felvázolt lépések végrehajtásával. Kapcsolja be ismét a betöltőt, és most töltse újra az oldalt. Most azt láthatja, hogy csak nagyon kevés CSS és JavaScript címke van a HTML kódban ehhez hasonlóan:

source: What just happened? During the original request generating the HTML code for this page, the Loader generated these two files (or took them from the cache) and put the shown <literal>&lt;script&gt;</literal> tags on the page which link to these files, instead of linking to all relevant JavaScript files separately (as you saw it without the loader being active).
hu: Mi történt most? Ennél az oldalnál a HTML kódot előállító eredeti kérés közben a betöltő előállította ezt a két fájlt (vagy kivette azokat a gyorsítótárból), és betette a látható <literal>&lt;script&gt;</literal> címkébe azon az oldalon, amely ezekhez a fájlokhoz van kapcsolva, ahelyett, hogy az összes ide vonatkozó JavaScript fájlt különállóan kapcsolta volna hozzá (amint a bekapcsolt betöltő nélkül láthatta).

source: The CSS section looks a little more complicated:
hu: A CSS szakasz egy kicsivel bonyolultabbnak tűnik:

source: The reason is that Internet Explorer 7 and 8 need special treatment in addition to the default CSS because of their lacking support of web standard technologies. So we have some normal CSS that is loaded in all browsers, and some special CSS that is inside of so-called "conditional comments" which cause it to be loaded <emphasis>only</emphasis> by Internet Explorer 7/8. All other browsers will ignore it.
hu: Ennek az az oka, hogy az Internet Explorer 7 és 8 esetén speciális bánásmód szükséges az alapértelmezett CSS mellett a webes szabványtechnológiák hiányos támogatásuk miatt. Ezért van néhány normál CSS-fájlunk, amelyek minden böngészőben betöltődnek, és néhány speciális CSS-fájl az úgynevezett „feltételes megjegyzéseken” belül, amely azt idézi elő, hogy <emphasis>csak</emphasis> az Internet Explorer 7/8 töltse be azokat. Az összes többi böngésző figyelmen kívül fogja hagyni.

source: Now we have outlined how the loader works. Let's look at how you can utilize that in your own OTRS extensions by adding configuration data to the loader, telling it to load additional or alternative CSS or JavaScript content.
hu: Most felvázoltuk, hogy a betöltő hogyan működik. Nézzük meg, hogy hogyan hasznosíthatja azt a saját OTRS kiterjesztéseiben a betöltőhöz történő konfigurációs adatok hozzáadásával, azt mondva neki, hogy további vagy alternatív CSS vagy JavaScript tartalmat töltsön be.

source: Configuring the Loader: JavaScript
hu: A betöltő beállítása: JavaScript

source: To be able to operate correctly, the Loader needs to know which content it has to load for a particular OTRS application module. First, it will look for JavaScript files which <emphasis>always</emphasis> have to be loaded, and then it looks for special files which are only relevant for the current application module.
hu: Hogy képes legyen helyesen működni, a betöltőnek tudnia kell, hogy mely tartalmat kell betöltenie egy bizonyos OTRS alkalmazásmodulnál. Először olyan JavaScript fájlokat fog keresni, amelyeket <emphasis>mindig</emphasis> be kell tölteni, és ezután keres olyan speciális fájlokat, amelyek csak a jelenlegi alkalmazásmodulnál fontosak.

source: Common JavaScript
hu: Közös JavaScript

source: The list of JavaScript files to be loaded is configured in the configuration settings <literal>Loader::Agent::CommonJS</literal> (for the agent interface) and <literal>Loader::Customer::CommonJS</literal> (for the customer interface).
hu: A betöltendő JavaScript fájlok listája a <literal>Loader::Agent::CommonJS</literal> (az ügyintézői felülethez) és a <literal>Loader::Customer::CommonJS</literal> (az ügyfélfelülethez) konfigurációs beállításokban állítható be.

source: These settings are designed as hashes, so that OTRS extensions can add their own hash keys for additional content to be loaded. Let's look at an example:
hu: Ezek a beállítások kivonatokként vannak tervezve azért, hogy az OTRS kiterjesztések hozzáadhassák a saját kivonatkulcsaikat a további betöltendő tartalomhoz. Nézzünk egy példát:

source: This is the list of JavaScript files which always need to be loaded for the agent interface of OTRS.
hu: Ez azon JavaScript fájlok listája, amelyeket mindig be kell tölteni az OTRS ügyintézői felületénél.

source: To add new content which is supposed to be loaded always in the agent interface, just add an XML configuration file with another hash entry:
hu: Olyan új tartalom hozzáadásához, amelyet mindig be kellene tölteni az ügyintézői felületen, egyszerűen adjon hozzá egy XML beállítófájlt egy másik kivonatbejegyzéssel:

source: Simple, isn't it?
hu: Egyszerű, nemde?

source: Module-Specific JavaScript
hu: Modulspecifikus JavaScript

source: Not all JavaScript is usable for all application modules of OTRS. Therefore it is possible to specify module-specific JavaScript files. Whenever a certain module is used (such as <literal>AgentDashboard</literal>), the module-specific JavaScript for this module will also be loaded. The configuration is done in the frontend module registration in the XML configurations. Again, an example:
hu: Nem minden JavaScript használható az OTRS összes alkalmazásmoduljánál. Ezért lehetséges modulspecifikus JavaScript fájlok megadása. Amikor egy bizonyos modult használnak (mint például <literal>AgentDashboard</literal>), akkor ennek a modulnak a modulspecifikus JavaScript fájlja is be lesz töltve. A beállítás az XML beállításokban lévő előtétprogram modul regisztrációban történik. Ismét egy példa:

source: It is possible to put a <literal>&lt;Item Key="JavaScript"&gt;</literal> tag in the frontend module registrations which may contain <literal>&lt;Array&gt;</literal> and one tag <literal>&lt;Item&gt;</literal> for each JavaScript file that is supposed to be loaded for this application module.
hu: Lehetséges egy <literal>&lt;Item Key="JavaScript"&gt;</literal> címke elhelyezése az előtétprogram modul regisztrációkban, amely tartalmazhat <literal>&lt;Array&gt;</literal> tömböt és egy <literal>&lt;Item&gt;</literal> címkéket minden egyes JavaScript fájlhoz, amelyet be kellene tölteni ennél az alkalmazásmodulnál.

source: Now you have all information you need to configure the way the Loader handles JavaScript code.
hu: Most már rendelkezik az összes olyan információval, amely annak a módszernek a beállításhoz szükséges, hogy a betöltő kezelje a JavaScript kódot.

source: Configuring the Loader: CSS
hu: A betöltő beállítása: CSS

source: The loader handles CSS files very similar to JavaScript files, as described in the previous <link linkend="loader-javascript">section</link>, and extending the settings works in the same way too.
hu: A betöltő a CSS-fájlokat nagyon hasonlóan kezeli a JavaScript fájlokhoz, ahogy az előző <link linkend="loader-javascript">szakaszban</link> le van írva, és a beállítások kiterjesztése is ugyanolyan módon működik.

source: Common CSS
hu: Közös CSS

source: The way common CSS is handled is very similar to the way <link linkend="loader-common-javascript">common JavaScript</link> is loaded.
hu: Annak a módja, ahogy a közös CSS-t kezelik, nagyon hasonló a <link linkend="loader-common-javascript">közös JavaScript</link> betöltésének módjához.

source: Log Mechanism
hu: Naplózó mechanizmus

source: System Log
hu: Rendszernapló

source: OTRS comes with a system log backend that can be used for application logging and debugging.
hu: Az OTRS egy olyan rendszernaplózó háttérprogrammal érkezik, amely használható az alkalmazás naplózásánál és a hibakeresésnél.

source: The <literal>Log</literal> object can be accessed and used via the <literal>ObjectManager</literal> like this:
hu: A <literal>Log</literal> objektum az <literal>ObjectManager</literal> modulon keresztül érhető el és használható ehhez hasonlóan:

source: $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => 'Need something!', );
hu: $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => 'Valamire szükség van!', );

source: Depending on the configured log level via <literal>MinimumLogLevel</literal> option in SysConfig, logged message will either be saved or not, based on their <emphasis>Priority</emphasis> flag.
hu: A rendszerbeállításokban a <literal>MinimumLogLevel</literal> beállításon keresztül beállított naplózási szinttől függően a naplózott üzenetek a <emphasis>Prioritás</emphasis> jelzőjük alapján mentésre kerülnek vagy sem.

source: If <literal>error</literal> is set, just errors are logged. With <literal>debug</literal>, you get all logging messages. The order of log levels is:
hu: Ha <literal>error</literal> van beállítva, akkor csak a hibák lesznek naplózva. A <literal>debug</literal> értékkel megkapja az összes naplózási üzenetet. A naplózási szintek sorrendje a következő:

source: The output of the system log can be directed to either a syslog daemon or log file, depending on the configured <literal>LogModule</literal> option in SysConfig.
hu: A rendszernapló kimenete a rendszerbeállításokban lévő <literal>LogModule</literal> beállításban megadottak alapján átirányítható egy rendszernaplózó démonba vagy naplófájlba.

source: Communication Log
hu: Kommunikáció napló

source: In addition to System Log, OTRS provides specialized logging backend for any communication related logging. Since OTRS 6, system comes with dedicated tables and frontends to track and display communication logs for easier debugging and operational overview.
hu: A rendszernapló mellett az OTRS különleges naplózó háttérprogramot biztosít az összes, a kommunikációra vonatkozó naplózáshoz. Az OTRS 6 óta a rendszer dedikált táblázatokkal és előtétprogramokkal érkezik a kommunikációs naplók követéséhez és megjelenítéséhez, hogy egyszerűbb legyen hibát keresni és a működést áttekinteni.

source: To take advantage of the new system, first create a non-singleton instance of communication log object:
hu: Az új rendszer előnyeinek kihasználásához először hozzon létre egy nem egyke példányt a kommunikációs napló objektumból:

source: my $CommunicationLogObject = $Kernel::OM->Create( 'Kernel::System::CommunicationLog', ObjectParams => { Transport => 'Email', # Transport log module Direction => 'Incoming', # Incoming|Outgoing AccountType => 'POP3', # Mail account type AccountID => 1, # Mail account ID }, );
hu: my $CommunicationLogObject = $Kernel::OM->Create( 'Kernel::System::CommunicationLog', ObjectParams => { Transport => 'Email', # Átviteli naplózó modul Direction => 'Incoming', # Incoming|Outgoing AccountType => 'POP3', # Levelezési fiók típusa AccountID => 1, # Levelezési fiók azonosítója }, );

source: When you have a communication log object instance, you can start an object log for logging individual messages. There are two object logs currently implemented: <literal>Connection</literal> and <literal>Message</literal>.
hu: Amikor megvan a kommunikációs napló objektum példánya, akkor elindíthat egy objektumnaplózást az egyéni üzenetek naplózásához. Jelenleg két objektumnapló van megvalósítva: <literal>Connection</literal> és <literal>Message</literal>.

source: <literal>Connection</literal> object log should be used for logging any connection related messages (for example: authenticating on server or retrieving incoming messages).
hu: A <literal>Connection</literal> objektumnaplót kell használni minden, a kommunikációra vonatkozó üzenet naplózásához (például hitelesítés egy kiszolgálón vagy bejövő üzenetek fogadása).

source: Simply, start the object log by declaring its type, and you can use it immediately:
hu: Egyszerűen indítsa el az objektumnaplót a típusának meghatározásával, és már azonnal használhatja:

source: $CommunicationLogObject->ObjectLogStart( ObjectLogType => 'Connection', ); $CommunicationLogObject->ObjectLog( ObjectLogType => 'Connection', Priority => 'Debug', # Trace, Debug, Info, Notice, Warning or Error Key => 'Kernel::System::MailAccount::POP3', Value => "Open connection to 'host.example.com' (user-1).", );
hu: $CommunicationLogObject->ObjectLogStart( ObjectLogType => 'Connection', ); $CommunicationLogObject->ObjectLog( ObjectLogType => 'Connection', Priority => 'Debug', # Trace, Debug, Info, Notice, Warning vagy Error Key => 'Kernel::System::MailAccount::POP3', Value => "Kapcsolat nyitása ehhez: 'host.example.com' (user-1).", );

source: The communication log object instance handles the current started object logs, so you don't need to remember and bring them around everywhere, but it also means that you can only start one object per type.
hu: A kommunikációs napló objektum példánya kezeli a jelenleg elindított objektumnaplókat, így nem kell megjegyeznie és előhoznia mindenhol, de ez azt is jelenti, hogy csak egyetlen objektumot indíthat típusonként.

source: If you encounter an unrecoverable error, you can choose to close the object log and mark it as failed:
hu: Ha javíthatatlan hibával találkozik, akkor választhatja az objektumnapló bezárását és sikertelenként való megjelölését:
