Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: sub ExportWrapper { my ( $Self, %Param ) = @_; # wrap ids to used spelling for my $Use (qw(UseAsValueSeries UseAsRestriction UseAsXvalue)) { ELEMENT: for my $Element ( @{ $Param{$Use} } ) { next ELEMENT if !$Element || !$Element->{SelectedValues}; my $ElementName = $Element->{Element}; my $Values = $Element->{SelectedValues}; if ( $ElementName eq 'QueueIDs' || $ElementName eq 'CreatedQueueIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $Self->{QueueObject}->QueueLookup( QueueID => $ID->{Content} ); } } elsif ( $ElementName eq 'StateIDs' || $ElementName eq 'CreatedStateIDs' ) { my %StateList = $Self->{StateObject}->StateList( UserID => 1 ); ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $StateList{ $ID->{Content} }; } } } } return \%Param; }
hu: sub ExportWrapper { my ( $Self, %Param ) = @_; # azonosítók átalakítása a használt helyesíráshoz for my $Use (qw(UseAsValueSeries UseAsRestriction UseAsXvalue)) { ELEMENT: for my $Element ( @{ $Param{$Use} } ) { next ELEMENT if !$Element || !$Element->{SelectedValues}; my $ElementName = $Element->{Element}; my $Values = $Element->{SelectedValues}; if ( $ElementName eq 'QueueIDs' || $ElementName eq 'CreatedQueueIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $Self->{QueueObject}->QueueLookup( QueueID => $ID->{Content} ); } } elsif ( $ElementName eq 'StateIDs' || $ElementName eq 'CreatedStateIDs' ) { my %StateList = $Self->{StateObject}->StateList( UserID => 1 ); ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $StateList{ $ID->{Content} }; } } } } return \%Param; }

source: Configured statistics can be exported into XML format. But as queues with the same queue names can have different IDs on different OTRS instances it would be quite painful to export the IDs (the statistics would calculate the wrong numbers then). So an export wrapper should be written to use the names instead of ids. This should be done for each "dimension" of the stats module (x-axis, y-axis and restrictions).
hu: A beállított statisztikák exportálhatók XML-formátumba. De ahogy a várólistáknál, ahol ugyanazok a várólistanevek rendelkezhetnek különböző azonosítókkal a különböző OTRS példányoknál, különösen fájdalmas lehet az azonosítók exportálása (a statisztikák ekkor rossz számokat számítanának ki). Ezért egy exportálási átalakítót kell írni, hogy az azonosítók helyett neveket használjon. Ezt a statisztikák modul minden egyes „dimenziójánál” el kell végezni (X-tengely, Y-tengely és korlátozások).

source: <literal>ImportWrapper</literal> works the other way around - it converts the name to the ID in the instance the configuration is imported to.
hu: Az <literal>ImportWrapper</literal> fordítva működik - átalakítja a nevet az azonosítóra abban a példányban, ahova a beállítások importálásra kerülnek.

source: This is a sample export:
hu: Ez egy minta exportálás:

source: <?xml version="1.0" encoding="utf-8"?> <otrs_stats> <Cache>0</Cache> <Description>Sample stats module</Description> <File></File> <Format>CSV</Format> <Format>Print</Format> <Object>DeveloperManualSample</Object> <ObjectModule>Kernel::System::Stats::Dynamic::DynamicStatsTemplate</ObjectModule> <ObjectName>Sample Statistics</ObjectName> <Permission>stats</Permission> <StatType>dynamic</StatType> <SumCol>0</SumCol> <SumRow>0</SumRow> <Title>Sample 1</Title> <UseAsValueSeries Element="StateIDs" Fixed="1"> <SelectedValues>removed</SelectedValues> <SelectedValues>closed unsuccessful</SelectedValues> <SelectedValues>closed successful</SelectedValues> <SelectedValues>new</SelectedValues> <SelectedValues>open</SelectedValues> </UseAsValueSeries> <UseAsXvalue Element="CreatedQueueIDs" Fixed="1"> <SelectedValues>Junk</SelectedValues> <SelectedValues>Misc</SelectedValues> <SelectedValues>Postmaster</SelectedValues> <SelectedValues>Raw</SelectedValues> </UseAsXvalue> <Valid>1</Valid> </otrs_stats>
hu: <?xml version="1.0" encoding="utf-8"?> <otrs_stats> <Cache>0</Cache> <Description>Minta statisztikák modul</Description> <File></File> <Format>CSV</Format> <Format>Print</Format> <Object>DeveloperManualSample</Object> <ObjectModule>Kernel::System::Stats::Dynamic::DynamicStatsTemplate</ObjectModule> <ObjectName>Sample Statistics</ObjectName> <Permission>stats</Permission> <StatType>dynamic</StatType> <SumCol>0</SumCol> <SumRow>0</SumRow> <Title>Sample 1</Title> <UseAsValueSeries Element="StateIDs" Fixed="1"> <SelectedValues>removed</SelectedValues> <SelectedValues>closed unsuccessful</SelectedValues> <SelectedValues>closed successful</SelectedValues> <SelectedValues>new</SelectedValues> <SelectedValues>open</SelectedValues> </UseAsValueSeries> <UseAsXvalue Element="CreatedQueueIDs" Fixed="1"> <SelectedValues>Junk</SelectedValues> <SelectedValues>Misc</SelectedValues> <SelectedValues>Postmaster</SelectedValues> <SelectedValues>Raw</SelectedValues> </UseAsXvalue> <Valid>1</Valid> </otrs_stats>

source: Now, that all subroutines are explained, this is the complete sample stats module.
hu: Most, hogy az összes szubrutin elmagyarázásra került, itt a teljes minta statisztikák modul.

source: # -- # Kernel/System/Stats/Dynamic/DynamicStatsTemplate.pm - all advice functions # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Stats::Dynamic::DynamicStatsTemplate; use strict; use warnings; use Kernel::System::Queue; use Kernel::System::State; use Kernel::System::Ticket; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for my $Object ( qw(DBObject ConfigObject LogObject UserObject TimeObject MainObject EncodeObject) ) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } # created needed objects $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{StateObject} = Kernel::System::State->new( %{$Self} ); return $Self; } sub GetObjectName { my ( $Self, %Param ) = @_; return 'Sample Statistics'; } sub GetObjectAttributes { my ( $Self, %Param ) = @_; # get state list my %StateList = $Self->{StateObject}->StateList( UserID => 1, ); # get queue list my %QueueList = $Self->{QueueObject}->GetAllQueues(); # get current time to fix bug#3830 my $TimeStamp = $Self->{TimeObject}->CurrentTimestamp(); my ($Date) = split /\s+/, $TimeStamp; my $Today = sprintf "%s 23:59:59", $Date; my @ObjectAttributes = ( { Name => 'State', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'StateIDs', Block => 'MultiSelectField', Values => \%StateList, }, { Name => 'Created in Queue', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreatedQueueIDs', Block => 'MultiSelectField', Translation => 0, Values => \%QueueList, }, { Name => 'Create Time', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreateTime', TimePeriodFormat => 'DateInputFormat', # 'DateInputFormatLong', Block => 'Time', TimeStop => $Today, Values => { TimeStart => 'TicketCreateTimeNewerDate', TimeStop => 'TicketCreateTimeOlderDate', }, }, ); return @ObjectAttributes; } sub GetStatElement { my ( $Self, %Param ) = @_; # search tickets return $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'COUNT', Permission => 'ro', Limit => 100_000_000, %Param, ); } sub ExportWrapper { my ( $Self, %Param ) = @_; # wrap ids to used spelling for my $Use (qw(UseAsValueSeries UseAsRestriction UseAsXvalue)) { ELEMENT: for my $Element ( @{ $Param{$Use} } ) { next ELEMENT if !$Element || !$Element->{SelectedValues}; my $ElementName = $Element->{Element}; my $Values = $Element->{SelectedValues}; if ( $ElementName eq 'QueueIDs' || $ElementName eq 'CreatedQueueIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $Self->{QueueObject}->QueueLookup( QueueID => $ID->{Content} ); } } elsif ( $ElementName eq 'StateIDs' || $ElementName eq 'CreatedStateIDs' ) { my %StateList = $Self->{StateObject}->StateList( UserID => 1 ); ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $StateList{ $ID->{Content} }; } } } } return \%Param; } sub ImportWrapper { my ( $Self, %Param ) = @_; # wrap used spelling to ids for my $Use (qw(UseAsValueSeries UseAsRestriction UseAsXvalue)) { ELEMENT: for my $Element ( @{ $Param{$Use} } ) { next ELEMENT if !$Element || !$Element->{SelectedValues}; my $ElementName = $Element->{Element}; my $Values = $Element->{SelectedValues}; if ( $ElementName eq 'QueueIDs' || $ElementName eq 'CreatedQueueIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; if ( $Self->{QueueObject}->QueueLookup( Queue => $ID->{Content} ) ) { $ID->{Content} = $Self->{QueueObject}->QueueLookup( Queue => $ID->{Content} ); } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Import: Can' find the queue $ID->{Content}!" ); $ID = undef; } } } elsif ( $ElementName eq 'StateIDs' || $ElementName eq 'CreatedStateIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; my %State = $Self->{StateObject}->StateGet( Name => $ID->{Content}, Cache => 1, ); if ( $State{ID} ) { $ID->{Content} = $State{ID}; } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Import: Can' find state $ID->{Content}!" ); $ID = undef; } } } } } return \%Param; } 1;
hu: # -- # Kernel/System/Stats/Dynamic/DynamicStatsTemplate.pm - minden javasolt függvény # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Stats::Dynamic::DynamicStatsTemplate; use strict; use warnings; use Kernel::System::Queue; use Kernel::System::State; use Kernel::System::Ticket; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for my $Object ( qw(DBObject ConfigObject LogObject UserObject TimeObject MainObject EncodeObject) ) { $Self->{$Object} = $Param{$Object} || die "Nincs $Object!"; } # a létrehozott szükséges objektumok $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{StateObject} = Kernel::System::State->new( %{$Self} ); return $Self; } sub GetObjectName { my ( $Self, %Param ) = @_; return 'Minta statisztikák'; } sub GetObjectAttributes { my ( $Self, %Param ) = @_; # állapotlista lekérése my %StateList = $Self->{StateObject}->StateList( UserID => 1, ); # várólisták listájának lekérése my %QueueList = $Self->{QueueObject}->GetAllQueues(); # a jelenlegi idő lekérése a 3830. hiba javításához my $TimeStamp = $Self->{TimeObject}->CurrentTimestamp(); my ($Date) = split /\s+/, $TimeStamp; my $Today = sprintf "%s 23:59:59", $Date; my @ObjectAttributes = ( { Name => 'Állapot', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'StateIDs', Block => 'MultiSelectField', Values => \%StateList, }, { Name => 'Létrehozva várólistában', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreatedQueueIDs', Block => 'MultiSelectField', Translation => 0, Values => \%QueueList, }, { Name => 'Létrehozás ideje', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreateTime', TimePeriodFormat => 'DateInputFormat', # 'DateInputFormatLong', Block => 'Time', TimeStop => $Today, Values => { TimeStart => 'TicketCreateTimeNewerDate', TimeStop => 'TicketCreateTimeOlderDate', }, }, ); return @ObjectAttributes; } sub GetStatElement { my ( $Self, %Param ) = @_; # jegyek keresése return $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'COUNT', Permission => 'ro', Limit => 100_000_000, %Param, ); } sub ExportWrapper { my ( $Self, %Param ) = @_; # azonosítók átalakítása a használt helyesíráshoz for my $Use (qw(UseAsValueSeries UseAsRestriction UseAsXvalue)) { ELEMENT: for my $Element ( @{ $Param{$Use} } ) { next ELEMENT if !$Element || !$Element->{SelectedValues}; my $ElementName = $Element->{Element}; my $Values = $Element->{SelectedValues}; if ( $ElementName eq 'QueueIDs' || $ElementName eq 'CreatedQueueIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $Self->{QueueObject}->QueueLookup( QueueID => $ID->{Content} ); } } elsif ( $ElementName eq 'StateIDs' || $ElementName eq 'CreatedStateIDs' ) { my %StateList = $Self->{StateObject}->StateList( UserID => 1 ); ID: for my $ID ( @{$Values} ) { next ID if !$ID; $ID->{Content} = $StateList{ $ID->{Content} }; } } } } return \%Param; } sub ImportWrapper { my ( $Self, %Param ) = @_; # a használt helyesírás átalakítása az azonosítókhoz for my $Use (qw(UseAsValueSeries UseAsRestriction UseAsXvalue)) { ELEMENT: for my $Element ( @{ $Param{$Use} } ) { next ELEMENT if !$Element || !$Element->{SelectedValues}; my $ElementName = $Element->{Element}; my $Values = $Element->{SelectedValues}; if ( $ElementName eq 'QueueIDs' || $ElementName eq 'CreatedQueueIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; if ( $Self->{QueueObject}->QueueLookup( Queue => $ID->{Content} ) ) { $ID->{Content} = $Self->{QueueObject}->QueueLookup( Queue => $ID->{Content} ); } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Import: Can' find the queue $ID->{Content}!" ); $ID = undef; } } } elsif ( $ElementName eq 'StateIDs' || $ElementName eq 'CreatedStateIDs' ) { ID: for my $ID ( @{$Values} ) { next ID if !$ID; my %State = $Self->{StateObject}->StateGet( Name => $ID->{Content}, Cache => 1, ); if ( $State{ID} ) { $ID->{Content} = $State{ID}; } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Importálás: Nem található az állapot: $ID->{Content}!" ); $ID = undef; } } } } } return \%Param; } 1;

source: Use cases.
hu: Használati esetek.

source: If you have a lot of cells in the result table and the <literal>GetStatElement</literal> is quite complex, the request can take a long time.
hu: Ha nagyon sok cellája van az eredménytáblázatban és a <literal>GetStatElement</literal> meglehetősen összetett, akkor a kérés eltarthat egy ideig.

source: Dynamic stat modules are available since OTRS 2.0.
hu: A dinamikus statisztikamodulok az OTRS 2.0 óta érhetők el.

source: Static Stats
hu: Statikus statisztikák

source: The subsequent paragraphs describe the static stats. Static stats are very easy to create as these modules have to implement only three subroutines.
hu: A következő bekezdések a statikus statisztikákat írják le. A statikus statisztikákat nagyon könnyű létrehozni, mivel ezeknek a moduloknak csak három szubrutint kell megvalósítaniuk.

source: The following paragraphs describe the subroutines needed in a static stats.
hu: A következő bekezdések a statikus statisztikákban szükséges szubrutinokat mutatják be.

source: sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {%Param}; bless( $Self, $Type ); # check all needed objects for my $Needed ( qw(DBObject ConfigObject LogObject TimeObject MainObject EncodeObject) ) { $Self->{$Needed} = $Param{$Needed} || die "Got no $Needed"; } # create needed objects $Self->{TypeObject} = Kernel::System::Type->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {%Param}; bless( $Self, $Type ); # az összes szükséges objektum ellenőrzése for my $Needed ( qw(DBObject ConfigObject LogObject TimeObject MainObject EncodeObject) ) { $Self->{$Needed} = $Param{$Needed} || die "Nincs $Needed"; } # a szükséges objektumok létrehozása $Self->{TypeObject} = Kernel::System::Type->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); return $Self; }

source: The <literal>new</literal> creates a new instance of the static stats class. First it creates a new object and then it checks for the needed objects.
hu: A <literal>new</literal> hozza létre a statikus statisztikák osztályának egy új példányát. Először létrehoz egy új objektumot, és azután ellenőrzi a szükséges objektumokat.

source: The <literal>Param</literal> method provides the list of all parameters/attributes that can be selected to create a static stat. It gets some parameters passed: The values for the stats attributes provided in a request, the format of the stats and the name of the object (name of the module).
hu: A <literal>Param</literal> metódus biztosítja az összes olyan paraméter és attribútum listáját, amelyek kiválaszthatók egy statikus statisztika létrehozásához. Megkap néhány átadott paramétert: az értékeket egy kérésben szolgáltatott statisztikák attribútumaihoz, a statisztikák formátumát és az objektum nevét (a modul nevét).

source: The parameters/attributes have to be hash references with these key-value pairs:
hu: A paramétereknek és az attribútumoknak kivonathivatkozásoknak kell lenniük ezekkel a kulcs-érték párokkal:

source: Other parameter for the <literal>BuildSelection</literal> method of the <literal>LayoutObject</literal> can be used, as it is done with <literal>Size</literal> and <literal>Multiple</literal> in this sample module.
hu: Egyéb paraméterek is használhatók a <literal>LayoutObject</literal> <literal>BuildSelection</literal> metódusánál, ahogy az a <literal>Size</literal> és <literal>Multiple</literal> paraméterekkel történik ebben a minta modulban.

source: sub Run { my ( $Self, %Param ) = @_; # check needed stuff for my $Needed (qw(TypeIDs QueueIDs)) { if ( !$Param{$Needed} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $Needed!", ); return; } } # set report title my $Title = 'Tickets per Queue'; # table headlines my @HeadData = ( 'Ticket Number', 'Queue', 'Type', ); my @Data; my @TicketIDs = $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'ARRAY', Permission => 'ro', %Param, ); for my $TicketID ( @TicketIDs ) { my %Ticket = $Self->{TicketObject}->TicketGet( UserID => 1, TicketID => $TicketID, ); push @Data, [ $Ticket{TicketNumber}, $Ticket{Queue}, $Ticket{Type} ]; } return ( [$Title], [@HeadData], @Data ); }
hu: sub Run { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for my $Needed (qw(TypeIDs QueueIDs)) { if ( !$Param{$Needed} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $Needed!", ); return; } } # a jelentés címének beállítása my $Title = 'Jegyek várólistánként'; # táblázat címsorok my @HeadData = ( 'Jegyszám', 'Várólista', 'Típus', ); my @Data; my @TicketIDs = $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'ARRAY', Permission => 'ro', %Param, ); for my $TicketID ( @TicketIDs ) { my %Ticket = $Self->{TicketObject}->TicketGet( UserID => 1, TicketID => $TicketID, ); push @Data, [ $Ticket{TicketNumber}, $Ticket{Queue}, $Ticket{Type} ]; } return ( [$Title], [@HeadData], @Data ); }

source: The <literal>Run</literal> method actually generates the table data for the stats. It gets the attributes for this stats passed. In this sample in <literal>%Param</literal> a key <literal>TypeIDs</literal> and a key <literal>QueueIDs</literal> exist (see attributes in <literal>Param</literal> method) and their values are array references. The returned data consists of three parts: Two array references and an array. In the first array reference the title for the statistic is stored, the second array reference contains the headlines for the columns in the table. And then the data for the table body follow.
hu: Tulajdonképpen a <literal>Run</literal> metódus állítja elő a táblázat adatait a statisztikákhoz. Megkapja az ennél a statisztikánál átadott attribútumokat. Ebben a mintában a <literal>%Param</literal> paraméterben egy <literal>TypeIDs</literal> kulcs és egy <literal>QueueIDs</literal> kulcs létezik (lásd a <literal>Param</literal> metódusban lévő attribútumokat), és ezek értékei tömbhivatkozások. A visszaadott adatok három részből állnak: két tömbhivatkozásból és egy tömbből. Az első tömbhivatkozásban a statisztika címe van eltárolva, a második tömbhivatkozás tartalmazza a táblázatban lévő oszlopok címsorait. És ezután a táblázattörzs adatai következnek.
