Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: =item Foo() Testing function: returns 1 if function is available on a Dynamic Field driver. my $Success = $BackendObject->Foo( DynamicFieldConfig => $DynamicFieldConfig, # complete config of the DynamicField ); Returns: $Success = 1; # or undef =cut sub Foo { my ( $Self, %Param ) = @_; # check needed stuff for my $Needed (qw(DynamicFieldConfig)) { if ( !$Param{$Needed} ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "Need $Needed!", ); return; } } # check DynamicFieldConfig (general) if ( !IsHashRefWithData( $Param{DynamicFieldConfig} ) ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "The field configuration is invalid", ); return; } # check DynamicFieldConfig (internally) for my $Needed (qw(ID FieldType ObjectType)) { if ( !$Param{DynamicFieldConfig}->{$Needed} ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "Need $Needed in DynamicFieldConfig!", ); return; } } # set the dynamic field specific backend my $DynamicFieldBackend = 'DynamicField' . $Param{DynamicFieldConfig}->{FieldType} . 'Object'; if ( !$Self->{$DynamicFieldBackend} ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "Backend $Param{DynamicFieldConfig}->{FieldType} is invalid!", ); return; } # verify if function is available return if !$Self->{$DynamicFieldBackend}->can('Foo'); # call HasBehavior on the specific backend return $Self->{$DynamicFieldBackend}->Foo(%Param); }
hu: =item Foo() Tesztelő függvény: 1-et ad vissza, ha a függvény elérhető egy dinamikus mező illesztőprogramnál. my $Success = $BackendObject->Foo( DynamicFieldConfig => $DynamicFieldConfig, # a dinamikus mező teljes beállítása ); Returns: $Success = 1; # vagy undef =cut sub Foo { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for my $Needed (qw(DynamicFieldConfig)) { if ( !$Param{$Needed} ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "Szükséges: $Needed!", ); return; } } # a DynamicFieldConfig ellenőrzése (általánosan) if ( !IsHashRefWithData( $Param{DynamicFieldConfig} ) ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "A mező beállítása érvénytelen", ); return; } # a DynamicFieldConfig ellenőrzése (belsőleg) for my $Needed (qw(ID FieldType ObjectType)) { if ( !$Param{DynamicFieldConfig}->{$Needed} ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "$Needed szükséges ebben: DynamicFieldConfig!", ); return; } } # a dinamikus mezőre jellemző háttérprogram beállítása my $DynamicFieldBackend = 'DynamicField' . $Param{DynamicFieldConfig}->{FieldType} . 'Object'; if ( !$Self->{$DynamicFieldBackend} ) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'error', Message => "A háttérprogram érvénytelen: $Param{DynamicFieldConfig}->{FieldType}!", ); return; } # annak ellenőrzése, hogy a függvény elérhető-e return if !$Self->{$DynamicFieldBackend}->can('Foo'); # a HasBehavior meghívása az adott háttérprogramnál return $Self->{$DynamicFieldBackend}->Foo(%Param); }

source: The function <code>Foo()</code> is only used for test purposes. First it checks the Dynamic Field configuration, then it checks if the Dynamic Field Driver (type) exists and was already loaded. To prevent the function call on a driver where is not defined it first check if the driver can execute the function, then executes the function in the driver passing all parameters.
hu: A <code>Foo()</code> függvényt kizárólag tesztelési célokra használják. Először leellenőrzi a dinamikus mező beállításait, majd azt ellenőrzi, hogy a dinamikus mező illesztőprogram (típus) létezik-e, és betöltésre került-e. Annak megakadályozásához, hogy egy olyan illesztőprogramnál történjen függvényhívás, ahol nincs meghatározva, először azt ellenőrzi, hogy az illesztőprogram képes-e végrehajtani a függvényt, majd végrehajtja a függvényt az illesztőprogramban az összes paramétert átadva.

source: It is also possible to skip the step that tests if the Driver can execute the function. To do that it is necessary to implement a mechanism in the Frontend module to require a special behavior on the Dynamic Field, and only after call the function in the Backend object.
hu: Lehetséges annak a lépésnek a kihagyása is, amely azt próbálja, hogy az illesztőprogram képes-e végrehajtani a függvényt. Ennek elvégzéséhez szükséges egy mechanizmus megvalósítása az előtétprogram modulban egy különleges viselkedés megköveteléséhez a dinamikus mezőnél, és csak azután hívja meg a függvényt a háttérprogram objektumban.

source: The normal OTRS footer for a Perl module file.
hu: A normál OTRS lábléc egy Perl-modul fájlhoz.

source: Dynamic Field Extension Configuration File Example
hu: Dinamikus mező kiterjesztés beállítófájl példa

source: The configuration files are used to register the extensions for the Backend and Drivers as well as new behaviors for each drivers.
hu: A beállítófájlokat használják a kiterjesztések regisztrálásához a háttérprogramnál és az illesztőprogramoknál, valamint az egyes illesztőprogramok új viselkedéseihez.

source: If a driver is extended with a new function, the backend will need also an extension for that function.
hu: Ha egy illesztőprogramot kiterjesztenek egy új függvénnyel, akkor a háttérprogramnak is szüksége lesz egy kiterjesztésre ahhoz a függvényhez.

source: In this section a configuration file for <literal>Foo</literal> extension is shown and explained.
hu: Ebben a szakaszban a <literal>Foo</literal> kiterjesztéshez egy beállítófájl van megjelenítve és elmagyarázva.

source: This is the normal header for a configuration file.
hu: Ez a normál fejléc egy beállítófájlhoz.

source: This setting registers the extension in the <literal>Backend</literal> object. The module will be loaded from <literal>Backend</literal> as a base class.
hu: Ez a beállítás regisztrálja a kiterjeszt a <literal>Backend</literal> objektumban. A modul alaposztályként lesz betöltve a <literal>Backend</literal> objektumból.

source: This is the registration for an extension in the <literal>Text</literal> Dynamic Field Driver. The module will be loaded as a base class in the Driver. Notice also that new behaviors can be specified. These extended behaviors will be added to the behaviors that the Driver has out of the box, therefore a call to <code>HasBehavior()</code> to check for these new behaviors will be totally transparent.
hu: Ez egy kiterjesztés regisztrációja a <literal>Text</literal> dinamikus mező illesztőprogramban. A modul alaposztályként lesz betöltve az illesztőprogramban. Figyeljen arra is, hogy új viselkedések is megadhatók. Ezek a kiterjesztett viselkedések lesznek hozzáadva azokhoz a viselkedésekhez, amelyekkel az illesztőprogram eredetileg rendelkezik, ebből adódóan a <code>HasBehavior()</code> hívásával azt ellenőrizve, hogy ezeknél az új viselkedéseknél teljesen átlátszó legyen.

source: Standard closure of a configuration file.
hu: Egy beállítófájl szabványos lezárása.

source: Dynamic Field Driver Extension Example
hu: Dinamikus mező illesztőprogram kiterjesztés példa

source: Driver extensions will be loaded transparently into the Driver itself as a base class. All defined object and properties from the Driver will be accessible in the extension.
hu: Az illesztőprogram kiterjesztések átláthatóan lesznek betöltve magába az illesztőprogramba egy alaposztályként. Az illesztőprogramból az összes meghatározott objektum és tulajdonság elérhető lesz a kiterjesztésben.

source: All new functions implemented in the Driver extension should be defined in a Backend extension, as every function is called from the Backend Object.
hu: Az illesztőprogram kiterjesztésben megvalósított összes új függvényt meg kell határozni egy háttérprogram kiterjesztésben, mivel minden függvény a háttérprogram objektumból kerül meghívásra.

source: In this section the <literal>Foo</literal> extension for Text field driver is shown and explained. The extension only implements the function <code>Foo()</code>.
hu: Ebben a szakaszban a szövegmező illesztőprogramhoz készített <literal>Foo</literal> kiterjesztés van megjelenítve és elmagyarázva. A kiterjesztés csak a <code>Foo()</code> függvényt valósítja meg.

source: # -- # Kernel/System/DynamicField/Driver/FooExtensionText.pm - Extension for DynamicField Text Driver # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::DynamicField::Driver::FooExtensionText; use strict; use warnings; =head1 NAME Kernel::System::DynamicField::Driver::FooExtensionText =head1 SYNOPSIS DynamicFields Text Driver Extension =head1 PUBLIC INTERFACE This module extends the public interface of L<Kernel::System::DynamicField::Backend>. Please look there for a detailed reference of the functions. =over 4 =cut
hu: # -- # Kernel/System/DynamicField/Driver/FooExtensionText.pm - Kiterjesztés a # dinamikus mező szöveg illesztőprogramjához # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::DynamicField::Driver::FooExtensionText; use strict; use warnings; =head1 NAME Kernel::System::DynamicField::Driver::FooExtensionText =head1 SYNOPSIS DynamicFields Text Driver Extension =head1 PUBLIC INTERFACE This module extends the public interface of L<Kernel::System::DynamicField::Backend>. Please look there for a detailed reference of the functions. =over 4 =cut

source: The function <code>Foo()</code> has no special logic. It is only for testing and it always returns 1.
hu: A <code>Foo()</code> függvénynek nincs különleges logikája. Csak tesztelésre van, és mindig 1-et ad vissza.

source: How To Extend The Dynamic Fields
hu: Hogyan lehet kiterjeszteni a dinamikus mezőket

source: There are many ways to extend the Dynamic Fields. The following sections will try to cover the most common scenarios.
hu: Számos módszer létezik a dinamikus mezők kiterjesztésére. A következő szakaszok meg fogják próbálni a leggyakoribb forgatókönyveket bemutatni.

source: Create a New Dynamic Field Type (for ticket or article objects)
hu: Egy új dinamikus mező típus létrehozása (a jegy vagy bejegyzés objektumokhoz)

source: To create a new Dynamic Field Type is necessary to:
hu: Egy új dinamikus mező típus létrehozásához a következők szükségesek:

source: Create a Dynamic Field Driver
hu: Hozzon létre egy dinamikus mező illesztőprogramot

source: This is the main module of the new field.
hu: Ez az új mező fő modulja.

source: Create or use an existing Admin Dialog
hu: Hozzon létre vagy használjon egy meglévő adminisztrátori párbeszédablakot

source: To have a management interface and set its configuration options.
hu: Egy kezelőfelület megszerzéséhez, és a konfigurációs beállításainak megadásához.

source: Create a Configuration File
hu: Hozzon létre egy beállítófájlt

source: To register the new field in the Backend (or new Admin Dialogs in the framework if needed) and be able to create instances or it.
hu: Az új mező regisztrálásához a háttérprogramban (vagy a keretrendszerben lévő új adminisztrátori párbeszédablakokban, ha szükséges), valamint hogy képes legyen példányokat vagy azt létrehozni.

source: Create a New Dynamic Field Type (for other objects)
hu: Egy új dinamikus mező típus létrehozása (egyéb objektumokhoz)

source: To create a new Dynamic Field Type for other objects is necessary to:
hu: Egy új dinamikus mező típus létrehozásához más objektumoknál a következők szükségesek:

source: Create an Object Type Delegate
hu: Hozzon létre egy objektumtípus delegáltat

source: This is necessary, even if the "other object" does not require any specific data handling in its functions (e.g. after a value is set). All Object Type Delegates must implement the functions that the Backend requires.
hu: Ez akkor is szükséges, ha a „másik objektum” nem igényel semmilyen különleges adatkezelést a függvényeiben (például egy érték beállítása után). Az összes objektumtípus delegáltnak meg kell valósítania azokat a függvényeket, amelyeket a háttérprogram igényel.

source: Take a look in the current Object Type Delegates to implement the same functions, even if they just return a successful value for the "other object".
hu: Vessen egy pillantást a jelenlegi objektumtípus delegáltakra ugyanazon függvények megvalósításához még akkor is, ha azok csak egy sikeres értéket adnak vissza a „másik objektumnál”.

source: Implement Dynamic Fields in the Frontend Modules
hu: Valósítsa meg a dinamikus mezőket az előtétprogram modulokban

source: To be able to use the Dynamic Fields.
hu: Hogy képes legyen használni a dinamikus mezőket.

source: To register the new field in the Backend (or new Admin Dialogs in the framework if needed) and be able to create instances or it. And make the needed settings to show, hide or show the Dynamic Fields as Mandatory in the new screens.
hu: Az új mező regisztrálásához a háttérprogramban (vagy a keretrendszerben lévő új adminisztrátori párbeszédablakokban, ha szükséges), valamint hogy képes legyen példányokat vagy azt létrehozni. És végezze el a szükséges beállításokat az új képernyőkön történő megjelenítéshez, elrejtéshez vagy a dinamikus mezők kötelezőként való megjelenítéséhez.

source: Create a New package to use Dynamic Fields
hu: Egy új csomag létrehozása a dinamikus mezők használatához

source: To create a package to use existing dynamic fields is necessary to:
hu: Egy csomag létrehozásához a meglévő dinamikus mezők használata érdekében a következők szükségesek:

source: To give the end user the possibility to show, hide or show the Dynamic Fields as Mandatory in the new screens.
hu: Hogy lehetőséget adjon a végfelhasználónak az új képernyőkön történő megjelenítéshez, elrejtéshez vagy a dinamikus mezők kötelezőként való megjelenítéséhez.

source: Extend Backend and Drivers Functionalities
hu: A háttérprogram és az illesztőprogramok funkcionalitásainak kiterjesztése

source: It might be possible that the Backend object does not have a needed function for custom developments, or could also be possible that it has the function needed, but the return format does not match the needs of the custom development, or that a new behavior is needed to execute the new or the old functions.
hu: Lehetséges lehet, hogy a háttérprogram objektum nem rendelkezik egy szükséges függvénnyel az egyéni fejlesztésekhez, vagy az is előfordulhat, hogy megvan ugyan a szükséges függvénye, de a visszatérési formátum nem felel meg az egyéni fejlesztés szükségleteinek, vagy hogy egy új viselkedés az új vagy a régi függvények végrehajtását igényli.

source: The easiest way to do this, is to extend the current field files. For this it is necessary to create a new Backend extension file that defines the new functions and create also Drivers extensions that implement these new functions for each field. These new drivers will only need to implement the new functions since the original drivers takes care of the standard functions. All these new files do not need a constructor as they will be loaded as a base for the Backend object and the drivers.
hu: A legegyszerűbb mód ennek elvégzéséhez a jelenlegi mezőfájlok kiterjesztése. Ehhez egy olyan új háttérprogram kiterjesztésfájlt szükséges létrehozni, amely meghatározza az új függvényeket, és olyan illesztőprogram kiterjesztéseket is létre kell hozni, amelyek megvalósítják ezeket az új függvényeket minden egyes mezőnél. Ezeknek az új illesztőprogramoknak csak az új függvényeket kell majd megvalósítaniuk, mivel az eredeti illesztőprogramok törődnek a szabványos függvényekkel. Ezen új fájlok egyikének sincs szüksége konstruktorra, mivel ezek egy alapként lesznek betöltve a háttérprogram objektumhoz és az illesztőprogramokhoz.

source: The only restrictions are that the functions should be named different than the ones on the Backend and Drivers, otherwise they will be overwritten with current objects.
hu: Az egyetlen korlátozás, hogy a függvényeket eltérően kell elnevezni a háttérprogramnál és az illesztőprogramnál lévőknél, különben felül fognak íródni a jelenlegi objektumokkal.

source: Put the new Backend extension into the <filename>DynamicField</filename> directory (e.g. <filename>/$OTRS_HOME/Kernel/System/DynamicField/NewPackageBackend.pm</filename> and its Drivers in <filename>/$OTRS_HOME/Kernel/System/DynamicField/Driver/NewPackage*.pm</filename>).
hu: Tegye az új háttérprogram kiterjesztést a <filename>DynamicField</filename> könyvtárba (például <filename>/$OTRS_HOME/Kernel/System/DynamicField/NewPackageBackend.pm</filename> és az illesztőprogramjait a <filename>/$OTRS_HOME/Kernel/System/DynamicField/Driver/NewPackage*.pm</filename> fájlokba).

source: New behaviors only need a small setting in the extensions configuration file.
hu: Az új viselkedéseknek csak egy kis beállítás szükséges a kiterjesztések beállítófájljában.

source: To create new Backend functions is needed to:
hu: Az új háttérprogram függvények létrehozásához a következők szükségesek:

source: Create a New Backend extension module
hu: Hozzon létre egy új háttérprogram kiterjesztés modult

source: To define only the new functions.
hu: Csak az új függvények meghatározásához.

source: Create the Dynamic Fields Driver extensions
hu: Hozza létre a dinamikus mezők illesztőprogram kiterjesztéseit

source: To implement only the new functions.
hu: Csak az új függvények megvalósításához.

source: Implement New Dynamic Fields functions in the Frontend Modules
hu: Valósítsa meg az új dinamikus mezők függvényeit az előtétprogram modulokban

source: To be able to use the new Dynamic Fields functions.
hu: Hogy képes legyen használni az új dinamikus mezők függvényeit.

source: To register the new backend and drivers extensions and behaviors.
hu: Az új háttérprogram és az illesztőprogramok kiterjesztéseinek és viselkedéseinek regisztrálásához.

source: Other Extensions
hu: Egyéb kiterjesztések

source: Other extensions could be a combination of the above examples.
hu: Egyéb kiterjesztések lehetnek a fenti példák kombinációi.

source: Creating a Dynamic Field Functionality Extension
hu: Egy dinamikus mező funkcionalitás kiterjesztés létrehozása

source: To illustrate this process a new Dynamic Field functionality extension for the function <emphasis>Foo</emphasis> will be added to the Backend Object as well as in the Text field driver.
hu: Ezen folyamat bemutatásához a <emphasis>Foo</emphasis> függvénynél egy új dinamikus mező funkcionalitás kiterjesztés lesz hozzáadva a háttérprogram objektumhoz, valamint a szövegmező illesztőprogramba.

source: To create this extension we will create 3 files: a Configuration File (XML) to register the modules, a Backend extension (Perl) to define the new function, and a Text field Driver extension (Perl) that implements the new function for Text fields.
hu: A kiterjesztés létrehozásához három fájlt fogunk létrehozni: egy beállítófájlt (XML) a modulok regisztrálásához, egy háttérprogram kiterjesztést (Perl) az új függvény meghatározásához, és egy szövegmező illesztőprogram kiterjesztést (Perl), amely megvalósítja az új függvényt a szövegmezőknél.

source: File Structure:
hu: Fájlszerkezet:

source: $HOME (e. g. /opt/otrs/) | ... |--/Kernel/ | |--/Config/ | | |--/Files/ | | | |DynamicFieldFooExtension.xml ... | |--/System/ | | |--/DynamicField/ | | | FooExtensionBackend.pm | | | |--/Driver/ | | | | |FooExtensionText.pm ...
hu: $HOME (például /opt/otrs/) | ... |--/Kernel/ | |--/Config/ | | |--/Files/ | | | |DynamicFieldFooExtension.xml ... | |--/System/ | | |--/DynamicField/ | | | FooExtensionBackend.pm | | | |--/Driver/ | | | | |FooExtensionText.pm ...

source: Dynamic Field Foo Extension files
hu: Dinamikus mező Foo kiterjesztés fájlok

source: Dynamic Fields Framework
hu: Dinamikus mezők keretrendszer

source: Before creating new Dynamic Fields is necessary to understand its framework and how OTRS screens interact with them, as well as their underlying API.
hu: Az új dinamikus mezők létrehozása előtt szükséges megérteni azok keretrendszerét, és hogy az OTRS képernyők hogyan lépnek kölcsönhatásba azokkal, valamint a mögöttes API-t.

source: The following picture shows the architecture of the Dynamic Fields framework.
hu: A következő kép a dinamikus mezők keretrendszer szerkezetét mutatja be.

source: Dynamic Fields Architecture
hu: Dinamikus mezők szerkezete

source: Dynamic Field Backend Modules
hu: Dinamikus mező háttérprogram modulok

source: Dynamic Field (Backend)
hu: Dinamikus mező (háttérprogram)

source: Normally called as <literal>BackendObject</literal> in the frontend modules is the mediator between the frontend modules and each specific Dynamic Field implementation or Driver. It defines a Generic middle API for all Dynamic Field Drivers, and each Driver has the responsibility to implement the middle API for the specific needs for the field.
hu: Az előtétprogram modulokban normális esetben a <literal>BackendObject</literal> nevű objektum a közvetítő az előtétprogram modulok és az egyes konkrét dinamikus mező megvalósítás vagy illesztőprogram között. Ez határoz meg egy általános közbenső API-t az összes dinamikus mező illesztőprogramhoz, és az egyes illesztőprogramok felelőssége a közbenső API megvalósítása a mező sajátos szükségleteihez.

source: The Dynamic Field Backend is the master controller of all the Drivers. Each function in this module is responsible to check the required parameters and call the same function in the specific Driver according to the Dynamic Field Configuration parameter received.
hu: A dinamikus mező háttérprogram az összes illesztőprogram fő vezérlője. Ebben a modulban minden egyes függvény felelős a szükséges paraméterek ellenőrzéséért, és ugyanazon függvény meghívásáért az adott illesztőprogramban a kapott dinamikus mező beállítási paraméter szerint.

source: This module is also responsible to call specific functions on each Object Type Delegate (like Ticket or Article) e.g. to add a history entry or fire an event.
hu: Ez a modul felelős bizonyos függvények meghívásáért is minden egyes objektumtípus delegáltnál (úgymint jegy vagy bejegyzés). Például egy előzmény bejegyzés hozzáadásához vagy egy esemény elsütéséhez.

source: This module is located in <filename>$OTRS_HOME/Kernel/System/DynamicField/Backend.pm</filename>.
hu: Ez a modul az <filename>$OTRS_HOME/Kernel/System/DynamicField/Backend.pm</filename> fájlban található.

source: Dynamic Field Drivers
hu: Dinamikus mező illesztőprogramok

source: A Dynamic Field Driver is the implementation of the Dynamic Field. Each Driver must implement all the mandatory functions specified in the Backend (there are some functions that depends on a behavior and it is not needed to implement those if the Dynamic Field does not have that particular behavior).
hu: Egy dinamikus mező illesztőprogram a dinamikus mező megvalósítása. Minden egyes illesztőprogramnak meg kell valósítania a háttérprogramban meghatározott összes kötelező függvényt (van néhány olyan függvény, amely egy viselkedéstől függ, és nem szükséges megvalósítani azokat, ha a dinamikus mező nem rendelkezik azzal a bizonyos viselkedéssel).
