Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: A Driver is responsible to know how to get its own value or values from a web request, or from a profile (like a search profile). It also needs to know the HTML code to render the field in edit or display screens, or how to interact with the stats module, among other functions.
hu: Egy illesztőprogram felelős annak ismeretéért, hogy hogyan kérje le a saját értékét vagy értékeit egy webkérésből vagy egy profilból (mint például egy keresési profilból). Szükséges tudnia a HTML kódot is a szerkesztő vagy megjelenítő képernyőkön lévő mező megjelenítéséhez, vagy hogy hogyan lépjen kölcsönhatásba a statisztikák modullal, többek között a függvényekkel.

source: These modules are located in <filename>$OTRS_HOME/Kernel/System/DynamicField/Driver/*.pm</filename>.
hu: Ezek a modulok az <filename>$OTRS_HOME/Kernel/System/DynamicField/Driver/*.pm</filename> fájlokban találhatók.

source: It exists some base drivers like <filename>Base.pm</filename>, <filename>BaseText.pm</filename>, <filename>BaseSelect.pm</filename> and <filename>BaseDateTime.pm</filename>, that implements common functions for certain drivers (e.g. Driver <filename>TextArea.pm</filename> uses <filename>BaseText.pm</filename> that also uses <filename>Base.pm</filename> then <literal>TextArea</literal> only needs to implement the functions that are missing in <filename>Base.pm</filename> and <filename>BateText.pm</filename> or the ones that are special cases).
hu: Létezik néhány alap illesztőprogram, úgymint <filename>Base.pm</filename>, <filename>BaseText.pm</filename>, <filename>BaseSelect.pm</filename> és <filename>BaseDateTime.pm</filename>, amely gyakori függvényeket valósít meg bizonyos illesztőprogramokhoz (például a <filename>TextArea.pm</filename> illesztőprogram a <filename>BaseText.pm</filename> fájlt használja, amely a <filename>Base.pm</filename> fájlt használja, ekkor a <literal>TextArea</literal> csak azon függvények megvalósítását igényli, amelyek hiányoznak a <filename>Base.pm</filename> és <filename>BateText.pm</filename> fájlokból, vagy azokat, amelyek különleges esetek).

source: The following is the Drivers inheritance tree:
hu: A következő az illesztőprogramok öröklődési fája:

source: Object Type Delegate
hu: Objektumtípus delegált

source: An Object Type Delegate is responsible to perform specific functions on the object linked to the dynamic field. These functions are triggered by the Backend object as they are needed.
hu: Egy objektumtípus delegált felelős bizonyos függvények végrehajtásáért a dinamikus mezőhöz kapcsolt objektumon. Ezeket a függvényeket a háttérprogram objektum aktiválja, amint szükség van rájuk.

source: These modules are located in <filename>$OTRS_HOME/Kernel/System/DynamicField/ObjectType/*.pm</filename>.
hu: Ezek a modulok az <filename>$OTRS_HOME/Kernel/System/DynamicField/ObjectType/*.pm</filename> fájlokban találhatók.

source: Dynamic Fields Admin Modules
hu: Dinamikus mezők adminisztrátori moduljai

source: To manage the Dynamic Fields (Add, Edit and List) a series of modules has been already developed. There is one specific master module (<filename>AdminDynamicField.pm</filename>) that shows the list of defined Dynamic Fields, and from within other modules are called to create new Dynamic Fields or modify an existing ones.
hu: A dinamikus mezők kezeléséhez (hozzáadás, szerkesztés és felsorolás) már egy csomó modul van kifejlesztve. Van egy bizonyos fő modul (<filename>AdminDynamicField.pm</filename>), amely megjeleníti a meghatározott dinamikus mezők listáját, és más modulokon belülről hívják meg új dinamikus mezők létrehozásához vagy a meglévők módosításához.

source: Normally a Dynamic Field Driver needs its own Admin Module (Admin Dialog) to define its properties. This dialog might differ from other Drivers. But this is not mandatory, Drivers can share Admin Dialogs, if they can provide needed information for all the Drivers that are linked to them, no matter if they are from different type. What is mandatory is that each Driver must be linked to an Admin Dialog (e.g. Text and TextArea Drivers share <filename>AdminDynamicFieldText.pm</filename> Admin Dialog, and Date and Date/Time Drivers share <filename>AdminDynamicFieldDateTime.pm</filename> Admin Dialog).
hu: Normális esetben egy dinamikus mező illesztőprogramnak saját adminisztrátori modulra van szüksége (adminisztrátori párbeszédablak) a tulajdonságai meghatározásához. Ez a párbeszédablak esetleg eltérhet a többi illesztőprogramtól. De ez nem kötelező, az illesztőprogramok megoszthatják az adminisztrátori párbeszédablakokat, ha szükséges információkat biztosíthatnak az összes olyan illesztőprogramhoz, amelyek hozzájuk vannak kapcsolva, nem számít, hogy eltérő típusból származnak. Ami kötelező, hogy minden egyes illesztőprogramnak hozzákapcsolva kell lennie egy adminisztrátori párbeszédablakhoz (például a szöveg és a szövegterület illesztőprogramok megosztják az <filename>AdminDynamicFieldText.pm</filename> adminisztrátori párbeszédablakot, és a dátum és a dátum/idő illesztőprogramok megosztják az <filename>AdminDynamicFieldDateTime.pm</filename> adminisztrátori párbeszédablakot).

source: Admin Dialogs follow the normal OTRS Admin Module rules and architecture. But for standardization all configuration common parts to all Dynamic Fields should have the same look and feel among all Admin Dialogs.
hu: Az adminisztrátori párbeszédablakok a normál OTRS adminisztrátori modulszabályokat és szerkezetet követik. De a szabványosításhoz az összes beállítás közös részének az összes dinamikus mezőnél ugyanolyan megjelenésűnek kell lennie az összes adminisztrátori párbeszédablaknál.

source: These modules are located in <filename>$OTRS_HOME/Kernel/Modules/*.pm</filename>.
hu: Ezek a modulok az <filename>$OTRS_HOME/Kernel/Modules/*.pm</filename> fájlokban találhatók.

source: Each Admin Dialog needs its corresponding HTML template file (<filename>.tt</filename>).
hu: Minden adminisztrátori párbeszédablaknak szüksége van a neki megfelelő HTML sablonfájlra (<filename>.tt</filename>).

source: Dynamic Fields Core Modules
hu: Dinamikus mezők alapmoduljai

source: This modules reads and writes the Dynamic Fields information from and to the database tables.
hu: Ezek a modulok olvassák és írják a dinamikus mezők információit az adatbázistáblákban.

source: <filename>DynamicField.pm</filename> Core Module
hu: <filename>DynamicField.pm</filename> alapmodul

source: This module is responsible to manage the Dynamic Field definitions. It provides the basic API for add, change, delete, list and get Dynamic Fields. This module is located in <filename>$OTRS_HOME/Kernel/System/DynamicField.pm</filename>.
hu: Ez a modul felelős a dinamikus mező meghatározások kezeléséért. Ez biztosítja az alap API-t a hozzáadáshoz, megváltoztatáshoz, törléshez, felsoroláshoz és a dinamikus mezők lekéréséhez. Ez a modul az <filename>$OTRS_HOME/Kernel/System/DynamicField.pm</filename> fájlban található.

source: <filename>DynamicFieldValue.pm</filename> Core Module
hu: <filename>DynamicFieldValue.pm</filename> alapmodul

source: This module is responsible to read and write Dynamic Field values into the form and into the database. This module is highly used by the Drivers and is located in <filename>$OTRS_HOME/Kernel/System/DynamicFieldValue.pm</filename>.
hu: Ez a modul felelős a dinamikus mező értékeinek olvasásáért és írásáért az űrlapon és az adatbázisban. Ezt a modult erősen használják az illesztőprogramok, és az <filename>$OTRS_HOME/Kernel/System/DynamicFieldValue.pm</filename> fájlban található.

source: Dynamic Fields Database Tables
hu: Dinamikus mezők adatbázistáblái

source: There are two tables in the database to store the dynamic field information:
hu: Két tábla van az adatbázisban a dinamikus mező információinak tárolásához:

source: <emphasis>dynamic_field</emphasis>: Used by the Core Module <filename>DynamicField.pm</filename>, it stores the Dynamic Field definitions.
hu: <emphasis>dynamic_field</emphasis>: a <filename>DynamicField.pm</filename> alapmodul használja, és a dinamikus mező meghatározásokat tárolja.

source: <emphasis>dynamic_field_value</emphasis>: Used by the Core Module <filename>DynamicFieldValue.pm</filename> to save the Dynamic Field values for each Dynamic Field and each Object Type instance.
hu: <emphasis>dynamic_field_value</emphasis>: a <filename>DynamicFieldValue.pm</filename> alapmodul használja a dinamikus mező értékeinek mentéséhez minden egyes dinamikus mező és minden egyes objektumtípus példánynál.

source: Dynamic Fields Configuration Files
hu: Dinamikus mezők beállítófájljai

source: The Backend module needs a way to know which Drivers exists and since the amount of Drivers can be easily extended. The easiest way to manage them is to use the system configuration, where the information of Dynamic Field Drivers and Object Type Drivers can be stored and extended.
hu: A háttérprogram modulnak szüksége van egy módra megtudni azt, hogy mely illesztőprogramok léteznek, mivel az illesztőprogramok mennyisége egyszerűen kiterjeszthető. Ezek kezelésének legegyszerűbb módja a rendszerbeállítás használata, ahol a dinamikus mező illesztőprogramok és az objektumtípus illesztőprogramok információi eltárolhatók és kiterjeszthetők.

source: The master Admin Module also needs to know this information about the available Dynamic Field Drivers to use the Admin Dialog linked with, to create or modify the Dynamic Fields.
hu: A fő adminisztrátori modulnak is szükséges tudnia ezeket az információkat az elérhető dinamikus mező illesztőprogramokról a hozzájuk kapcsolt adminisztrátori párbeszédablakok használatához, a dinamikus mezők létrehozásához vagy módosításához.

source: Frontend modules need to read the system configuration to know which Dynamic Fields are active for each screen and which ones are also mandatory. For example: <literal>Ticket::Frontend::AgentTicketPhone###DynamicField</literal> stores the active, mandatory and inactive Dynamic Fields for New Phone Ticket Screen.
hu: Az előtétprogram moduloknak szükségük van a rendszerbeállítások olvasására megtudni azt, hogy mely dinamikus mezők vannak bekapcsolva az egyes képernyőknél, és melyek kötelezőek. Például a <literal>Ticket::Frontend::AgentTicketPhone###DynamicField</literal> tárolja az aktív, kötelező és inaktív dinamikus mezőket az új telefonos jegy képernyőnél.

source: Dynamic Field Interaction With Frontend Modules
hu: Dinamikus mező kölcsönhatása az előtétprogram modulokkal

source: Knowing about how Frontend modules interact with Dynamic fields is not strictly necessary to extend Dynamic Fields for the Ticket or Article objects, since all the screens that could use the Dynamic Fields are already prepared. But in case of custom developments or to extend the Dynamic Fields to other objects is very useful to know how to access Dynamic Fields framework from a Frontend Module.
hu: Ismerve azt, hogy az előtétprogram modulok hogyan lépnek kölcsönhatásba a dinamikus mezőkkel, nem feltétlenül szükséges a dinamikus mezők kiterjesztése a jegy vagy bejegyzés objektumokhoz, mivel már elő van készítve az összes olyan képernyő, amely dinamikus mezőket tud használni. De egyéni fejlesztések esetén vagy a dinamikus mezők más objektumokhoz történő kiterjesztéséhez nagyon hasznos tudni, hogy a dinamikus mezők keretrendszere hogyan érhető el egy előtétprogram modulból.

source: The following picture shows a simple example of how the Dynamic Fields interact with other OTRS framework parts.
hu: A következő kép egy egyszerű példáját mutatja be annak, hogy a dinamikus mezők hogyan lépnek kölcsönhatásba az OTRS keretrendszer többi részével.

source: Dynamic Field Interaction
hu: Dinamikus mezők kölcsönhatása

source: The first step is that the Frontend module reads the configured Dynamic Fields. For example <literal>AgentTicketNote</literal> should read <literal>Ticket::Frontend::AgentTicketNote###DynamicField</literal> setting. This setting can be used as the filter parameter for DynamicField Core Module function <code>DynamicFieldListGet()</code>. The screen can store the results of this function to have the list of the Dynamic Fields activated for this particular screen.
hu: Az első lépés, hogy az előtétprogram modul beolvassa a beállított dinamikus mezőket. Például az <literal>AgentTicketNote</literal> modulnak be kell olvasnia a <literal>Ticket::Frontend::AgentTicketNote###DynamicField</literal> beállítást. Ez a beállítás használható szűrőparaméterként a <code>DynamicFieldListGet()</code> dinamikus mező alapmodul függvénynél. A képernyő tárolhatja ennek a függvénynek az eredményeit, hogy meglegyen az aktivált dinamikus mezők listája ennél a bizonyos képernyőnél.

source: Next, the screen should try to get the values from the web request. It can use the Backend Object function <code>EditFieldValueGet()</code> for this purpose, and can use this values to trigger ACLs. The Backend Object will use each Driver to perform the specific actions for all functions.
hu: Ezután a képernyőnek meg kell próbálnia lekérni az értékeket a webkérésből. Erre a célra használhatja az <code>EditFieldValueGet()</code> háttérprogram-objektum függvényt, és használhatja ezeket az értékeket az ACL-ek aktiválásához. A háttérprogram-objektum minden egyes illesztőprogramot használni fog a különleges műveletek végrehajtásához az összes függvénynél.

source: To continue, the screen should get the HTML for each field to display it. The Backend Object function <code>EditFieldRender()</code> can be used to perform this action and the ACLs restriction as well as the Values from the web request can be passed to this function in order to get better results. In case of a submit the screen could also use the BackendObject function <code>EditFieldValueValidate()</code> to check the mandatory fields.
hu: A folytatáshoz a képernyőnek le kell kérnie a HTML-t minden egyes mezőhöz annak megjelenítéséhez. Az <code>EditFieldRender()</code> háttérprogram-objektum függvény használható ezen művelet és az ACL-ek korlátozásának végrehajtásához, valamint a webkérésből származó értékek átadhatók ennek a függvénynek azért, hogy jobb eredményeket kapjon. Egy elküldés esetén a képernyő használhatja az <code>EditFieldValueValidate()</code> háttérprogram-objektum függvényt is a kötelező mezők ellenőrzéséhez.

source: Other screens could use <code>DisplayFieldRender()</code> instead of <code>EditFieldRender()</code> if the screen only shows the field value, and in such case no value validation is needed.
hu: A többi képernyő használhatja a <code>DisplayFieldRender()</code> függvényt az <code>EditFieldRender()</code> helyett, ha a képernyő csak a mezőértéket jeleníti meg, és ilyen esetben nincs szükség értékellenőrzésre.

source: To store the value of the Dynamic Field is necessary to get the Object ID. For this example if the Dynamic Field is linked to a ticket object, the screen should already have the TicketID, otherwise if the field is linked to an article object in order to set the value of the field is necessary to create the article first. <code>ValueSet()</code> from the Backend Object can be used to set the Dynamic Field value.
hu: A dinamikus mező értékének tárolásához szükséges az objektumazonosító lekérése. Ennél a példánál ha a dinamikus mező hozzá van kapcsolva egy jegy objektumhoz, akkor a képernyőnek már rendelkeznie kell a jegyazonosítóval, egyébként ha a mező hozzá van kapcsolva egy bejegyzés objektumhoz azért, hogy beállítsa a mező értékét, akkor először a bejegyzés létrehozása szükséges. A háttérprogram-objektumból a <code>ValueSet()</code> függvény használható a dinamikus mező értékének beállításához.

source: In summary the Frontend modules does not need to know how each Dynamic Field works internally to get or set their values or to display them. It just needs to call the Backend Object module and use the fields in a generic way.
hu: Összefoglalva, az előtétprogram moduloknak nem szükséges tudniuk, hogy az egyes dinamikus mezők hogyan működnek belsőleg azért, hogy lekérjék vagy beállítsák az értékeiket vagy megjelenítsék azokat. Egyszerűen csak meg kell hívnia a háttérprogram-objektum modult, és általános módon kell használnia a mezőket.

source: Dynamic Field Template for Admin Dialog Example
hu: Dinamikus mező sablon az adminisztrátori párbeszédablak példához

source: The template is the place where the HTML code of the dialog is stored.
hu: A sablon az a hely, ahol a párbeszédablak HTML kódja el van tárolva.

source: In this section an Admin Dialog template for the password Dynamic Field is shown and explained.
hu: Ebben a szakaszban a jelszó dinamikus mezőhöz egy adminisztrátori párbeszédablak sablon van megjelenítve és elmagyarázva.

source: # -- # AdminDynamicFieldPassword.tt - provides HTML form for AdminDynamicFieldPassword # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # --
hu: # -- # AdminDynamicFieldPassword.tt - HTML űrlapot biztosít az AdminDynamicFieldPassword modulhoz # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # --

source: This is common header that can be found in common OTRS modules.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban.

source: <div class="MainBox ARIARoleMain LayoutFixedSidebar SidebarFirst"> <h1>[% Translate("Dynamic Fields") | html %] - [% Translate(Data.ObjectTypeName) | html %]: [% Translate(Data.Mode) | html %] [% Translate(Data.FieldTypeName) | html %] [% Translate("Field") | html %]</h1> <div class="Clear"></div> <div class="SidebarColumn"> <div class="WidgetSimple"> <div class="Header"> <h2>[% Translate("Actions") | html %]</h2> </div> <div class="Content"> <ul class="ActionList"> <li> <a href="[% Env("Baselink") %]Action=AdminDynamicField" class="CallForAction"><span>[% Translate("Go back to overview") | html %]</span></a> </li> </ul> </div> </div> </div>
hu: <div class="MainBox ARIARoleMain LayoutFixedSidebar SidebarFirst"> <h1>[% Translate("Dynamic Fields") | html %] - [% Translate(Data.ObjectTypeName) | html %]: [% Translate(Data.Mode) | html %] [% Translate(Data.FieldTypeName) | html %] [% Translate("Mező") | html %]</h1> <div class="Clear"></div> <div class="SidebarColumn"> <div class="WidgetSimple"> <div class="Header"> <h2>[% Translate("Műveletek") | html %]</h2> </div> <div class="Content"> <ul class="ActionList"> <li> <a href="[% Env("Baselink") %]Action=AdminDynamicField" class="CallForAction"><span>[% Translate("Ugrás vissza az áttekintőhöz") | html %]</span></a> </li> </ul> </div> </div> </div>

source: This part of the code has the main box and also the actions side bar. No modifications are needed in this section.
hu: A kód ezen része rendelkezik a fő dobozzal és a műveletek oldalsávval is. Nincs szükség módosításokra ebben a szakaszban.

source: In this section of the code is defined the right part of the dialog. Notice that the value of the <literal>Action</literal> hidden input must match with the name of the Admin Dialog.
hu: A kód ezen szakaszában van meghatározva a párbeszédablak jobboldali része. Figyelje meg, hogy a rejtett <literal>Action</literal> beviteli mező értékének egyeznie kell az adminisztrátori párbeszédablak nevével.
