Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: <emphasis>Rule</emphasis>: For interactions, always use elements that can receive focus, such as <literal>a</literal>, <literal>input</literal>, <literal>select</literal> and <literal>button</literal>.
hu: <emphasis>Szabály</emphasis>: A kölcsönhatásoknál mindig olyan elemeket használjon, amelyek megkaphatják a fókuszt, mint például <literal>a</literal>, <literal>input</literal>, <literal>select</literal> és <literal>button</literal>.

source: <emphasis>Rule</emphasis>: Make sure that the user can always identify the nature of the interaction (see rules about non-textual content and labelling of form elements).
hu: <emphasis>Rule</emphasis>: Győződjön meg arról, hogy a felhasználó mindig képes-e azonosítani a kölcsönhatás természetét (nézze meg a szabályokat a nem szöveges tartalommal és az űrlapelemek címkézésével kapcsolatban).

source: Goal: <emphasis>Make dynamic changes known to the user.</emphasis>
hu: Cél: <emphasis>Tudatni a felhasználóval a dinamikus változtatásokat.</emphasis>

source: A special area of accessibility problems are dynamic changes in the user interface, either by JavaScript or also by AJAX calls. The screen reader will not tell the user about changes without special precautions. This is a difficult topic and cannot yet be completely explained here.
hu: Az akadálymentesítési problémák egy különleges területe a dinamikus változtatások a felhasználói felületen, amelyeket JavaScript vagy AJAX hívások okoznak. A képernyőolvasó nem fog beszélni a felhasználónak a változtatásokról különleges óvintézkedések nélkül. Ez egy bonyolult téma, és még nem lehet itt teljesen elmagyarázni.

source: <emphasis>Rule</emphasis>: Always use the validation framework <literal>OTRS.Validate</literal> for form validation.
hu: <emphasis>Szabály</emphasis>: Mindig használja az <literal>OTRS.Validate</literal> érvényesítő keretrendszert az űrlap érvényesítéséhez.

source: This will make sure that the error tooltips are being read by the screen reader. That way the blind user a) knows the item which has an error and b) get a text describing the error.
hu: Ez biztosítani fogja, hogy a hiba buboréksúgókat felolvassa a képernyőolvasó. Ily módon a vak felhasználó a) megtudja azt az elemet, amelynek hibája van, és b) kap egy szöveget, amely leírja a hibát.

source: <emphasis>Rule</emphasis>: Use the function <literal>OTRS.UI.Accessibility.AudibleAlert()</literal> to notify the user about other important UI changes.
hu: <emphasis>Szabály</emphasis>: Használja az <literal>OTRS.UI.Accessibility.AudibleAlert()</literal> függvényt, hogy értesítse a felhasználót az egyéb fontos felhasználói felületet érintő változtatásokról.

source: <emphasis>Rule</emphasis>: Use the <literal>OTRS.UI.Dialog</literal> framework to create modal dialogs. These are already optimized for accessibility.
hu: <emphasis>Szabály</emphasis>: Használja az <literal>OTRS.UI.Dialog</literal> keretrendszert a kizárólagos párbeszédablakok létrehozásához. Ezek már optimalizálva vannak az akadálymentesítéshez.

source: General screen reader optimizations
hu: Általános képernyőolvasó optimalizálások

source: Goal: <emphasis>Help screen readers with their work.</emphasis>
hu: Cél: <emphasis>segíteni a képernyőolvasókat a munkájukban.</emphasis>

source: <emphasis>Rule</emphasis>: Each page must identify its own main language so that the screen reader can choose the right speech synthesis engine.
hu: <emphasis>Szabály</emphasis>: Minden egyes oldalnak azonosítania kell a saját fő nyelvét azért, hogy a képernyőolvasók ki tudják választani a megfelelő beszédszintetizátor motort.

source: Example: <literal>&lt;html lang="fr"&gt;...&lt;/html&gt;</literal>
hu: Példa: <literal>&lt;html lang="hu"&gt;...&lt;/html&gt;</literal>

source: Code Style Guide
hu: Kódolási stílus irányelvek

source: In order to preserve the consistent development of the OTRS project, we have set up guidelines regarding style for the different programming languages.
hu: Az OTRS projekt következetes fejlesztésének megtartása érdekében irányelveket fektettünk le a stílusra vonatkozóan a különböző programnyelvekhez.

source: Sending Contributions
hu: Hozzájárulások küldése

source: The source code of OTRS and additional public modules can be found on <ulink url="http://otrs.github.io">github</ulink>. From there you can get to the listing of all available repositories. It also describes the currently active branches and where contributions should go to (stable vs. development branches).
hu: Az OTRS és a további nyilvános modul forráskódja megtalálható a <ulink url="http://otrs.github.io">githubon</ulink>. Innen eljuthat az összes elérhető tároló felsorolásához. Leírja a jelenleg aktív ágakat is, és hogy hova kell kerülniük a hozzájárulásoknak (stabil vagy fejlesztői ágak).

source: It is highly recommended that you use the OTRS code quality checker OTRSCodePolicy as described in <link linkend="useful-tools">the development environment chapter</link> even before sending in your contributions. If your code does not validate against this tool, it will likely not be accepted.
hu: Erősen ajánlott a <link linkend="useful-tools">fejlesztői környezet fejezetben</link> bemutatott OTRSCodePolicy OTRS kódminőség-ellenőrző használata, még mielőtt elküldené a hozzájárulásait. Ha a kódját nem érvényesíti ezzel az eszközzel, akkor valószínűleg nem fogják elfogadni.

source: The easiest way to send your contributions to the OTRS developer's team is by creating a "pull request" in github. Please take a look at the instructions on <ulink url="https://help.github.com">github</ulink>, specifically about <ulink url="https://help.github.com/articles/fork-a-repo">forking a repository and sending pull requests</ulink>.
hu: A legegyszerűbb módja a hozzájárulások elküldésének az OTRS fejlesztőcsapata számára egy „pull request” létrehozása a githubon. Vessen egy pillantást a <ulink url="https://help.github.com">githubon</ulink> lévő utasításokra, különösen a <ulink url="https://help.github.com/articles/fork-a-repo">tároló elágaztatására és a beolvasztási kérések küldésére</ulink>.

source: The basic workflow would look like this:
hu: Az alap munkafolyamatnak így kellene kinéznie:

source: Register at github, if you have no account yet.
hu: Regisztráljon a githubon, ha még nincs fiókja.

source: Fork the repository you want to contribute to, and checkout the branch that the changes should go in.
hu: Ágaztassa el azt a tárolót, amelynél közre szeretne működni, és váltson át arra az ágra, amelybe a változtatásokat be kell tenni.

source: Create a new development branch for your fix/feature/contribution, based on the current branch.
hu: Hozzon létre egy új fejlesztői ágat a javításhoz/szolgáltatáshoz/hozzájáruláshoz az aktuális ág alapján.

source: After you finished your changes and committed them, push your branch to github.
hu: A változtatások befejezése és a véglegesítésük után küldje be az ágat a githubra.

source: Create a pull request. The OTRS dev team will be notified about this, check your pull request and either merge it or give you some feedback about possible improvements.
hu: Hozzon létre egy beolvasztási kérést. Az OTRS fejlesztőcsapata értesülni fog erről, ellenőrizni fogják a beolvasztási kérését, és beolvasszák azt, vagy valamilyen visszajelzést adnak a lehetséges továbbfejlesztésekről.

source: It might sound complicated, but once you have this workflow set up you'll see that making contributions is extremely easy.
hu: Ez esetleg bonyolultan hangzik, de miután beállította ezt a munkafolyamatot, látni fogja, hogy a hozzájárulások elvégzése hihetetlenül egyszerű.

source: Translating the Documentation
hu: A dokumentáció fordítása

source: The OTRS admin manual can be translated via Transifex as described in <link linkend="translate"> the section on translating OTRS</link>. You can join a language team on Transifex to improve an existing translation or even suggest a new language to translate the admin manual to.
hu: Az OTRS adminisztrátori kézikönyv a Transifex oldalán keresztül fordítható az <link linkend="translate">OTRS fordításáról szóló szakaszban</link> leírtak szerint. A Transifex oldalon csatlakozhat egy nyelvi csoporthoz a meglévő fordítás javításához, vagy akár javasolhat egy új nyelvet is, amelyre az adminisztrátori kézikönyv fordítása elkészülhet.

source: It is important that the structure of the generated XML stays intact. So if the original string is <literal>Edit &lt;filename&gt;Kernel/Config.pm&lt;/filename&gt;</literal>, then the German translation has to be <literal>&lt;filename&gt;Kernel/Config.pm&lt;/filename&gt; bearbeiten</literal>, keeping the XML tags intact. Regular &lt; and &gt; signs that are escaped in the source text must also be escaped in the translations (like <literal>&amp;lt;someone@example.com&amp;gt;</literal>). Scripts and examples usually do not have to be translated (so you can just copy the source text to the translation text field in this case).
hu: Fontos, hogy az előállított XML szerkezete sértetlen maradjon. Tehát ha az eredeti szöveg <literal>Edit &lt;filename&gt;Kernel/Config.pm&lt;/filename&gt;</literal>, akkor a magyar fordításnak <literal>&lt;filename&gt;Kernel/Config.pm&lt;/filename&gt; szerkesztése</literal> kell lennie, sértetlenül megtartva az XML címkéket. A forrásszövegben átalakítva lévő szokásos &lt; és &gt; jeleknek átalakítva kell lenniük a fordításokban is (mint például <literal>&amp;lt;valaki@pelda.hu&amp;gt;</literal>). A parancsfájlokat és a példákat általában nem kell lefordítani (vagyis ebben az esetben egyszerűen átmásolhatja a forrásszöveget a fordítási szövegmezőbe).

source: Translating OTRS
hu: Az OTRS fordítása

source: The OTRS framework allows for different languages to be used in the frontend. The translations are contributed and maintained mainly by OTRS users, so <emphasis>your</emphasis> help is needed.
hu: Az OTRS keretrendszer különböző nyelvek használatát teszi lehetővé az előtétprogramon. A fordításokat többnyire az OTRS felhasználói készítik el és tartják karban, ezért az <emphasis>Ön</emphasis> segítsége is szükséges.

source: Updating an existing translation
hu: Egy meglévő fordítás frissítése

source: Starting with OTRS 4, all translations of the OTRS GUI and the public extension modules are managed via <ulink url="https://www.transifex.com">Transifex</ulink>. The OTRS project on Transifex can be found at <ulink url="https://www.transifex.com/otrs/OTRS/">https://www.transifex.com/otrs/OTRS/</ulink>.
hu: Az OTRS 4-től kezdve az OTRS grafikus felhasználói felületének és a nyilvános kiterjesztőmoduloknak az összes fordítását a <ulink url="https://www.transifex.com">Transifex</ulink> oldalán keresztül kezelik. Az OTRS projekt a <ulink url="https://www.transifex.com/otrs/OTRS/">https://www.transifex.com/otrs/OTRS/</ulink> címen található a Transifex oldalán.

source: To contribute to a translation of the OTRS GUI, an extension module or a manual, please sign up for a free translators account on <ulink url="https://www.transifex.com">Transifex</ulink>. Then you can join your language team and start updating your translation. No additional software or files required. The OTRS developers will download the translations from time to time into the OTRS source code repositories, you don't have to submit them anywhere.
hu: Az OTRS grafikus felhasználói felületének, egy kiterjesztőmodulnak vagy egy kézikönyvnek a fordításában történő közreműködéshez regisztráljon egy ingyenes fordítófiókot a <ulink url="https://www.transifex.com">Transifex</ulink> oldalán. Ezután csatlakozhat egy nyelvi csoporthoz, és elkezdheti a fordítás frissítését. Nincs szükség további szoftverekre vagy fájlokra. Az OTRS fejlesztői időről időre le fogják tölteni a fordításokat az OTRS forráskód tárolóiba, így nem kell semmit sem elküldenie sehova.

source: Adding a new frontend translation
hu: Egy új előtétprogram-fordítás hozzáadása

source: If you want to translate the OTRS framework into a new language, you can propose a new language translation on <ulink url="https://www.transifex.com/otrs/OTRS/">the Transifex OTRS project page</ulink>. After it is approved, you can just start translating.
hu: Ha új nyelvre szeretné lefordítani az OTRS keretrendszert, akkor javasolhat egy új nyelvi fordítást a <ulink url="https://www.transifex.com/otrs/OTRS/">Transifex OTRS projekt oldalán</ulink>. Miután azt elfogadták, azonnal elkezdheti a fordítást.

source: User Interface Design
hu: Felhasználó felület tervezése

source: Capitalization
hu: Nagybetűs írás

source: This section talks about how the different parts of the English user interface should be capitalized. For further information, you may want to review <ulink url="https://msdn.microsoft.com/en-us/library/dn742478.aspx">this helpful page</ulink>.
hu: Ez a szakasz azt mutatja be, hogy az angol felhasználói felület különböző részeit hogyan kell nagybetűsen írni. További információkért érdemes átnézni <ulink url="https://msdn.microsoft.com/en-us/library/dn742478.aspx">ezt a hasznos oldalt</ulink>.

source: Headings (h1-h6) and Titles (Names, such as <literal>Queue View</literal>) are set in "title style" capitalization, that means all first letters will be capitalized (with a few exceptions such as "this", "and", "or" etc.).
hu: A címsorok (h1-h6) és a címek (nevek, mint például <literal>Queue View</literal>) „címstílusú” nagy kezdőbetűs írásmódban vannak, amely azt jelenti, hogy az összes első betű nagybetűvel lesz írva (néhány kivétellel, mint például „this”, „and”, „or”, stb.).

source: Examples: <literal>Action List</literal>, <literal>Manage Customer-Group Relations</literal>.
hu: Példák: <literal>Action List</literal>, <literal>Manage Customer-Group Relations</literal>.

source: Other structural elements such as buttons, labels, tabs, menu items are set in "sentence style" capitalization (only the first letter of a phrase is capitalized), but no final dot is added to complete the phrase as a sentence.
hu: Az egyéb szerkezeti elemek (mint például gombok, címkék, lapok, menüpontok) „mondatstílusú” nagy kezdőbetűs írásmódban vannak (csak a kifejezés első betűje van nagybetűvel írva), de nincs lezáró pont hozzáadva a kifejezés mondatként való befejezéséhez.

source: Examples: <literal>First name</literal>, <literal>Select queue refresh time</literal>, <literal>Print this ticket</literal>.
hu: Példák: <literal>First name</literal>, <literal>Select queue refresh time</literal>, <literal>Print this ticket</literal>.

source: Descriptive texts and tooltip contents are written as complete sentences.
hu: A leíró szövegek és a buboréksúgó tartalmak teljes mondatként vannak írva.

source: Example: <literal>This value is required.</literal>
hu: Példa: <literal>This value is required.</literal>

source: For translations, it has to be checked if the title style capitalization is also appropriate in the target language. It might have to be changed to sentence style capitalization or something else.
hu: A fordításoknál ellenőrizni kell, hogy címstílusú nagybetűs írás megfelelő-e a célnyelven is. Lehet, hogy meg kell változtatni mondatstílusú nagybetűs írásra vagy valami másra.

source: Unit Tests
hu: Egységtesztek

source: OTRS provides a test suite which can be used to develop and run unit tests for all system related code.
hu: Az OTRS biztosít egy tesztelési alkalmazáscsomagot, amely egységtesztek fejlesztéséhez és futtatásához használható az összes rendszerrel kapcsolatos kódnál.

source: Creating a test file
hu: Egy tesztfájl létrehozása

source: The test files are stored in .t files under <filename>scripts/test/*.t</filename>. For example, let's take a look at the file <filename>scripts/test/Calendar.t</filename> for the Calendar class.
hu: A tesztfájlok .t fájlokban vannak tárolva a <filename>/scripts/test/*.t</filename> helyen. Például vessünk egy pillantást a <filename>scripts/test/Calendar.t</filename> fájlra a naptár osztálynál.

source: Every test file should ideally instantiate unit test helper object at the start, so it can benefit from some built-in methods provided by it:
hu: Minden tesztfájlnak ideális esetben példányosítania kell az egységteszt segítő objektumot az elején, így részesülhet néhány beépített metódusból, amelyet az biztosít:

source: By providing <literal>RestoreDatabase</literal> parameter to helper constructor, any database statement executed during the unit test will be rolled back at the end, making sure no permanent change has been done.
hu: A <literal>RestoreDatabase</literal> paraméternek a segítő konstruktor számára történő átadásával az egységteszt közben végrehajtott bármely adatbázis-utasítás vissza lesz állítva a végén, ezáltal azt biztosítva, hogy ne történjen végleges változtatás.

source: Like any other test suite, OTRS provides assertion methods which can be used to test conditions. For example, this is how we create a test user and test that it has been indeed created:
hu: Mint bármely egyéb tesztelési alkalmazáscsomag, az OTRS is biztosít állítás metódusokat, amelyek a feltételek teszteléséhez használhatók. Például it az látható, hogy hogyan hozunk létre egy teszt felhasználót, és hogyan teszteljük le, hogy valóban létrejött:

source: Please consult API section below for complete list of assertion methods.
hu: Nézze meg a lenti API szakaszt az állítás metódusok teljes listájáért.

source: It's always good practice to create random data in unit tests, which can help distinguish it from previously added data. Use random methods from API to get the strings and include them in your parameters:
hu: Mindig jó gyakorlat véletlenszerű adatokat létrehozni az egységtesztekben, ami segíthet megkülönböztetni az előzőleg hozzáadott adatoktól. Használja a véletlen metódusokat az API-ból, hogy megkapja a karakterláncokat, és beágyazza azokat a paraméterekbe:

source: my $RandomID = $Helper->GetRandomID(); # create test group my $GroupName = 'test-calendar-group-' . $RandomID; my $GroupID = $GroupObject->GroupAdd( Name => $GroupName, ValidID => 1, UserID => 1, ); $Self->True( $GroupID, "Test group $GroupID created" );
hu: my $RandomID = $Helper->GetRandomID(); # teszt csoport létrehozása my $GroupName = 'test-calendar-group-' . $RandomID; my $GroupID = $GroupObject->GroupAdd( Name => $GroupName, ValidID => 1, UserID => 1, ); $Self->True( $GroupID, "Test group $GroupID created" );

source: Good developers make their unit test easy to maintain. Consider putting all test cases in an array and then iterate over them with some code. This will provide an easy way to extend the test later:
hu: A jó fejlesztők az egységtesztjeiket könnyen karbantarthatóvá teszik. Fontolja meg az összes teszteset egy tömbbe történő elhelyezését, majd lépkedjen végig azokon valamilyen kóddal. Ez egyszerű módot fog biztosítani a teszt későbbi bővítéséhez:

source: # # Tests for CalendarCreate() # my @Tests = ( { Name => 'CalendarCreate - No params', Config => {}, Success => 0, }, { Name => 'CalendarCreate - All required parameters', Config => { CalendarName => "Calendar-$RandomID", Color => '#3A87AD', GroupID => $GroupID, UserID => $UserID, }, Success => 1, }, { Name => 'CalendarCreate - Same name', Config => { CalendarName => "Calendar-$RandomID", Color => '#3A87AD', GroupID => $GroupID, UserID => $UserID, }, Success => 0, }, ); for my $Test (@Tests) { # make the call my %Calendar = $CalendarObject->CalendarCreate( %{ $Test->{Config} }, ); # check data if ( $Test->{Success} ) { for my $Key (qw(CalendarID GroupID CalendarName Color CreateTime CreateBy ChangeTime ChangeBy ValidID)) { $Self->True( $Calendar{$Key}, "$Test->{Name} - $Key exists", ); } KEY: for my $Key ( sort keys %{ $Test->{Config} } ) { next KEY if $Key eq 'UserID'; $Self->IsDeeply( $Test->{Config}->{$Key}, $Calendar{$Key}, "$Test->{Name} - Data for $Key", ); } } else { $Self->False( $Calendar{CalendarID}, "$Test->{Name} - No success", ); } }
hu: # # A CalendarCreate() tesztelése # my @Tests = ( { Name => 'CalendarCreate - No params', Config => {}, Success => 0, }, { Name => 'CalendarCreate - All required parameters', Config => { CalendarName => "Calendar-$RandomID", Color => '#3A87AD', GroupID => $GroupID, UserID => $UserID, }, Success => 1, }, { Name => 'CalendarCreate - Same name', Config => { CalendarName => "Calendar-$RandomID", Color => '#3A87AD', GroupID => $GroupID, UserID => $UserID, }, Success => 0, }, ); for my $Test (@Tests) { # a hívás elvégzése my %Calendar = $CalendarObject->CalendarCreate( %{ $Test->{Config} }, ); # adatok ellenőrzése if ( $Test->{Success} ) { for my $Key (qw(CalendarID GroupID CalendarName Color CreateTime CreateBy ChangeTime ChangeBy ValidID)) { $Self->True( $Calendar{$Key}, "$Test->{Name} - $Key exists", ); } KEY: for my $Key ( sort keys %{ $Test->{Config} } ) { next KEY if $Key eq 'UserID'; $Self->IsDeeply( $Test->{Config}->{$Key}, $Calendar{$Key}, "$Test->{Name} - Data for $Key", ); } } else { $Self->False( $Calendar{CalendarID}, "$Test->{Name} - No success", ); } }

source: Prerequisites for testing
hu: Előfeltételek a teszteléshez

source: To be able to run the unit tests, you need to have all optional Perl modules installed, except those for different database backends than what you are using. Run <filename>bin/otrs.CheckModules.pl</filename> to verify your module installation.
hu: Hogy képes legyen lefuttatni az egységteszteket, arra van szüksége, hogy az összes választható Perl-modul telepítve legyen, kivéve azokat, amelyek az Ön által használt adatbázis háttérprogramoktól eltérőkhöz valók. Futtassa a <filename>bin/otrs.CheckModules.pl</filename> parancsfájlt a modultelepítés ellenőrzéséhez.

source: You also need to have an instance of the OTRS web frontend running on the FQDN that is configured in your local OTRS's <filename>Config.pm</filename> file. This OTRS instance must use the same database that is configured for the unit tests.
hu: Szüksége van egy teljes képzésű tartományneven (FQDN) futó OTRS webes előtétprogram egy példányára, amely az OTRS helyi <filename>Config.pm</filename> fájljában be van állítva. Ennek az OTRS példánynak ugyanazt az adatbázist kell használnia, amelyek az egységtesztekhez vannak beállítva.

source: Testing
hu: Tesztelés

source: To run your tests, just use <filename>bin/otrs.Console.pl Dev::UnitTest::Run --test Calendar</filename> to use <filename>scripts/test/Calendar.t</filename>.
hu: A tesztek futtatásához egyszerűen használja a <filename>bin/otrs.Console.pl Dev::UnitTest::Run --test Calendar</filename> parancsot a <filename>scripts/test/Calendar.t</filename> fájl használatához.

source: You can even run several tests at once, just supply additional test arguments to the command:
hu: Akár több tesztet is lefuttathat egyszerre, csak adjon meg további <literal>--test</literal> argumentumokat a parancsnak:

source: If you execute <filename>bin/otrs.Console.pl Dev::UnitTest::Run</filename> without any argument, it will run all tests found in the system. Please note that this can take some time to finish.
hu: Ha argumentumok nélkül hajtja végre a <filename>bin/otrs.Console.pl Dev::UnitTest::Run</filename> parancsot, akkor le fogja futtatni a rendszeren található összes tesztet. Ne feledje, hogy ez eltarthat egy ideig, amíg befejeződik.

source: Provide <literal>--verbose</literal> argument in order to see messages about successful tests too. Any errors encountered during testing will be displayed regardless of this switch, provided they are actually raised in the test.
hu: Adja meg a <literal>--verbose</literal> argumentumot annak érdekében, hogy láthassa a sikeres tesztekkel kapcsolatos üzeneteket is. A teszt során előforduló bármilyen hiba megjelenítésre kerül függetlenül ettől a kapcsolótól, és biztosítva lesz, hogy azok ténylegesen felvételre kerülnek a tesztbe.

source: Unit Test API
hu: Egységteszt API
