Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: There is a DB SLA preferences module which come with the OTRS framework. It is also possible to develop your own SLA preferences modules. The SLA preferences modules are located under <filename>Kernel/System/SLA/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of an SLA preferences module. Save it under <filename>Kernel/System/SLA/PreferencesCustom.pm</filename>. You just need 3 functions: <code>new()</code>, <code>SLAPreferencesSet()</code> and <code>SLAPreferencesGet()</code>. Make sure the function returns 1.
hu: Létezik egy DB SLA beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját SLA beállítási modulok fejlesztésére is. Az SLA beállítási modulok a <filename>Kernel/System/SLA/*.pm</filename> alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy SLA beállítások modul példája található. Mentse el a <filename>Kernel/System/SLA/PreferencesCustom.pm</filename> helyre. Mindössze három függvényre van szüksége: <code>new()</code>, <code>SLAPreferencesSet()</code> és <code>SLAPreferencesGet()</code>. Győződjön meg arról, hogy a függvény 1-et adjon vissza.

source: The interface class is called <literal>Kernel::System::SLA</literal>. The example SLA preferences may be called <literal>Kernel::System::SLA::PreferencesCustom</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::SLA</literal>. A példa SLA beállítások hívhatók <literal>Kernel::System::SLA::PreferencesCustom</literal> néven. Lent találhat egy példát.

source: # -- # Kernel/System/SLA/PreferencesCustom.pm - some user functions # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::SLA::PreferencesCustom; use strict; use warnings; use vars qw(@ISA); sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for (qw(DBObject ConfigObject LogObject)) { $Self->{$_} = $Param{$_} || die "Got no $_!"; } # preferences table data $Self->{PreferencesTable} = 'sla_preferences'; $Self->{PreferencesTableKey} = 'preferences_key'; $Self->{PreferencesTableValue} = 'preferences_value'; $Self->{PreferencesTableSLAID} = 'sla_id'; return $Self; } sub SLAPreferencesSet { my ( $Self, %Param ) = @_; # check needed stuff for (qw(SLAID Key Value)) { if ( !defined( $Param{$_} ) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } # delete old data return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . "$Self->{PreferencesTableSLAID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$Param{SLAID}, \$Param{Key} ], ); $Self->{PreferencesTableValue} .= 'PreferencesCustom'; # insert new data return $Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableSLAID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$Param{SLAID}, \$Param{Key}, \$Param{Value} ], ); } sub SLAPreferencesGet { my ( $Self, %Param ) = @_; # check needed stuff for (qw(SLAID)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $_!" ); return; } } # check if SLA preferences are available if ( !$Self->{ConfigObject}->Get('SLAPreferences') ) { return; } # get preferences return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableSLAID} = ?", Bind => [ \$Param{SLAID} ], ); my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # return data return %Data; } 1;
hu: # -- # Kernel/System/SLA/PreferencesCustom.pm - néhány felhasználói függvény # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::SLA::PreferencesCustom; use strict; use warnings; use vars qw(@ISA); sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for (qw(DBObject ConfigObject LogObject)) { $Self->{$_} = $Param{$_} || die "Nincs $_!"; } # beállítások tábla adatai $Self->{PreferencesTable} = 'sla_preferences'; $Self->{PreferencesTableKey} = 'preferences_key'; $Self->{PreferencesTableValue} = 'preferences_value'; $Self->{PreferencesTableSLAID} = 'sla_id'; return $Self; } sub SLAPreferencesSet { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for (qw(SLAID Key Value)) { if ( !defined( $Param{$_} ) ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $_!" ); return; } } # régi adatok törlése return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . "$Self->{PreferencesTableSLAID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$Param{SLAID}, \$Param{Key} ], ); $Self->{PreferencesTableValue} .= 'PreferencesCustom'; # új adatok beszúrása return $Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableSLAID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$Param{SLAID}, \$Param{Key}, \$Param{Value} ], ); } sub SLAPreferencesGet { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for (qw(SLAID)) { if ( !$Param{$_} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $_!" ); return; } } # annak ellenőrzése, hogy az SLA beállítások elérhetők-e if ( !$Self->{ConfigObject}->Get('SLAPreferences') ) { return; } # beállítások lekérése return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableSLAID} = ?", Bind => [ \$Param{SLAID} ], ); my %Data; while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # adatok visszaadása return %Data; } 1;

source: There is the need to activate your custom SLA preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni SLA beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.

source: Useful preferences implementation could be to store additional values on SLAs.
hu: Hasznos beállítások megvalósítás lehet további értékek tárolása az SLA-khoz.

source: Stats Module
hu: Statisztikák modul

source: There are two different types of internal stats modules - dynamic and static. This section describes how such stats modules can be developed.
hu: A belső statisztikamoduloknak két különböző típusa létezik - dinamikus és statikus. Ez a szakasz azt írja le, hogy az ilyen statisztikamodulok hogyan fejleszthetők.

source: Dynamic Stats
hu: Dinamikus statisztikák

source: In contrast to static stats modules, dynamic statistics can be configured via the OTRS web interface. In this section a simple statistic module is developed. Each dynamic stats module has to implement these subroutines:
hu: A statikus statisztikamodulokkal ellentétben a dinamikus statisztikák beállíthatók az OTRS webes felületén keresztül. Ebben a szakaszban egy egyszerű statisztikamodul kerül fejlesztésre. Minden egyes dinamikus statisztikamodulnak meg kell valósítania ezeket a szubrutinokat:

source: Furthermore the module has to implement either <literal>GetStatElement</literal> or <literal>GetStatTable</literal>. And if the header line of the result table should be changed, a sub called <literal>GetHeaderLine</literal> has to be developed.
hu: Továbbá a modulnak meg kell valósítania vagy a <literal>GetStatElement</literal>, vagy a <literal>GetStatTable</literal> rutint. És ha az eredménytábla fejlécsorát is meg kell változtatni, akkor egy úgynevezett <literal>GetHeaderLine</literal> szubrutint is fejleszteni kell.

source: In this section a sample stats module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta statisztikamodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.

source: # -- # Kernel/System/Stats/Dynamic/DynamicStatsTemplate.pm - all advice functions # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Stats::Dynamic::DynamicStatsTemplate; use strict; use warnings; use Kernel::System::Queue; use Kernel::System::State; use Kernel::System::Ticket;
hu: # -- # Kernel/System/Stats/Dynamic/DynamicStatsTemplate.pm - minden javasolt függvény # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Stats::Dynamic::DynamicStatsTemplate; use strict; use warnings; use Kernel::System::Queue; use Kernel::System::State; use Kernel::System::Ticket;

source: This is a common boilerplate that can be found in common OTRS modules. The class/package name is declared via the <literal>package</literal> keyword. Then the needed modules are used via the <literal>use</literal> keyword.
hu: Ez egy gyakori sabloncsomag, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a <literal>package</literal> kulcsszón keresztül van deklarálva. Ezután a szükséges modulok használatának megadása következik a <literal>use</literal> kulcsszóval.

source: sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for my $Object ( qw(DBObject ConfigObject LogObject UserObject TimeObject MainObject EncodeObject) ) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } # created needed objects $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{StateObject} = Kernel::System::State->new( %{$Self} ); return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for my $Object ( qw(DBObject ConfigObject LogObject UserObject TimeObject MainObject EncodeObject) ) { $Self->{$Object} = $Param{$Object} || die "Nincs $Object!"; } # a létrehozott szükséges objektumok $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{StateObject} = Kernel::System::State->new( %{$Self} ); return $Self; }

source: The <literal>new</literal> is the constructor for this statistic module. It creates a new instance of the class. According to the coding guidelines objects of other classes that are needed in this module have to be created in <literal>new</literal>. In lines 27 to 29 the object of the stats module is created. Lines 31 to 37 check if objects that are needed in this code - either for creating other objects or in this module - are passed. After that the other objects are created.
hu: A <literal>new</literal> a statisztikamodul konstruktora. Ez hozza létre az osztály új példányát. A kódolási irányelveknek megfelelően az ebben a modulban szükséges más osztályok objektumait is a <literal>new</literal> konstruktorban kell létrehozni. A 27-29. sorban van létrehozva a statisztikák modul objektuma. A 31-37. sorban azt ellenőrzik, hogy az ebben a kódban szükséges objektumok - vagy más objektumok létrehozásánál, vagy ebben a modulban - át vannak-e adva. Ezután a többi objektum kerül létrehozásra.

source: sub GetObjectName { my ( $Self, %Param ) = @_; return 'Sample Statistics'; }
hu: sub GetObjectName { my ( $Self, %Param ) = @_; return 'Minta statisztikák'; }

source: <literal>GetObjectName</literal> returns a name for the statistics module. This is the label that is shown in the drop down in the configuration as well as in the list of existing statistics (column "object").
hu: A <literal>GetObjectName</literal> visszaad egy nevet a statisztikák modulhoz. Ez az a címke, amely a lenyíló menüben jelenik meg a beállításokban, valamint a meglévő statisztikák listájában (az „objektum” oszlopban).

source: sub GetObjectAttributes { my ( $Self, %Param ) = @_; # get state list my %StateList = $Self->{StateObject}->StateList( UserID => 1, ); # get queue list my %QueueList = $Self->{QueueObject}->GetAllQueues(); # get current time to fix bug#3830 my $TimeStamp = $Self->{TimeObject}->CurrentTimestamp(); my ($Date) = split /\s+/, $TimeStamp; my $Today = sprintf "%s 23:59:59", $Date; my @ObjectAttributes = ( { Name => 'State', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'StateIDs', Block => 'MultiSelectField', Values => \%StateList, }, { Name => 'Created in Queue', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreatedQueueIDs', Block => 'MultiSelectField', Translation => 0, Values => \%QueueList, }, { Name => 'Create Time', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreateTime', TimePeriodFormat => 'DateInputFormat', # 'DateInputFormatLong', Block => 'Time', TimeStop => $Today, Values => { TimeStart => 'TicketCreateTimeNewerDate', TimeStop => 'TicketCreateTimeOlderDate', }, }, ); return @ObjectAttributes; }
hu: sub GetObjectAttributes { my ( $Self, %Param ) = @_; # állapotlista lekérése my %StateList = $Self->{StateObject}->StateList( UserID => 1, ); # várólisták listájának lekérése my %QueueList = $Self->{QueueObject}->GetAllQueues(); # a jelenlegi idő lekérése a 3830. hiba javításához my $TimeStamp = $Self->{TimeObject}->CurrentTimestamp(); my ($Date) = split /\s+/, $TimeStamp; my $Today = sprintf "%s 23:59:59", $Date; my @ObjectAttributes = ( { Name => 'Állapot', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'StateIDs', Block => 'MultiSelectField', Values => \%StateList, }, { Name => 'Létrehozva várólistában', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreatedQueueIDs', Block => 'MultiSelectField', Translation => 0, Values => \%QueueList, }, { Name => 'Létrehozás ideje', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreateTime', TimePeriodFormat => 'DateInputFormat', # 'DateInputFormatLong', Block => 'Time', TimeStop => $Today, Values => { TimeStart => 'TicketCreateTimeNewerDate', TimeStop => 'TicketCreateTimeOlderDate', }, }, ); return @ObjectAttributes; }

source: In this sample stats module, we want to provide three attributes the user can chose from: a list of queues, a list of states and a time drop down. To get the values shown in the drop down, some operations are needed. In this case <literal>StateList</literal> and <literal>GetAllQueues</literal> are called.
hu: Ebben a minta statisztikák modulban három olyan attribútumot szeretnénk szolgáltatni, amelyből a felhasználó választhat: a várólisták listáját, az állapotok listáját és egy idő legördülőt. A legördülőben megjelenített értékek lekéréséhez szükséges néhány művelet. Ebben az esetben a <literal>StateList</literal> és a <literal>GetAllQueues</literal> kerül meghívásra.

source: Then the list of attributes is created. Each attribute is defined via a hash reference. You can use these keys:
hu: Ezután az attribútumok listája kerül létrehozásra. Minden egyes attribútum egy kivonathivatkozáson keresztül van meghatározva. Ezeket a kulcsokat használhatja:

source: The label in the web interface.
hu: A címke a webes felületen.

source: This attribute can be used on the x-axis.
hu: Ez az attribútum használható az X-tengelyen.

source: This attribute can be used on the y-axis.
hu: Ez az attribútum használható az Y-tengelyen.

source: This attribute can be used for restrictions.
hu: Ez az attribútum használható a korlátozásokhoz.

source: The HTML field name.
hu: A HTML mező neve.

source: The block name in the template file (e.g. <filename>&lt;OTRS_HOME&gt;/Kernel/Output/HTML/Standard/AgentStatsEditXaxis.tt</filename>).
hu: A blokknév a sablonfájlban (például <filename>&lt;OTRS_HOME&gt;/Kernel/Output/HTML/Standard/AgentStatsEditXaxis.tt</filename>).

source: The values shown in the attribute.
hu: Az attribútumban megjelenített értékek.

source: Hint: If you install this sample and you configure a statistic with some queues - lets say 'queue A' and 'queue B' - then these queues are the only ones that are shown to the user when he starts the statistic. Sometimes a dynamic drop down or multiselect field is needed. In this case, you can set <literal>SelectedValues</literal> in the definition of the attribute:
hu: Tipp: Ha telepíti ezt a mintát, és beállít egy statisztikát néhány várólistával (mondjuk „A várólista” és „B várólista”), akkor ezek a várólisták az egyetlenek, amelyek láthatóak lesznek a felhasználónak, amikor elindítja a statisztikát. Néha egy dinamikus legördülő vagy többválasztós mező szükséges. Ebben az esetben beállíthatja a <literal>SelectedValues</literal> kulcsot az attribútum meghatározásában:

source: { Name => 'Created in Queue', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreatedQueueIDs', Block => 'MultiSelectField', Translation => 0, Values => \%QueueList, SelectedValues => [ @SelectedQueues ], },
hu: { Name => 'Létrehozva várólistában', UseAsXvalue => 1, UseAsValueSeries => 1, UseAsRestriction => 1, Element => 'CreatedQueueIDs', Block => 'MultiSelectField', Translation => 0, Values => \%QueueList, SelectedValues => [ @SelectedQueues ], },

source: sub GetStatElement { my ( $Self, %Param ) = @_; # search tickets return $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'COUNT', Permission => 'ro', Limit => 100_000_000, %Param, ); }
hu: sub GetStatElement { my ( $Self, %Param ) = @_; # jegyek keresése return $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'COUNT', Permission => 'ro', Limit => 100_000_000, %Param, ); }

source: <literal>GetStatElement</literal> gets called for each cell in the result table. So it should be a numeric value. In this sample it does a simple ticket search. The hash <literal>%Param</literal> contains information about the "current" x-value and the y-value as well as any restrictions. So, for a cell that should count the created tickets for queue 'Misc' with state 'open' the passed parameter hash looks something like this:
hu: A <literal>GetStatElement</literal> kerül meghívásra minden egyes cellánál az eredménytáblában. Így annak számszerű értéknek kell lennie. Ebben a mintában egy egyszerű jegykeresést hajt végre. A <literal>%Param</literal> kivonat tartalmaz információkat a „jelenlegi” X-értékről és Y-értékről, valamint bármely korlátozásról. Így egy olyan cellánál, amelynek össze kell számolnia a „nyitott” állapotban lévő létrehozott jegyeket a „Misc” várólistánál, az átadott paraméter kivonat valahogy így néz ki:

source: If the "per cell" calculation should be avoided, <literal>GetStatTable</literal> is an alternative. <literal>GetStatTable</literal> returns a list of rows, hence an array of array references. This leads to the same result as using <literal>GetStatElement</literal>.
hu: Ha a „cellánkénti” számítást el kellene kerülni, akkor a <literal>GetStatTable</literal> egy alternatíva. A <literal>GetStatTable</literal> visszaadja a sorok listáját, amely ezentúl egy tömbhivatkozások tömbje. Ez ugyanahhoz az eredményhez vezet mint a <literal>GetStatElement</literal> használata.

source: <literal>GetStatTable</literal> gets all information about the stats query that is needed. The passed parameters contain information about the attributes (<literal>Restrictions</literal>, attributes that are used for x/y-axis) and the table structure. The table structure is a hash reference where the keys are the values of the y-axis and their values are hash references with the parameters used for <literal>GetStatElement</literal> subroutines.
hu: A <literal>GetStatTable</literal> az összes olyan információt lekéri a statisztikák lekérdezéssel kapcsolatban, amelyek szükségesek. Az átadott paraméterek információkat tartalmaznak az attribútumokról (<literal>Restrictions</literal>, olyan attribútumok, amelyek az X/Y-tengelynél vannak használva) és a táblaszerkezetről. A táblaszerkezet egy olyan kivonathivatkozás, ahol a kulcsok az Y-tengely értékei, és azok értékei kivonathivatkozások a <literal>GetStatElement</literal> szubrutinokhoz használt paraméterekkel.

source: 'Restrictions' => {}, 'TableStructure' => { 'closed successful' => [ { 'CreatedQueueIDs' => [ '3' ], 'StateIDs' => [ '2' ] }, ], 'closed unsuccessful' => [ { 'CreatedQueueIDs' => [ '3' ], 'StateIDs' => [ '3' ] }, ], }, 'ValueSeries' => [ { 'Block' => 'MultiSelectField', 'Element' => 'StateIDs', 'Name' => 'State', 'SelectedValues' => [ '5', '3', '2', '1', '4' ], 'Translation' => 1, 'Values' => { '1' => 'new', '10' => 'closed with workaround', '2' => 'closed successful', '3' => 'closed unsuccessful', '4' => 'open', '5' => 'removed', '6' => 'pending reminder', '7' => 'pending auto close+', '8' => 'pending auto close-', '9' => 'merged' } } ], 'XValue' => { 'Block' => 'MultiSelectField', 'Element' => 'CreatedQueueIDs', 'Name' => 'Created in Queue', 'SelectedValues' => [ '3', '4', '1', '2' ], 'Translation' => 0, 'Values' => { '1' => 'Postmaster', '2' => 'Raw', '3' => 'Junk', '4' => 'Misc' } }
hu: 'Restrictions' => {}, 'TableStructure' => { 'closed successful' => [ { 'CreatedQueueIDs' => [ '3' ], 'StateIDs' => [ '2' ] }, ], 'closed unsuccessful' => [ { 'CreatedQueueIDs' => [ '3' ], 'StateIDs' => [ '3' ] }, ], }, 'ValueSeries' => [ { 'Block' => 'MultiSelectField', 'Element' => 'StateIDs', 'Name' => 'Állapot', 'SelectedValues' => [ '5', '3', '2', '1', '4' ], 'Translation' => 1, 'Values' => { '1' => 'new', '10' => 'closed with workaround', '2' => 'closed successful', '3' => 'closed unsuccessful', '4' => 'open', '5' => 'removed', '6' => 'pending reminder', '7' => 'pending auto close+', '8' => 'pending auto close-', '9' => 'merged' } } ], 'XValue' => { 'Block' => 'MultiSelectField', 'Element' => 'CreatedQueueIDs', 'Name' => 'Létrehozva várólistában', 'SelectedValues' => [ '3', '4', '1', '2' ], 'Translation' => 0, 'Values' => { '1' => 'Postmaster', '2' => 'Raw', '3' => 'Junk', '4' => 'Misc' } }

source: Sometimes the headers of the table have to be changed. In that case, a subroutine called <literal>GetHeaderLine</literal> has to be implemented. That subroutine has to return an array reference with the column headers as elements. It gets information about the x-values passed.
hu: Néha a táblázat fejléceit meg kell változtatni. Ebben az esetben egy <literal>GetHeaderLine</literal> nevű szubrutint kell megvalósítani. Ennek a szubrutinnak egy tömbhivatkozást kell visszaadnia az oszlopfejlécekkel mint elemekkel. Ez információkat kap az átadott X-értékekkel kapcsolatban.
