Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: This function is used by the stats modules. It includes the field definition in the stats format. For fields with fixed values it also includes all this possible values and if they can be translated, take a look to the <literal>BaseSelect</literal> driver code for an example how to implement those.
hu: Ezt a függvényt a statisztikák moduljai használják. Tartalmazza a mező meghatározást a statisztikák formátumában. A rögzített értékekkel rendelkező mezőknél tartalmazza az összes lehetséges értéket is, és ha azok lefordíthatók, akkor nézze meg a <literal>BaseSelect</literal> illesztőprogram kódját példaként arra, hogy azokat hogyan kell megvalósítani.

source: <code>StatsSearchFieldParameterBuild()</code> is very similar to the <code>SearchFieldParameterBuild()</code>. The difference is that the <code>SearchFieldParameterBuild()</code> gets the value from the search profile and this one gets the value directly from its parameters.
hu: A <code>StatsSearchFieldParameterBuild()</code> nagyon hasonló a <code>SearchFieldParameterBuild()</code> függvényhez. A különbség az, hogy a <code>SearchFieldParameterBuild()</code> a keresési profilból kapja meg az értéket, és ez pedig közvetlenül a paramétereiből kapja meg az értéket.

source: This function is used by statistics module.
hu: Ezt a függvényt a statisztikák modul használja.

source: The <code>TemplateValueTypeGet()</code> function is used to know how the Dynamic Field values stored on a profile should be retrieved, as a SCALAR or as an ARRAY, and it also defines the correct name of the field in the profile.
hu: A <code>TemplateValueTypeGet()</code> függvényt annak megismeréséhez használják, hogy a dinamikus mező értékei hogyan vannak eltárolva egy olyan profilnál, amelyet le kell kérni (SCALAR vagy ARRAY formában), és meghatározza a mező helyes nevét is a profilban.

source: This function is used by <filename>otrs.FillDB.pl</filename> script to populate the database with some test and random data. The value inserted by this function is not really relevant. The only restriction is that the value must be compatible with the field value type.
hu: Ezt a függvényt az <filename>otrs.FillDB.pl</filename> parancsfájl használja, hogy feltöltse az adatbázist néhány teszt és véletlenszerű adattal. A függvény által beszúrt érték nem igazán fontos. Az egyetlen megkötés az, hogy az értéknek kompatibilisnek kell lennie a mezőérték típusával.

source: Used by the notification modules. This function returns 1 if the field is present in the <literal>$Param{ObjectAttributes}</literal> parameter and if it matches the given value.
hu: Az értesítési modulok használják. Ez a függvény 1-et ad vissza, ha a mező jelen van a <literal>$Param{ObjectAttributes}</literal> paraméterben, és ha megegyezik a megadott értékkel.

source: Creating A New Dynamic Field
hu: Egy új dinamikus mező létrehozása

source: To illustrate this process a new Dynamic Field "Password" will be created. This new Dynamic Field Type will show a New password field to Ticket or Article objects. Since is very similar to a Text Dynamic Field we will use the <literal>Base</literal> and <literal>BaseText</literal> Drivers as a basis to build this new field.
hu: A folyamat bemutatásához egy új „jelszó” dinamikus mező lesz létrehozva. Ez az új dinamikus mező típus egy új jelszómezőt fog megjeleníteni a jegy és a bejegyzés objektumokhoz. Mivel nagyon hasonló egy szöveg dinamikus mezőhöz, ezért a <literal>Base</literal> és a <literal>BaseText</literal> illesztőprogramokat fogjuk használni alapként ezen új mező felépítéséhez.

source: This new password field implementation is just for educational purposes, it does not provide any level of security and is not recommended for production systems.
hu: Az új jelszómező megvalósítása csak oktatási célokra van, nem biztosít semmilyen biztonsági szintet, és nem ajánlott termelési rendszereknél.

source: To create this new Dynamic Field we will create 4 files: a Configuration File (XML), to register the modules, an Admin Dialog Module (Perl), to setup the field options, a template module, for the Admin Dialog and a Dynamic Field Driver (Perl).
hu: A dinamikus mező létrehozásához négy fájlt fogunk létrehozni: egy beállítófájlt (XML) a modulok regisztrálásához, egy adminisztrátori párbeszédablak modult (Perl) a mezőlehetőségek beállításához, egy sablonmodult az adminisztrátori párbeszédablakhoz és egy dinamikus mező illesztőprogramot (Perl).

source: $HOME (e. g. /opt/otrs/) | ... |--/Kernel/ | |--/Config/ | | |--/Files/ | | | |DynamicFieldPassword.xml ... | |--/Modules/ | | |AdminDynamicFieldPassword.pm ... | |--/Output/ | | |--/HTML/ | | | |--/Standard/ | | | | |AdminDynamicFieldPassword.tt ... | |--/System/ | | |--/DynamicField/ | | | |--/Driver/ | | | | |Password.pm ...
hu: $HOME (például /opt/otrs/) | ... |--/Kernel/ | |--/Config/ | | |--/Files/ | | | |DynamicFieldPassword.xml ... | |--/Modules/ | | |AdminDynamicFieldPassword.pm ... | |--/Output/ | | |--/HTML/ | | | |--/Standard/ | | | | |AdminDynamicFieldPassword.tt ... | |--/System/ | | |--/DynamicField/ | | | |--/Driver/ | | | | |Password.pm ...

source: Dynamic Field Password files
hu: Dinamikus mező jelszó fájlok

source: Overview
hu: Áttekintés

source: Dynamic Fields are custom fields that can be added to a screen to enhance and add information to an object (e.g. a ticket or an article).
hu: A dinamikus mezők olyan egyéni mezők, amelyek hozzáadhatók egy képernyőhöz, hogy javítsák és információkat adjanak hozzá egy objektumhoz (például egy jegyhez vagy egy bejegyzéshez).

source: The Dynamic Fields are the evolution of the ticket and article Free Fields (<literal>TikcetFreeText</literal>, <literal>TicketFreeKey</literal>, <literal>TicketFreeTime</literal>, <literal>ArticleFreeText</literal>, <literal>ArticleFreeKey</literal> and <literal>ArticleFreeTime</literal>) from older versions of OTRS.
hu: A dinamikus mezők a jegy és a bejegyzés szabad mezőinek (<literal>TikcetFreeText</literal>, <literal>TicketFreeKey</literal>, <literal>TicketFreeTime</literal>, <literal>ArticleFreeText</literal>, <literal>ArticleFreeKey</literal> és <literal>ArticleFreeTime</literal>) evolúciója az OTRS régebbi verzióiból.

source: From OTRS version 3.1 the old Free Fields has been replaced with the new Dynamic Fields. For a better backward compatibility and data preservation when updating from previous versions, a migration script has been developed to convert the existing Free Fields to Dynamic Fields and to move their values from the <emphasis>ticket</emphasis> and <emphasis>article</emphasis> tables in the database to new dynamic fields tables.
hu: Az OTRS 3.1-es verziójától a régi szabad mezőket lecserélték az új dinamikus mezőkre. A korábbi verziókról történő frissítéskor a jobb visszafelé kompatibilitáshoz és az adatmegőrzéshez egy költöztető parancsfájlt fejlesztettek ki a meglévő szabad mezők dinamikus mezőkre való átalakításához, és azok értékeinek áthelyezéséhez az adatbázisban lévő <emphasis>ticket</emphasis> és <emphasis>article</emphasis> táblákból az új dinamikus mezők tábláiba.

source: Any custom development that uses Free Fields needs to be ported to the new Dynamic Fields code structure, otherwise it will not work anymore. For this reason is very important to know that only updated installations of OTRS 3.0 has the old Free Fields converted to Dynamic Fields, new or clean installations of OTRS has no Dynamic Fields defined "out of the box" and any Dynamic Field needed by the custom development needs to be added.
hu: Minden szabad mezőket használó egyéni fejlesztést át kell írni az új dinamikus mezők kódszerkezetére, különben többé nem fognak működni. Emiatt nagyon fontos tudni azt, hogy az OTRS 3.0-nak csak a frissített telepítései rendelkeznek a dinamikus mezőkre átalakított régi szabad mezőkkel, az OTRS új vagy tiszta telepítéseinek nincsenek „eredetileg” meghatározott dinamikus mezői, és az egyéni fejlesztés által szükséges összes dinamikus mezőt hozzá kell adni.

source: The restriction on the number of the fields per ticket or article has been removed. This means that a ticket or article could have as many fields as needed. And now it is also possible to use the Dynamic Fields framework for other objects rather than just ticket or article.
hu: A jegyenkénti vagy bejegyzésenkénti mezők számának korlátozása eltávolításra került. Ez azt jelenti, hogy egy jegy vagy egy bejegyzés annyi mezővel rendelkezhet, amennyi szükséges. És mostantól lehetséges a dinamikus mezők keretrendszerének használata egyéb objektumoknál is ahelyett, hogy csak a jegynél vagy a bejegyzésnél lenne használható.

source: The new Dynamic Fields can store the same data types as the Free Fields (Text and Date/Time), and they can be also defined as them (Single line input, drop-down and date-time), but Dynamic Fields go beyond that, a new integer data type has been added and also new options to define the fields like Multiple-line inputs, check-boxes, Multiple-select and date (without time) fields. Each field type defines its own data type.
hu: Az új dinamikus mezők ugyanazokat az adattípusokat tudják eltárolni mint a szabad mezők (szöveg és dátum/idő), és ugyanúgy határozhatók meg mint azok (egysoros beviteli mező, legördülő és dátum/idő), de a dinamikus mezők túlmennek ezen, ugyanis egy új egész szám adattípus került hozzáadásra, valamint új lehetőségek is az olyan mezők meghatározásához, mint például többsoros beviteli mezők, jelölőnégyzetek, többválasztós mezők és (idő nélküli) dátum mezők. Minden egyes mezőtípus saját adattípust határoz meg.

source: Due to its modular design each Dynamic Field type can be seen as a plug-in to a framework, and this plug-in can be an OTRS standard package to extend the available types of the Dynamic Fields or even to extend current Dynamic Field with more functions.
hu: A moduláris tervezésének köszönhetően az egyes dinamikus mezőtípusok egy keretrendszerhez tartozó bővítményként láthatók, és ez a bővítmény lehet egy szabványos OTRS csomag is a dinamikus mezők elérhető típusainak kiterjesztéséhez, vagy akár a jelenlegi dinamikus mező további függvényekkel való kiterjesztéséhez.

source: Ticket PostMaster Module
hu: Jegy levelezési modul

source: PostMaster modules are used during the PostMaster process. There are two kinds of PostMaster modules: <literal>PostMasterPre</literal> (used after parsing an email) and <literal>PostMasterPost</literal> (used after an email is processed and is in the database).
hu: A levelezési modulokat a levelezési folyamat során használják. Kétféle levelezési modul létezik: <literal>PostMasterPre</literal> (egy e-mail feldolgozása után használják) és <literal>PostMasterPost</literal> (azután használják, amikor egy e-mail feldolgozásra került, és az adatbázisban van).

source: If you want to create your own postmaster filter, just create your own module. These modules are located under <filename>Kernel/System/PostMaster/Filter/*.pm</filename>. For default modules see the admin manual. You just need two functions: <code>new()</code> and <code>Run()</code>.
hu: Ha saját levelezési szűrőket szeretne létrehozni, akkor egyszerűen hozza létre a saját modulját. Ezek a modulok a <filename>Kernel/System/PostMaster/Filter/*.pm</filename> fájlokban találhatók. Az alapértelmezett modulokért nézze meg az adminisztrátori kézikönyvet. Mindössze két függvényre van szüksége: <code>new()</code> és <code>Run()</code>.

source: The following is an exemplary module to match emails and set X-OTRS-Headers (see <filename>doc/X-OTRS-Headers.txt</filename> for more info).
hu: A következőkben egy példaszerű modul található az e-mailek egyeztetéséhez és az X-OTRS fejlécek beállításához (további információkért nézze meg a <filename>doc/X-OTRS-Headers.txt</filename> fájlt).

source: <ConfigItem Name="PostMaster::PreFilterModule###1-Example" Required="0" Valid="1"> <Description Translatable="1">Example module to filter and manipulate incoming messages.</Description> <Group>Ticket</Group> <SubGroup>Core::PostMaster</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::System::PostMaster::Filter::Example</Item> <Item Key="Match"> <Hash> <Item Key="From">noreply@</Item> </Hash> </Item> <Item Key="Set"> <Hash> <Item Key="X-OTRS-Ignore">yes</Item> </Hash> </Item> </Hash> </Setting> </ConfigItem>
hu: <ConfigItem Name="PostMaster::PreFilterModule###1-Example" Required="0" Valid="1"> <Description Translatable="1">Példamodul a bejövő üzenetek szűréséhez és manipulálásához.</Description> <Group>Ticket</Group> <SubGroup>Core::PostMaster</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::System::PostMaster::Filter::Example</Item> <Item Key="Match"> <Hash> <Item Key="From">noreply@</Item> </Hash> </Item> <Item Key="Set"> <Hash> <Item Key="X-OTRS-Ignore">yes</Item> </Hash> </Item> </Hash> </Setting> </ConfigItem>

source: And the actual filter code in <filename>Kernel/System/PostMaster/Filter/Example.pm</filename>:
hu: És a tényleges szűrőkód a <filename>Kernel/System/PostMaster/Filter/Example.pm</filename> fájlban:

source: # -- # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::PostMaster::Filter::Example; use strict; use warnings; our @ObjectDependencies = ( 'Kernel::System::Log', ); sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless ($Self, $Type); $Self->{Debug} = $Param{Debug} || 0; return $Self; } sub Run { my ( $Self, %Param ) = @_; # get config options my %Config = (); my %Match = (); my %Set = (); if ($Param{JobConfig} && ref($Param{JobConfig}) eq 'HASH') { %Config = %{$Param{JobConfig}}; if ($Config{Match}) { %Match = %{$Config{Match}}; } if ($Config{Set}) { %Set = %{$Config{Set}}; } } # match 'Match => ???' stuff my $Matched = ''; my $MatchedNot = 0; for (sort keys %Match) { if ($Param{GetParam}->{$_} && $Param{GetParam}->{$_} =~ /$Match{$_}/i) { $Matched = $1 || '1'; if ($Self->{Debug} > 1) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'debug', Message => "'$Param{GetParam}->{$_}' =~ /$Match{$_}/i matched!", ); } } else { $MatchedNot = 1; if ($Self->{Debug} > 1) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'debug', Message => "'$Param{GetParam}->{$_}' =~ /$Match{$_}/i matched NOT!", ); } } } # should I ignore the incoming mail? if ($Matched && !$MatchedNot) { for (keys %Set) { if ($Set{$_} =~ /\[\*\*\*\]/i) { $Set{$_} = $Matched; } $Param{GetParam}->{$_} = $Set{$_}; $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'notice', Message => "Set param '$_' to '$Set{$_}' (Message-ID: $Param{GetParam}->{'Message-ID'}) ", ); } } return 1; } 1;
hu: # -- # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::PostMaster::Filter::Example; use strict; use warnings; our @ObjectDependencies = ( 'Kernel::System::Log', ); sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless ($Self, $Type); $Self->{Debug} = $Param{Debug} || 0; return $Self; } sub Run { my ( $Self, %Param ) = @_; # beállítási lehetőségek lekérése my %Config = (); my %Match = (); my %Set = (); if ($Param{JobConfig} && ref($Param{JobConfig}) eq 'HASH') { %Config = %{$Param{JobConfig}}; if ($Config{Match}) { %Match = %{$Config{Match}}; } if ($Config{Set}) { %Set = %{$Config{Set}}; } } # a „Match => ???” dolog illesztése my $Matched = ''; my $MatchedNot = 0; for (sort keys %Match) { if ($Param{GetParam}->{$_} && $Param{GetParam}->{$_} =~ /$Match{$_}/i) { $Matched = $1 || '1'; if ($Self->{Debug} > 1) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'debug', Message => "'$Param{GetParam}->{$_}' =~ /$Match{$_}/i illeszkedik!", ); } } else { $MatchedNot = 1; if ($Self->{Debug} > 1) { $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'debug', Message => "'$Param{GetParam}->{$_}' =~ /$Match{$_}/i NEM illeszkedik!", ); } } } # mellőznöm kell a bejövő levelet? if ($Matched && !$MatchedNot) { for (keys %Set) { if ($Set{$_} =~ /\[\*\*\*\]/i) { $Set{$_} = $Matched; } $Param{GetParam}->{$_} = $Set{$_}; $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'notice', Message => "„$_” paraméter beállítása erre: „$Set{$_}” (Üzenet-azonosító: $Param{GetParam}->{'Message-ID'}) ", ); } } return 1; } 1;

source: The following image shows you the email processing flow.
hu: A következő kép az e-mail feldolgozási folyamatát mutatja be.

source: Email Processing Flow
hu: E-mail feldolgozási folyamat

source: Package Building
hu: Csomagkészítés

source: If you want to create an OPM package (<literal>.opm</literal>) you need to create a spec file (<literal>.sopm</literal>) which includes the properties of the package.
hu: Ha egy OPM csomagot (<literal>.opm</literal>) szeretne létrehozni, akkor létre kell hoznia egy specifikációs fájl (<literal>.sopm</literal>), amely a csomag tulajdonságait tartalmazza.

source: Package Spec File
hu: Csomagspecifikációs fájl

source: The OPM package is XML based. You can create/edit the <literal>.sopm</literal> via a text or XML editor. It contains meta data, a file list and database options.
hu: Az OPM csomag XML alapú. A <literal>.sopm</literal> fájlt egy szöveg- vagy egy XML-szerkesztővel hozhatja létre és szerkesztheti. Ez metaadatokat, egy fájllistát és adatbázis-beállításokat tartalmaz.

source: The package name (required).
hu: A csomag neve (kötelező).

source: <Name>Calendar</Name>
hu: <Name>Naptár</Name>

source: The package version (required).
hu: A csomag verziója (kötelező).

source: The targeted framework version (3.2.x means e.g. 3.2.1 or 3.2.2) (required).
hu: A megcélzott keretrendszer verziója (a 3.2.x jelentése például 3.2.1 vagy 3.2.2) (kötelező).

source: Can also be used several times.
hu: Több alkalommal is használható.

source: The package vendor (required).
hu: A csomag gyártója (kötelező).

source: The vendor URL (required).
hu: A gyártó URL-e (kötelező).

source: The license of the package (required).
hu: A csomag licence (kötelező).

source: <License>GNU AFFERO GENERAL PUBLIC LICENSE Version 3, November 2007</License>
hu: <License>GNU AFFERO GENERAL PUBLIC LICENSE 3. verzió, 2007. november</License>

source: The package change log (optional).
hu: A csomag változásnaplója (elhagyható).

source: <ChangeLog Version="1.1.2" Date="2013-02-15 18:45:21">Added some feature.</ChangeLog> <ChangeLog Version="1.1.1" Date="2013-02-15 16:17:51">New package.</ChangeLog>
hu: <ChangeLog Version="1.1.2" Date="2013-02-15 18:45:21">Néhány funkció hozzáadva.</ChangeLog> <ChangeLog Version="1.1.1" Date="2013-02-15 16:17:51">Új csomag.</ChangeLog>

source: The package description in different languages (required).
hu: A csomag leírása különböző nyelveken (kötelező).

source: <Description Lang="en">A web calendar.</Description> <Description Lang="de">Ein Web Kalender.</Description>
hu: <Description Lang="en">A web calendar.</Description> <Description Lang="hu">Egy webes naptár.</Description>

source: Package Actions
hu: Csomagműveletek

source: The possible actions for the package after installation. If one of these actions is not defined on the package, it will be considered as possible.
hu: A csomag lehetséges műveletei a telepítés után. Ha ezen műveletek valamelyike nincs meghatározva a csomagnál, akkor lehetségesként fogja tekinteni.

source: This will be filled in automatically by OPM.
hu: Ezt az OPM automatikusan ki fogja tölteni.

source: Packages that must be installed beforehand (optional). If <literal>PackageRequired</literal> is used, a version of the required package must be specified.
hu: Csomagok, amelyeket előzetesen telepíteni kell (elhagyható). Ha a <literal>PackageRequired</literal> használatban van, akkor a szükséges csomag egy verzióját meg kell adni.

source: <PackageRequired Version="1.0.3">SomeOtherPackage</PackageRequired> <PackageRequired Version="5.3.2">SomeotherPackage2</PackageRequired>
hu: <PackageRequired Version="1.0.3">ValamilyenMasikCsomag</PackageRequired> <PackageRequired Version="5.3.2">ValamilyenMasikCsomag2</PackageRequired>

source: Perl modules that must be installed beforehand (optional).
hu: Perl-modulok, amelyeket előzetesen telepíteni kell (elhagyható).

source: Required OS (optional).
hu: A szükséges operációs rendszer (elhagyható).

source: This is a list of files included in the package (optional).
hu: Ez a csomagban lévő fájlok listája (elhagyható).

source: Database entries that have to be created when a package is installed (optional).
hu: Adatbázis-bejegyzések, amelyeket létre kell hozni, amikor a csomagot telepítik (elhagyható).

source: You also can choose <literal>&lt;DatabaseInstall Type="post"&gt;</literal> or <literal>&lt;DatabaseInstall Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;DatabaseInstall Type="post"&gt;</literal> vagy <literal>&lt;DatabaseInstall Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: Information on which actions have to be performed in case of an upgrade (optional). Example if already installed package version is below 1.3.4 (e. g. 1.2.6), the defined action will be performed:
hu: Információk arról, hogy mely műveleteket kell végrehajtani egy frissítés esetén (elhagyható). Például ha egy korábban telepített csomag verziója 1.3.4 alatt van (mondjuk 1.2.6), akkor végre lesz hajtva a meghatározott művelet:

source: You also can choose <literal>&lt;DatabaseUpgrade Type="post"&gt;</literal> or <literal>&lt;DatabaseUpgrade Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;DatabaseUpgrade Type="post"&gt;</literal> vagy <literal>&lt;DatabaseUpgrade Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: Information on which actions have to be performed if the package is reinstalled (optional).
hu: Információk arról, hogy mely műveleteket kell végrehajtani, ha a csomagot újratelepítik (elhagyható).

source: You also can choose <literal>&lt;DatabaseReinstall Type="post"&gt;</literal> or <literal>&lt;DatabaseReinstall Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;DatabaseReinstall Type="post"&gt;</literal> vagy <literal>&lt;DatabaseReinstall Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: Actions to be performed on package uninstall (optional).
hu: A végrehajtandó műveletek a csomag eltávolításakor (elhagyható).
