Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: You also can choose <literal>&lt;DatabaseUninstall Type="post"&gt;</literal> or <literal>&lt;DatabaseUninstall Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;DatabaseUninstall Type="post"&gt;</literal> vagy <literal>&lt;DatabaseUninstall Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: To show a "pre" or "post" install introduction in installation dialog.
hu: Egy telepítés előtti („pre”) vagy utáni („post”) bevezető megjelenítéséhez a telepítési párbeszédablakban.

source: <IntroInstall Type="post" Lang="en" Title="Some Title"><![CDATA[ Some Info formatted in HTML.... ]]
hu: <IntroInstall Type="post" Lang="hu" Title="Valamilyen cím"><![CDATA[ Valamilyen HTML formátumú információ… ]]

source: You can also use the <literal>Format</literal> attribute to define if you want to use "html" (which is default) or "plain" to use automatically a <literal>&lt;pre&gt;&lt;/pre&gt;</literal> tag when intro is shown (to keep the newlines and whitespace of the content).
hu: Használhatja a <literal>Format</literal> attribútumot is annak meghatározásához, hogy „html” (amely alapértelmezett) vagy „plain” (egyszerű szöveg) tartalmat szeretne használni. Az utóbbi automatikusan egy <literal>&lt;pre&gt;&lt;/pre&gt;</literal> címkét használ, amikor a bevezető megjelenik (a tartalom új sorai és üres karakterei megtartásához).

source: To show a "pre" or "post" uninstall introduction in uninstallation dialog.
hu: Egy eltávolítás előtti („pre”) vagy utáni („post”) bevezető megjelenítéséhez az eltávolítási párbeszédablakban.

source: <IntroUninstall Type="post" Lang="en" Title="Some Title"><![CDATA[ Some Info formatted in html.... ]]
hu: <IntroUninstall Type="post" Lang="hu" Title="Valamilyen cím"><![CDATA[ Valamilyen HTML formátumú információ… ]]

source: To show a "pre" or "post" reinstall introduction in re-installation dialog.
hu: Egy újratelepítés előtti („pre”) vagy utáni („post”) bevezető megjelenítéséhez az újratelepítési párbeszédablakban.

source: <IntroReinstall Type="post" Lang="en" Title="Some Title"><![CDATA[ Some Info formatted in html.... ]]
hu: <IntroReinstall Type="post" Lang="hu" Title="Valamilyen cím"><![CDATA[ Valamilyen HTML formátumú információ… ]]

source: To show a "pre" or "post" upgrade introduction in upgrading dialog.
hu: Egy frissítés előtti („pre”) vagy utáni („post”) bevezető megjelenítéséhez a frissítési párbeszédablakban.

source: <IntroUpgrade Type="post" Lang="en" Title="Some Title"><![CDATA[ Some Info formatted in html.... ]]
hu: <IntroUpgrade Type="post" Lang="hu" Title="Valamilyen cím"><![CDATA[ Valamilyen HTML formátumú információ… ]]

source: Perl code to be executed when the package is installed (optional).
hu: A végrehajtandó Perl-kód, amikor a csomagot telepítik (elhagyható).

source: <CodeInstall><![CDATA[ # log example $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'notice', Message => "Some Message!", ); # database example $Kernel::OM->Get('Kernel::System::DB')->Do(SQL => "SOME SQL"); ]]
hu: <CodeInstall><![CDATA[ # log example $Kernel::OM->Get('Kernel::System::Log')->Log( Priority => 'notice', Message => "Valamilyen üzenet!", ); # adatbázis példa $Kernel::OM->Get('Kernel::System::DB')->Do(SQL => "VALAMILYEN SQL"); ]]

source: You also can choose <literal>&lt;CodeInstall Type="post"&gt;</literal> or <literal>&lt;CodeInstall Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;CodeInstall Type="post"&gt;</literal> vagy <literal>&lt;CodeInstall Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: Perl code to be executed when the package is uninstalled (optional). On "pre" or "post" time of package uninstallation.
hu: A végrehajtandó Perl-kód, amikor a csomagot eltávolítják (elhagyható). A csomag eltávolításának előtti („pre”) vagy utáni („post”) idejében.

source: You also can choose <literal>&lt;CodeUninstall Type="post"&gt;</literal> or <literal>&lt;CodeUninstall Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;CodeUninstall Type="post"&gt;</literal> vagy <literal>&lt;CodeUninstall Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: Perl code to be executed when the package is reinstalled (optional).
hu: A végrehajtandó Perl-kód, amikor a csomagot újratelepítik (elhagyható).

source: You also can choose <literal>&lt;CodeReinstall Type="post"&gt;</literal> or <literal>&lt;CodeReinstall Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;CodeReinstall Type="post"&gt;</literal> vagy <literal>&lt;CodeReinstall Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: Perl code to be executed when the package is upgraded (subject to <literal>version</literal> tag), (optional). Example if already installed package version is below 1.3.4 (e. g. 1.2.6), defined action will be performed:
hu: A végrehajtandó Perl-kód, amikor a csomagot frissítik (a <literal>version</literal> címkétől függően), (elhagyható). Például ha egy korábban telepített csomag verziója 1.3.4 alatt van (mondjuk 1.2.6), akkor végre lesz hajtva a meghatározott művelet:

source: You also can choose <literal>&lt;CodeUpgrade Type="post"&gt;</literal> or <literal>&lt;CodeUpgrade Type="pre"&gt;</literal> to define the time of execution separately (<literal>post</literal> is default). For more info see <link linkend="package-life-cycle">Package Life Cycle</link>.
hu: Választhat <literal>&lt;CodeUpgrade Type="post"&gt;</literal> vagy <literal>&lt;CodeUpgrade Type="pre"&gt;</literal> típust is a végrehajtás idejének külön-külön történő meghatározásához (a <literal>post</literal> az alapértelmezett). További információkért nézze meg a <link linkend="package-life-cycle">csomagéletciklus</link> szakaszt.

source: This tag singals that a package has been merged into another package. In this case the original package needs to be removed from the file system and the packages database, but all data must be kept. Let's assume that <literal>PackageOne</literal> was merged into <literal>PackageTwo</literal>. Then <filename>PackageTwo.sopm</filename> should contain this:
hu: Ez a címke jelzi, hogy egy csomag egyesítve lett egy másik csomaggal. Ebben az esetben az eredeti csomagot el kell távolítani a fájlrendszerről és a csomagok adatbázisából, de az összes adatot meg kell tartani. Tegyük fel, hogy az <literal>ElsoCsomag</literal> egyesítve lett a <literal>MasodikCsomag</literal> nevű csomaggal. Ekkor a <filename>MasodikCsomag.sopm</filename> fájlnak ezt kell tartalmaznia:

source: If <literal>PackageOne</literal> also contained database structures, we need to be sure that it was at the latest available version of the package to have a consistent state in the database after merging the package. The attribute <literal>TargetVersion</literal> does just this: it signifies the last known version of <literal>PackageOne</literal> at the time <literal>PackageTwo</literal> was created. This is mainly to stop the upgrade process if in the user's system a version of <literal>PackageOne</literal> was found that is <emphasis>newer</emphasis> than the one specified in <literal>TargetVersion</literal> as this could lead to problems.
hu: Ha az <literal>ElsoCsomag</literal> is tartalmaz adatbázis-szerkezetet, akkor meg kell győződnünk arról, hogy az a csomag legfrissebb elérhető verziójánál volt, hogy következetes állapot legyen az adatbázisban a csomag egyesítése után. A <literal>TargetVersion</literal> attribútum csak ennyi csinál: jelzi az <literal>ElsoCsomag</literal> utolsó ismert verzióját abban az időpontban, amikor a <literal>MasidikCsomag</literal> létrejött. Ez főleg azért van, hogy leállítsa a frissítési folyamatot, ha a felhasználó rendszerén megtalálható az <literal>ElsoCsomag</literal> egy olyan verziója, amely <emphasis>újabb</emphasis> a <literal>TargetVersion</literal> attribútumban megadottnál, mivel ekkor ez problémákhoz vezethet.

source: Additionally it is possible to add required database and code upgrade tags for <literal>PackageOne</literal> to make sure that it gets properly upgraded to the <literal>TargetVersion</literal> <emphasis>before</emphasis> merging it - to avoid inconsistency problems. Here's how this could look like:
hu: Továbbá lehetőség van a szükséges adatbázis és kódfrissítési címkék hozzáadására az <literal>ElsoCsomag</literal> nevű csomagnál annak biztosításához, hogy az megfelelően kerül frissítésre a <literal>TargetVersion</literal> verzióra az egyesítés <emphasis>előtt</emphasis> - a következetlenségi problémák elkerüléséhez. Itt látható, hogy ennek hogyan kellene kinéznie:

source: As you can see the attribute <literal>Type="merge"</literal> needs to be set in this case. These sections will only be executed if a package merge is possible.
hu: Amint láthatja, ebben az esetben a <literal>Type="merge"</literal> attribútumot kell beállítani. Ezek a szakaszok csak akkor lesznek végrehajtva, ha lehetséges egy csomagegyesítés.

source: Conditions: <literal>IfPackage</literal> and <literal>IfNotPackage</literal>
hu: Feltételek: <literal>IfPackage</literal> és <literal>IfNotPackage</literal>

source: These attributes can be added to the regular <literal>Database*</literal> and <literal>Code*</literal> sections. If they are present, the section will only be executed if another package is or is not in the local package repository.
hu: Ezek az attribútumok hozzáadhatók a szabályos <literal>Database*</literal> és <literal>Code*</literal> szakaszokhoz. Ha ezek jelen vannak, akkor a szakasz csak akkor lesz végrehajtva, ha egy másik csomag létezik vagy nem létezik a helyi csomagtárolóban.

source: <DatabaseInstall IfPackage="AnyPackage"> ... </DatabaseInstall>
hu: <DatabaseInstall IfPackage="ValamilyenCsomag"> ... </DatabaseInstall>

source: or
hu: vagy

source: <CodeUpgrade IfNotPackage="OtherPackage"> ... </CodeUpgrade>
hu: <CodeUpgrade IfNotPackage="MasikCsomag"> ... </CodeUpgrade>

source: These attributes can be also set in the <literal>Database*</literal> and <literal>Code*</literal> sections inside the <literal>PackageMerge</literal> tags.
hu: Ezek az attribútumok beállíthatók a <literal>PackageMerge</literal> címkéken belüli <literal>Database*</literal> és <literal>Code*</literal> szakaszokban is.

source: Example .sopm
hu: Példa .sopm

source: This is an example spec file looks with some of the above tags.
hu: Ez egy példa specifikációs fájl kinézete a fenti címkék egy részével.

source: <?xml version="1.0" encoding="utf-8" ?> <otrs_package version="1.0"> <Name>Calendar</Name> <Version>0.0.1</Version> <Framework>3.2.x</Framework> <Vendor>OTRS AG</Vendor> <URL>http://otrs.org/</URL> <License>GNU AFFERO GENERAL PUBLIC LICENSE Version 3, November 2007</License> <ChangeLog Version="1.1.2" Date="2013-02-15 18:45:21">Added some feature.</ChangeLog> <ChangeLog Version="1.1.1" Date="2013-02-15 16:17:51">New package.</ChangeLog> <Description Lang="en">A web calendar.</Description> <Description Lang="de">Ein Web Kalender.</Description> <IntroInstall Type="post" Lang="en" Title="Thank you!">Thank you for choosing the Calendar module.</IntroInstall> <IntroInstall Type="post" Lang="de" Title="Vielen Dank!">Vielen Dank fuer die Auswahl des Kalender Modules.</IntroInstall> <BuildDate>?</BuildDate> <BuildHost>?</BuildHost> <Filelist> <File Permission="644" Location="Kernel/Config/Files/Calendar.pm"></File> <File Permission="644" Location="Kernel/System/CalendarEvent.pm"></File> <File Permission="644" Location="Kernel/Modules/AgentCalendar.pm"></File> <File Permission="644" Location="Kernel/Language/de_AgentCalendar.pm"></File> <File Permission="644" Location="Kernel/Output/HTML/Standard/AgentCalendar.tt"></File> <File Permission="644" Location="Kernel/Output/HTML/NotificationCalendar.pm"></File> <File Permission="644" Location="var/httpd/htdocs/images/Standard/calendar.png"></File> </Filelist> <DatabaseInstall> <TableCreate Name="calendar_event"> <Column Name="id" Required="true" PrimaryKey="true" AutoIncrement="true" Type="BIGINT"/> <Column Name="title" Required="true" Size="250" Type="VARCHAR"/> <Column Name="content" Required="false" Size="250" Type="VARCHAR"/> <Column Name="start_time" Required="true" Type="DATE"/> <Column Name="end_time" Required="true" Type="DATE"/> <Column Name="owner_id" Required="true" Type="INTEGER"/> <Column Name="event_status" Required="true" Size="50" Type="VARCHAR"/> </TableCreate> </DatabaseInstall> <DatabaseUninstall> <TableDrop Name="calendar_event"/> </DatabaseUninstall> </otrs_package>
hu: <?xml version="1.0" encoding="utf-8" ?> <otrs_package version="1.0"> <Name>Naptár</Name> <Version>0.0.1</Version> <Framework>3.2.x</Framework> <Vendor>OTRS AG</Vendor> <URL>http://otrs.org/</URL> <License>GNU AFFERO GENERAL PUBLIC LICENSE 3. verzió, 2007. november</License> <ChangeLog Version="1.1.2" Date="2013-02-15 18:45:21">Néhány funkció hozzáadva.</ChangeLog> <ChangeLog Version="1.1.1" Date="2013-02-15 16:17:51">Új csomag.</ChangeLog> <Description Lang="en">A web calendar.</Description> <Description Lang="hu">Egy webes naptár.</Description> <IntroInstall Type="post" Lang="en" Title="Thank you!">Thank you for choosing the Calendar module.</IntroInstall> <IntroInstall Type="post" Lang="hu" Title="Köszönjük!">Köszönjük, hogy a naptár modult választotta.</IntroInstall> <BuildDate>?</BuildDate> <BuildHost>?</BuildHost> <Filelist> <File Permission="644" Location="Kernel/Config/Files/Calendar.pm"></File> <File Permission="644" Location="Kernel/System/CalendarEvent.pm"></File> <File Permission="644" Location="Kernel/Modules/AgentCalendar.pm"></File> <File Permission="644" Location="Kernel/Language/de_AgentCalendar.pm"></File> <File Permission="644" Location="Kernel/Output/HTML/Standard/AgentCalendar.tt"></File> <File Permission="644" Location="Kernel/Output/HTML/NotificationCalendar.pm"></File> <File Permission="644" Location="var/httpd/htdocs/images/Standard/calendar.png"></File> </Filelist> <DatabaseInstall> <TableCreate Name="calendar_event"> <Column Name="id" Required="true" PrimaryKey="true" AutoIncrement="true" Type="BIGINT"/> <Column Name="title" Required="true" Size="250" Type="VARCHAR"/> <Column Name="content" Required="false" Size="250" Type="VARCHAR"/> <Column Name="start_time" Required="true" Type="DATE"/> <Column Name="end_time" Required="true" Type="DATE"/> <Column Name="owner_id" Required="true" Type="INTEGER"/> <Column Name="event_status" Required="true" Size="50" Type="VARCHAR"/> </TableCreate> </DatabaseInstall> <DatabaseUninstall> <TableDrop Name="calendar_event"/> </DatabaseUninstall> </otrs_package>

source: Package Build
hu: Csomagösszeállítás

source: To build an .opm package from the spec opm.
hu: Egy .opm csomag összeállításához a specifikációs opm fájlból.

source: shell> bin/otrs.Console.pl Dev::Package::Build /path/to/example.sopm /tmp Building package... Done. shell>
hu: shell> bin/otrs.Console.pl Dev::Package::Build /útvonal/ehhez/példa.sopm /tmp Building package... Done. shell>

source: Package Life Cycle - Install/Upgrade/Uninstall
hu: Csomagéletciklus - telepítés, frissítés, eltávolítás

source: The following image shows you how the life cycle of a package installation/upgrade/uninstallation works in the backend step by step.
hu: A következő kép azt mutatja be lépésről lépésre, hogy egy csomag telepítési, frissítési vagy eltávolítási életciklusa hogyan működik a háttérprogramban.

source: Package Life Cycle
hu: Csomagéletciklus

source: Package Management
hu: Csomagkezelés

source: The OPM (OTRS Package Manager) is a mechanism to distribute software packages for the OTRS framework via HTTP, FTP or file upload.
hu: Az OPM (OTRS csomagkezelő) egy mechanizmus az OTRS keretrendszerhez való szoftvercsomagok terjesztésére HTTP-n, FTP-n vagy fájlfeltöltésen keresztül.

source: For example, the OTRS project offers OTRS modules like a calendar, a file manager or web mail in OTRS packages via online repositories on our ftp servers. The packages can be managed (install/upgrade/uninstall) via the admin interface.
hu: Például az OTRS projekt OTRS modulokat kínál OTRS csomagokban az Internetes tárolókon vagy az FTP-kiszolgálóinkon keresztül, mint például naptár, fájlkezelő vagy webes levelező. A csomagok az adminisztrátori felületen keresztül kezelhetők (telepítés, frissítés vagy eltávolítás).

source: Package Distribution
hu: Csomagterjesztés

source: If you want to create an OPM online repository, just tell the OTRS framework where the location is by activating the SysConfig setting <literal>Package::RepositoryList</literal> and adding the new location there. Then you will have a new select option in the package manager.
hu: Ha egy internetes OPM tárolót szeretne létrehozni, akkor egyszerűen mondja meg az OTRS keretrendszernek a <literal>Package::RepositoryList</literal> rendszerbeállítási lehetőség bekapcsolásával, hogy hol van annak a helye, és adja meg az új helyet itt. Ezután egy új választási lehetősége lesz a csomagkezelőben.

source: In your repository, create an index file for your OPM packages. OTRS just reads this index file and knows what packages are available.
hu: A tárolójában hozzon létre egy index fájlt az OPM csomagokhoz. Az OTRS egyszerűen beolvassa ezt az index fájlt, és tudni fogja, hogy mely csomagok érhetők el.

source: shell> bin/otrs.Console.pl Dev::Package::RepositoryIndex /path/to/repository/ > /path/to/repository/otrs.xml
hu: shell> bin/otrs.Console.pl Dev::Package::RepositoryIndex /útvonal/a/tárolóhoz/ > /útvonal/a/tárolóhoz/otrs.xml

source: Package Commands
hu: Csomagparancsok

source: You can use the following OPM commands over the admin interface or over <filename>bin/otrs.PackageManager.pl</filename> to manage admin jobs for OPM packages.
hu: A következő OPM parancsokat használhatja az adminisztrátori felületen vagy a <filename>bin/otrs.PackageManager.pl</filename> parancsfájllal az adminisztrátori feladatok kezeléséhez az OPM csomagoknál.

source: Install
hu: Telepítés

source: Install OPM packages.
hu: OPM csomagok telepítése.

source: CMD:
hu: Parancssor:

source: shell> bin/otrsConsole.pl Admin::Package::Install /path/to/package.opm
hu: shell> bin/otrsConsole.pl Admin::Package::Install /útvonal/ehhez/csomag.opm

source: Uninstall
hu: Eltávolítás

source: Uninstall OPM packages.
hu: OPM csomagok eltávolítása.

source: shell> bin/otrsConsole.pl Admin::Package::Uninstall /path/to/package.opm
hu: shell> bin/otrsConsole.pl Admin::Package::Uninstall /útvonal/ehhez/csomag.opm

source: Upgrade
hu: Frissítés

source: Upgrade OPM packages.
hu: OPM csomagok frissítése.

source: shell> bin/otrsConsole.pl Admin::Package::Upgrade /path/to/package.opm
hu: shell> bin/otrsConsole.pl Admin::Package::Upgrade /útvonal/ehhez/csomag.opm

source: List
hu: Felsorolás

source: List all OPM packages.
hu: Az összes OPM csomag felsorolása.

source: Package Porting
hu: Csomagátírás

source: With every new minor or major version of OTRS, you need to port your package(s) and make sure they still work with the OTRS API.
hu: Az OTRS minden új hibajavító vagy fő verziójával át kell írnia a csomagjait, és meg kell győződnie arról, hogy azok továbbra is működnek az OTRS API-val.

source: From OTRS 3.3 to 4
hu: OTRS 3.3-ról 4-re

source: This section lists changes that you need to examine when porting your package from OTRS 3.3 to 4.
hu: Ez a szakasz azokat a változtatásokat sorolja fel, amelyeket meg kell vizsgálnia, amikor átírja a csomagját az OTRS 3.3-ról 4-re.

source: New Object Handling
hu: Új objektumkezelés

source: Up to OTRS 4, objects used to be created both centrally and also locally and then handed down to all objects by passing them to the constructors. With OTRS 4 and later versions, there is now an <literal>ObjectManager</literal> that centralizes singleton object creation and access.
hu: Az OTRS 4-ig az objektumokat mind központilag, mind helyileg létre kellett hozni, és ekkor az összes objektumot le kellett kezelni a konstruktornak átadva azokat. Az OTRS 4-es és későbbi verzióinál mostantól létezik egy <literal>ObjectManager</literal> objektum, amely központosítja az egyke objektum létrehozását és hozzáférését.

source: This will require you first of all to change all top level Perl scripts (.pl files only!) to load and provide the <literal>ObjectManager</literal> to all OTRS objects. Let's look at <filename>otrs.CheckDB.pl</filename> from OTRS 3.3 as an example:
hu: Ez mindenek előtt azt fogja igényelni, hogy változtassa meg az összes felső szintű Perl parancsfájlt (csak a .pl fájlokat!) az <literal>ObjectManager</literal> betöltéséhez és biztosításához az összes OTRS objektumnál. Példaként nézzük meg az <filename>otrs.CheckDB.pl</filename> parancsfájlt az OTRS 3.3-ból:

source: use strict; use warnings; use File::Basename; use FindBin qw($RealBin); use lib dirname($RealBin); use lib dirname($RealBin) . '/Kernel/cpan-lib'; use lib dirname($RealBin) . '/Custom'; use Kernel::Config; use Kernel::System::Encode; use Kernel::System::Log; use Kernel::System::Main; use Kernel::System::DB; # create common objects my %CommonObject = (); $CommonObject{ConfigObject} = Kernel::Config->new(); $CommonObject{EncodeObject} = Kernel::System::Encode->new(%CommonObject); $CommonObject{LogObject} = Kernel::System::Log->new( LogPrefix => 'OTRS-otrs.CheckDB.pl', ConfigObject => $CommonObject{ConfigObject}, ); $CommonObject{MainObject} = Kernel::System::Main->new(%CommonObject); $CommonObject{DBObject} = Kernel::System::DB->new(%CommonObject);
hu: use strict; use warnings; use File::Basename; use FindBin qw($RealBin); use lib dirname($RealBin); use lib dirname($RealBin) . '/Kernel/cpan-lib'; use lib dirname($RealBin) . '/Custom'; use Kernel::Config; use Kernel::System::Encode; use Kernel::System::Log; use Kernel::System::Main; use Kernel::System::DB; # a szokásos objektumok létrehozása my %CommonObject = (); $CommonObject{ConfigObject} = Kernel::Config->new(); $CommonObject{EncodeObject} = Kernel::System::Encode->new(%CommonObject); $CommonObject{LogObject} = Kernel::System::Log->new( LogPrefix => 'OTRS-otrs.CheckDB.pl', ConfigObject => $CommonObject{ConfigObject}, ); $CommonObject{MainObject} = Kernel::System::Main->new(%CommonObject); $CommonObject{DBObject} = Kernel::System::DB->new(%CommonObject);
