Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: $CommunicationLogObject->ObjectLog( ObjectLogType => 'Connection', Priority => 'Error', Key => 'Kernel::System::MailAccount::POP3', Value => 'Something went wrong!', ); $CommunicationLogObject->ObjectLogStop( ObjectLogType => 'Connection', Status => 'Failed', );
hu: $CommunicationLogObject->ObjectLog( ObjectLogType => 'Connection', Priority => 'Error', Key => 'Kernel::System::MailAccount::POP3', Value => 'Valami nem működik!', ); $CommunicationLogObject->ObjectLogStop( ObjectLogType => 'Connection', Status => 'Failed', );

source: In turn, you can mark the communication log as failure as well:
hu: Viszont megjelölheti a kommunikációs naplót sikertelennek is:

source: Otherwise, stop the object log and in turn communication log as success:
hu: Egyébként állítsa le az objektumnaplót és jelölje a kommunikációs naplót sikeresként:

source: $CommunicationLogObject->ObjectLog( ObjectLogType => 'Connection', Priority => 'Debug', Key => 'Kernel::System::MailAccount::POP3', Value => "Connection to 'host.example.com' closed.", ); $CommunicationLogObject->ObjectLogStop( ObjectLogType => 'Connection', Status => 'Successful', ); $CommunicationLogObject->CommunicationStop( Status => 'Successful', );
hu: $CommunicationLogObject->ObjectLog( ObjectLogType => 'Connection', Priority => 'Debug', Key => 'Kernel::System::MailAccount::POP3', Value => "A(z) 'host.example.com' kapcsolata lezárva.", ); $CommunicationLogObject->ObjectLogStop( ObjectLogType => 'Connection', Status => 'Successful', ); $CommunicationLogObject->CommunicationStop( Status => 'Successful', );

source: <literal>Message</literal> object log should be used for any log entries regarding specific messages and their processing. It is used in a similar way, just make sure to start it before using it:
hu: A <literal>Message</literal> objektumnaplót kell használni minden olyan naplóbejegyzésnél, amelyek bizonyos üzenetek és azok feldolgozását érintik. Hasonló módon használható, egyszerűen győződjön meg arról, hogy elindította-e a használta előtt:

source: $CommunicationLogObject->ObjectLogStart( ObjectLogType => 'Message', ); $CommunicationLogObject->ObjectLog( ObjectLogType => 'Message', Priority => 'Error', Key => 'Kernel::System::MailAccount::POP3', Value => "Could not process message. Raw mail saved (report it on http://bugs.otrs.org/)!", ); $CommunicationLogObject->ObjectLogStop( ObjectLogType => 'Message', Status => 'Failed', ); $CommunicationLogObject->CommunicationStop( Status => 'Failed', );
hu: $CommunicationLogObject->ObjectLogStart( ObjectLogType => 'Message', ); $CommunicationLogObject->ObjectLog( ObjectLogType => 'Message', Priority => 'Error', Key => 'Kernel::System::MailAccount::POP3', Value => "Nem sikerült feldolgozni az üzenetet. Nyers levél elmentve (jelentse a https://bugs.otrs.org/ oldalon)!", ); $CommunicationLogObject->ObjectLogStop( ObjectLogType => 'Message', Status => 'Failed', ); $CommunicationLogObject->CommunicationStop( Status => 'Failed', );

source: You also have the possibility to link the log object and later lookup the communications for a certain object type and ID:
hu: Lehetősége van hivatkozni a naplóobjektumra és később megkeresni a kommunikációkat egy bizonyos objektumtípus vagy azonosító esetén:

source: You should make sure to always stop communication and flag it as failed, if any log object failed as well. This will allow administrators to see failed communications in the overview, and take any action if needed.
hu: Meg kell győződnie arról, hogy mindig leállította-e a kommunikációt és megjelölte-e sikertelenként, ha valamelyik naplóobjektum sikertelen lenne. Ez lehetővé fogja tenni az adminisztrátorok számára, hogy megtekintsék a sikertelen kommunikációkat az áttekintőben, és megtegyék a szükséges lépéseket.

source: It's important to preserve the communication log for duration of a single process. If your work is spanning over multiple modules and any of them can benefit from logging, make sure to pass the existing communication log instance around so all methods can use the same one. With this approach, you will make sure any log entries spawned for the same process are contained in a single communication.
hu: Fontos megőrizni a kommunikációs naplót egyetlen folyamat időtartamára. Ha munkája több modult is érint, és bármelyikük kihasználhatja a naplózás előnyeit, akkor győződjön meg arról, hogy átadta-e a létező kommunikációs napló példányát, így az összes metódus ugyanazt tudja használni. Ezzel a megközelítéssel biztosíthatja, hogy az azonos folyamathoz tartozó naplóbejegyzések egyetlen kommunikációban legyenek tárolva.

source: If passing the communication log instance is not an option (async tasks!), you can also choose to recreate the communication log object in the same state as in previous step. Just get the communication ID and pass it to the new code, and then create the instance with this parameter supplied:
hu: Ha a kommunikációs napló példányának átadása nem lehetséges (aszinkron feladatok!), akkor választhatja a kommunikációs napló objektum újra létrehozását ugyanabban az állapotban, amiben az előző lépésben volt. Egyszerűen fogja a kommunikációs azonosítót, és adja át az új kódnak, majd hozza létre az új példányt ezzel a megadott paraméterrel:

source: # Get communication ID in parent code. my $CommunicationID = $CommunicationLogObject->CommunicationIDGet(); # Somehow pass communication ID to child code. # ... # Recreate the instance in child code by using same communication ID. my $CommunicationLogObject = $Kernel::OM->Create( 'Kernel::System::CommunicationLog', ObjectParams => { CommunicationID => $CommunicationID, }, );
hu: # Kommunikációs azonosító lekérése a szülőkódban. my $CommunicationID = $CommunicationLogObject->CommunicationIDGet(); # Valahogy adja át a kommunikációs azonosítót a gyermekkódnak. # ... # A példány újra létrehozása a gyermekkódban ugyanazon kommunikációs azonosító használatával. my $CommunicationLogObject = $Kernel::OM->Create( 'Kernel::System::CommunicationLog', ObjectParams => { CommunicationID => $CommunicationID, }, );

source: You can then continue to use this instance as previously stated, start any object logs if needed, adding entries and setting status in the end.
hu: Ezután folytathatja ennek a példánynak a használatát, amint azt korábban említettük. Indítson el valamilyen objektumnaplót, ha szükséges, adjon hozzá bejegyzéseket és állítsa be az állapotot a végén.

source: If you need to retrieve the communication log data or do something else with it, please also take a look at <literal>Kernel::System::CommunicationLog::DB.pm</literal>
hu: Ha a kommunikációs napló adatainak lekérésére van szüksége vagy valami mást szeretne csinálni vele, akkor vessen egy pillantást a <literal>Kernel::System::CommunicationLog::DB.pm</literal> fájlra.

source: Skins
hu: Felszínek

source: Since OTRS 3.0, the visual appearance of OTRS is controlled by "skins".
hu: Az OTRS 3.0-ás verziója óta az OTRS látható megjelenése „felszínekkel” szabályozható.

source: A skin is a set of CSS and image files, which together control how the GUI is presented to the user. Skins do not change the HTML content that is generated by OTRS (this is what "Themes" do), but they control how it is displayed. With the help of modern CSS standards it is possible to change the display thoroughly (e.g. repositioning parts of dialogs, hiding elements, ...).
hu: Egy felszín CSS-fájlok és képfájlok halmaza, amelyek együtt azt vezérlik, hogy a grafikus felhasználói felület hogyan jelenjen meg a felhasználónak. A felszínek nem változtatják meg az OTRS által előállított HTML tartalmát (ez az, amit a „témák” csinálnak), hanem azt szabályozzák, hogy az hogyan jelenjen meg. A modern CSS szabványok segítségével lehetőség van a megjelenítés teljes megváltoztatására (például pérbeszédablakok egyes részeinek áthelyezésére, elemek elrejtésére, stb.).

source: Skin Basics
hu: Felszín alapok

source: All skins are in <filename>$OTRS_HOME/var/httpd/htdocs/skins/$SKIN_TYPE/$SKIN_NAME</filename>. There are two types of skins: agent and customer skins.
hu: Az összes felszín az <filename>$OTRS_HOME/var/httpd/htdocs/skins/$SKIN_TYPE/$SKIN_NAME</filename> mappában van. Kétféle típusú felszín létezik: ügyintézői és ügyfél felszín.

source: Each of the agents can select individually, which of the installed agent skins they want to "wear".
hu: Az ügyintézők mindegyike egyénileg választhatja ki, hogy melyik telepített ügyintézői felszínt szeretnék „viselni”.

source: For the customer interface, a skin has to be selected globally with the config setting <literal>Loader::Customer::SelectedSkin</literal>. All customers will see this skin.
hu: Az ügyfélfelületnél egy felszínt globálisan kell kiválasztani a <literal>Loader::Customer::SelectedSkin</literal> konfigurációs beállítással. Az összes ügyfél ezt a felszínt fogja látni.

source: How skins are loaded
hu: Hogyan töltődnek be a felszínek

source: It is important to note that the "default" skin will <emphasis>always</emphasis> be loaded <emphasis>first</emphasis>. If the agent selected another skin than the "default" one, then the other one will be loaded only <emphasis>after</emphasis> the default skin. By "loading" here we mean that OTRS will put tags into the HTML content which cause the CSS files to be loaded by the browser. Let's see an example of this:
hu: Fontos megjegyezni, hogy <emphasis>mindig</emphasis> az „alapértelmezett” felszín fog <emphasis>először</emphasis> betöltődni. Ha az ügyintéző egy másik felszínt választott az „alapértelmezett” helyett, akkor a másik felszín csak az alapértelmezett felszín <emphasis>után</emphasis> lesz betöltve. A „betöltésen” itt azt értjük, hogy az OTRS olyan címkéket fog elhelyezni a HTML tartalmában, amelyek a CSS-fájlok betöltését idézik elő a böngészőnél. Nézzünk egy példát erre:

source: Here it can clearly be seen that the default skin is loaded first, and then the custom skin specified by the agent. In this example, we see the result of the activated loader (<literal>Loader::Enabled</literal> set to 1), which gathers all CSS files, concatenates and minifies them and serves them as one chunk to the browser. This saves bandwidth and also reduces the number of HTTP requests. Let's see the same example with the Loader turned off:
hu: Itt tisztán látható, hogy az alapértelmezett felszín töltődik be először, majd ezután az ügyintéző által megadott egyéni felszín. Ebben a példában a bekapcsolt betöltő (a <literal>Loader::Enabled</literal> 1-re állítva) eredményét látjuk, amely begyűjti az összes CSS-fájlt, összefűzi és minimalizálja azokat, majd egyetlen nagy egységként szolgálja ki a böngészőnek. Ezzel sávszélességet spórol, és csökkenti a HTTP-kérések számát is. Nézzük meg ugyanezt a példát kikapcsolt betöltővel:

source: Here we can better see the individual files that come from the skins.
hu: Itt jobban láthatjuk az egyes fájlokat, amelyek a felszínekből jönnek.

source: There are different types of CSS files: common files which must always be loaded, and "module-specific" files which are only loaded for special modules within the OTRS framework.
hu: Különböző típusú CSS-fájlok vannak: közös fájlok, amelyeket mindig be kell tölteni, és „modul specifikus” fájlok, amelyek csak az OTRS keretrendszeren belüli speciális moduloknál vannak betöltve.

source: In addition, it is possible to specify CSS files which only must be loaded on IE7 or IE8 (in the case of the customer interface, also IE6). This is unfortunate, but it was not possible to develop a modern GUI on these browsers without having special CSS for them.
hu: Továbbá lehetséges olyan CSS-fájlok megadása, amelyeket csak IE7 vagy IE8 böngészőknél kell betölteni (az ügyfélfelület esetén IE6 böngészőnél is). Ez szerencsétlen ugyan, de ezeknél a böngészőknél nem volt lehetséges egy modern grafikus felhasználói felület kifejlesztése a hozzájuk elkészített speciális CSS nélkül.

source: For details regarding the CSS file types, please see the <link linkend="loader">section on the Loader</link>.
hu: A CSS-fájltípusokra vonatkozó részletekért nézze meg a <link linkend="loader">betöltőről szóló szakaszt</link>.

source: For each HTML page generation, the loader will first take all configured CSS files from the default skin, and then for each file look if it is also available in a custom skin (if a custom skin is selected) and load them after the default files.
hu: Minden egyes HTML-oldal előállításához a betöltő először az alapértelmezett felszínből fogja az összes beállított CSS-fájlt venni, és ezután az egyes fájlok kinézetéhez, ha az egy egyéni felszínben is elérhető (ha egy egyéni felszín ki lett választva), majd betölti azokat az alapértelmezett fájlok után.

source: That means a) that CSS files in custom skins need to have the same names as in the default skins, and b) that a custom skin does not need to have all files of the default skin. That is the big advantage of loading the default skin first: a custom skin has all default CSS rules present and only needs to change those which should result in a different display. That can often be done in a single file, like in the example above.
hu: Ez azt jelenti, hogy az egyéni felszínekben lévő CSS-fájloknak ugyanolyan nevűeknek kell lenniük mint az alapértelmezett felszínekben, és hogy egy egyéni felszínnek nem kell az alapértelmezett felszín összes fájljával rendelkeznie. Ez a nagy előnye az alapértelmezett felszín elsőként való betöltésének: egy egyéni felszínben az összes alapértelmezett CSS-szabály jelen van, és csak azokat szükséges megváltoztatni, amelyeknek eltérő megjelenítést kell eredményezniük. Ez gyakran egyetlen fájllal elvégezhető, mint a fenti példában látható.

source: Another effect of this is that you need to be careful to overwrite all default CSS rules in your custom skins that you want to change. Let's see an example:
hu: Ennek másik hatása, hogy figyelmesnek kell lennie az egyéni felszínekben lévő összes olyan alapértelmezett CSS-szabály felülírásánál, amelyeken változtatni szeretne. Nézzünk egy példát:

source: This defines special headings inside of the <literal>.Header</literal> element as bold, black text. Now if you want to change that in your skin to another color and normal text, it is not enough to write this:
hu: Ez speciális címsorokat határoz meg a <literal>.Header</literal> elemen belül félkövér, fekete szöveggel. Ha most azt szeretné megváltoztatni, hogy a felszínben más színnel és normál szöveggel jelenjen meg, akkor nem elég ezt írni:

source: Because the original rule for <literal>font-weight</literal> still applies. You need to override it explicitly:
hu: Ugyanis az eredeti <literal>font-weight</literal> szabály még mindig alkalmazva lesz. Határozottan felül kell írnia:

source: Creating a New Skin
hu: Új felszín létrehozása

source: In this section, we will be creating a new agent skin which replaces the default OTRS background color (white) with a custom company color (light grey) and the default logo by a custome one. Also we will configure that skin to be the one which all agents will see by default.
hu: Ebben a szakaszban egy új ügyintézői felszínt fogunk létrehozni, amely lecseréli az alapértelmezett (fehér) OTRS háttérszínt egy egyéni (világos szürke) vállalati színre és az alapértelmezett logót egy egyénire. Azt is be fogjuk állítani, hogy ez a felszín legyen az, amelyet az összes ügyintéző alapértelmezetten látni fog.

source: There are only three simple steps we need to take to achieve this goal:
hu: Csak három egyszerű lépést kell megtennünk a cél eléréséhez:

source: create the skin files
hu: a felszínfájlok létrehozását

source: configure the new logo and
hu: az új logó beállítását és

source: make the skin known to the OTRS system.
hu: a felszín megismertetését az OTRS rendszerrel.

source: Let's start by creating the files needed for our new skin. First of all, we need to create a new folder for this skin (we'll call it <literal>custom</literal>). This folder will be <filename>$OTRS_HOME/var/httpd/htdocs/skins/Agent/custom</filename>.
hu: Kezdjük az új felszínünkhöz szükséges fájlok létrehozásával. Először is létre kell hoznunk egy új mappát ehhez a felszínhez (ezt <literal>custom</literal> néven fogjuk hívni). Ez a mappa a következő lesz: <filename>$OTRS_HOME/var/httpd/htdocs/skins/Agent/custom</filename>.

source: In there, we need to place the new CSS file in a new directory <filename>css</filename> which defines the new skin's appearance. We'll call it <filename>Core.Default.css</filename> (remember that it must have the same name as one of the files in the "default" skin). This is the code needed for the CSS file:
hu: Ebben el kell helyeznünk az új CSS-fájlt egy új <filename>css</filename> könyvtárban, amely az új felszín megjelenését fogja meghatározni. Ezt <filename>Core.Default.css</filename> néven fogjuk hívni (emlékezzen arra, hogy ugyanolyan névvel kell rendelkeznie mint az „alapértelmezett” felszínben lévő fájlok egyike). Ez a CSS-fájlhoz szükséges kód:

source: body { background-color: #c0c0c0; /* not very beautiful but it meets our purpose */ }
hu: body { background-color: #c0c0c0; /* nem túl szép, de a célnak megfelel */ }

source: Now follows the second step, adding a new logo and making the new skin known to the OTRS system. For this, we first need to place our custom logo (e.g. <filename>logo.png</filename>) in a new directory (e.g. <filename>img</filename>) in our skin directory. Then we need to create a new config file <filename>$OTRS_HOME/Kernel/Config/Files/CustomSkin.xml</filename>, which will contain the needed settings as follows:
hu: Most következik a második lépés egy új logó hozzáadásával, és az új felszín megismertetésével az OTRS rendszer számára. Ehhez először el kell helyeznünk az egyéni logónkat (például <filename>logo.png</filename>) egy új könyvtárban (például <filename>img</filename>) a saját felszín könyvtárunkban. Ezután létre kell hoznunk egy új <filename>$OTRS_HOME/Kernel/Config/Files/CustomSkin.xml</filename> beállítófájlt, amely tartalmazni fogja a szükséges beállításokat az alábbiak szerint:

source: <?xml version="1.0" encoding="utf-8" ?> <otrs_config version="1.0" init="Changes"> <ConfigItem Name="AgentLogo" Required="0" Valid="1"> <Description Translatable="1">The logo shown in the header of the agent interface. The URL to the image must be a relative URL to the skin image directory.</Description> <Group>Framework</Group> <SubGroup>Frontend::Agent</SubGroup> <Setting> <Hash> <Item Key="URL">skins/Agent/custom/img/logo.png</Item> <Item Key="StyleTop">13px</Item> <Item Key="StyleRight">75px</Item> <Item Key="StyleHeight">67px</Item> <Item Key="StyleWidth">244px</Item> </Hash> </Setting> </ConfigItem> <ConfigItem Name="Loader::Agent::Skin###100-custom" Required="0" Valid="1"> <Description Translatable="1">Custom skin for the development manual.</Description> <Group>Framework</Group> <SubGroup>Frontend::Agent</SubGroup> <Setting> <Hash> <Item Key="InternalName">custom</Item> <Item Key="VisibleName">Custom</Item> <Item Key="Description">Custom skin for the development manual.</Item> <Item Key="HomePage">www.yourcompany.com</Item> </Hash> </Setting> </ConfigItem> </otrs_config>
hu: <?xml version="1.0" encoding="utf-8" ?> <otrs_config version="1.0" init="Changes"> <ConfigItem Name="AgentLogo" Required="0" Valid="1"> <Description Translatable="1"> Az ügyintézői felület fejlécében megjelenített logó. A képre mutató URL-nek a felszín képkönyvtárától relatív URL-nek kell lennie. </Description> <Group>Framework</Group> <SubGroup>Frontend::Agent</SubGroup> <Setting> <Hash> <Item Key="URL">skins/Agent/custom/img/logo.png</Item> <Item Key="StyleTop">13px</Item> <Item Key="StyleRight">75px</Item> <Item Key="StyleHeight">67px</Item> <Item Key="StyleWidth">244px</Item> </Hash> </Setting> </ConfigItem> <ConfigItem Name="Loader::Agent::Skin###100-custom" Required="0" Valid="1"> <Description Translatable="1">Egyéni felszín a fejlesztői kézikönyvhöz.</Description> <Group>Framework</Group> <SubGroup>Frontend::Agent</SubGroup> <Setting> <Hash> <Item Key="InternalName">custom</Item> <Item Key="VisibleName">Egyéni</Item> <Item Key="Description">Egyéni felszín a fejlesztői kézikönyvhöz.</Item> <Item Key="HomePage">www.azencegem.hu</Item> </Hash> </Setting> </ConfigItem> </otrs_config>

source: To make this configuration active, we need to navigate to the SysConfig module in the admin area of OTRS (alternatively, you can run the script <filename>$OTRS_HOME/bin/otrs.Console.pl Maint::Config::Rebuild</filename>). This will regenerate the Perl cache of the XML configuration files, so that our new skin is now known and can be selected in the system. To make it the default skin that new agents see before they made their own skin selection, edit the SysConfig setting <literal>Loader::Agent::DefaultSelectedSkin</literal> and set it to "custom".
hu: A beállítás aktívvá tételéhez el kell navigálnunk az OTRS adminisztrációs területén lévő rendszerbeállítás modulra (alternatív esetben lefuttathatja az <filename>$OTRS_HOME/bin/otrs.Console.pl Maint::Config::Rebuild</filename> parancsfájlt). Ez újra elő fogja állítani az XML beállítófájlok Perl gyorsítótárát azért, hogy az új felszínünk most már ismert legyen, és kiválasztható legyen a rendszeren. Ennek alapértelmezett felszínné tételéhez, amelyet az új ügyintézők azelőtt láthatnak, mielőtt a saját felszínválasztásukat megtennék, szerkessze a <literal>Loader::Agent::DefaultSelectedSkin</literal> rendszerbeállítási paramétert, és állítsa „Egyéni” értékre.

source: In conclusion: to create a new skin in OTRS, we had to place the new logo file, and create one CSS and one XML file, resulting in three new files:
hu: Következtetésképpen: egy új felszín létrehozásához az OTRS-ben el kellett helyeznünk az új logófájlt, és létre kellett hoznunk egy CSS-fájlt és egy XML-fájlt, amely három új fájlt eredményezett:

source: Templating Mechanism
hu: Sablonozó mechanizmus

source: Internally, OTRS uses a templating mechanism to dynamically generate its HTML pages (and other content), while keeping the program logic (Perl) and the presentation (HTML) separate. Typically, a frontend module will use an own template file, pass some data to it and return the rendered result to the user.
hu: Belsőleg az OTRS egy sablonozó mechanizmust használ a HTML oldalak (és egyéb tartalom) dinamikus előállításához, miközben szétválasztva tartja a program logikáját (Perl) és a megjelenítést (HTML). Tipikusan egy előtétprogram modul egy saját sablonfájlt fog használni, át fog adni néhány adatot annak, és vissza fogja adni a megjelenített eredményt a felhasználónak.

source: The template files are located at: <filename>$OTRS_HOME/Kernel/Output/HTML/Standard/*.tt</filename>
hu: A sablonfájlok itt találhatók: <filename>$OTRS_HOME/Kernel/Output/HTML/Standard/*.tt</filename>

source: OTRS relies on <ulink url="http://www.template-toolkit.org/">the Template::Toolkit rendering engine</ulink>. The full Template::Toolkit syntax can be used in OTRS templates. This section describes some example use cases and OTRS extensions to the Template::Toolkit syntax.
hu: Az OTRS a <ulink url="http://www.template-toolkit.org/">Template::Toolkit megjelenítő motorra</ulink> támaszkodik. A teljes Template::Toolkit szintaxis használható az OTRS sablonokban. Ez a szakasz néhány példa használati esetet és OTRS kiterjesztést mutat be a Template::Toolkit szintaxishoz.

source: Template Commands
hu: Sablonparancsok

source: Inserting dynamic data
hu: Dinamikus adatok beszúrása

source: In templates, dynamic data must be inserted, quoted etc. This section lists the relevant commands to do that.
hu: A sablonokba dinamikus adatokat kell beszúrni, idézni, stb. Ez a szakasz sorolja fel a fontos parancsokat ennek elvégzéséhez.
