Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: <div class="WidgetSimple"> <div class="Header"> <h2>[% Translate("General") | html %]</h2> </div> <div class="Content"> <div class="LayoutGrid ColumnsWithSpacing"> <div class="Size1of2"> <fieldset class="TableLike"> <label class="Mandatory" for="Name"><span class="Marker">*</span> [% Translate("Name") | html %]:</label> <div class="Field"> <input id="Name" class="W50pc [% Data.NameServerError | html %] [% Data.ShowWarning | html %] Validate_Alphanumeric" type="text" maxlength="200" value="[% Data.Name | html %]" name="Name"/> <div id="NameError" class="TooltipErrorMessage"><p>[% Translate("This field is required, and the value should be alphabetic and numeric characters only.") | html %]</p></div> <div id="NameServerError" class="TooltipErrorMessage"><p>[% Translate(Data.NameServerErrorMessage) | html %]</p></div> <p class="FieldExplanation">[% Translate("Must be unique and only accept alphabetic and numeric characters.") | html %]</p> <p class="Warning Hidden">[% Translate("Changing this value will require manual changes in the system.") | html %]</p> </div> <div class="Clear"></div> <label class="Mandatory" for="Label"><span class="Marker">*</span> [% Translate("Label") | html %]:</label> <div class="Field"> <input id="Label" class="W50pc [% Data.LabelServerError | html %] Validate_Required" type="text" maxlength="200" value="[% Data.Label | html %]" name="Label"/> <div id="LabelError" class="TooltipErrorMessage"><p>[% Translate("This field is required.") | html %]</p></div> <div id="LabelServerError" class="TooltipErrorMessage"><p>[% Translate(Data.LabelServerErrorMessage) | html %]</p></div> <p class="FieldExplanation">[% Translate("This is the name to be shown on the screens where the field is active.") | html %]</p> </div> <div class="Clear"></div> <label class="Mandatory" for="FieldOrder"><span class="Marker">*</span> [% Translate("Field order") | html %]:</label> <div class="Field"> [% Data.DynamicFieldOrderSrtg %] <div id="FieldOrderError" class="TooltipErrorMessage"><p>[% Translate("This field is required and must be numeric.") | html %]</p></div> <div id="FieldOrderServerError" class="TooltipErrorMessage"><p>[% Translate(Data.FieldOrderServerErrorMessage) | html %]</p></div> <p class="FieldExplanation">[% Translate("This is the order in which this field will be shown on the screens where is active.") | html %]</p> </div> <div class="Clear"></div> </fieldset> </div> <div class="Size1of2"> <fieldset class="TableLike"> <label for="ValidID">[% Translate("Validity") | html %]:</label> <div class="Field"> [% Data.ValidityStrg %] </div> <div class="Clear"></div> <div class="SpacingTop"></div> <label for="FieldTypeName">[% Translate("Field type") | html %]:</label> <div class="Field"> <input id="FieldTypeName" readonly="readonly" class="W50pc" type="text" maxlength="200" value="[% Data.FieldTypeName | html %]" name="FieldTypeName"/> <div class="Clear"></div> </div> <div class="SpacingTop"></div> <label for="ObjectTypeName">[% Translate("Object type") | html %]:</label> <div class="Field"> <input id="ObjectTypeName" readonly="readonly" class="W50pc" type="text" maxlength="200" value="[% Data.ObjectTypeName | html %]" name="ObjectTypeName"/> <div class="Clear"></div> </div> </fieldset> </div> </div> </div> </div>
hu: <div class="WidgetSimple"> <div class="Header"> <h2>[% Translate("Általános") | html %]</h2> </div> <div class="Content"> <div class="LayoutGrid ColumnsWithSpacing"> <div class="Size1of2"> <fieldset class="TableLike"> <label class="Mandatory" for="Name"><span class="Marker">*</span> [% Translate("Név") | html %]:</label> <div class="Field"> <input id="Name" class="W50pc [% Data.NameServerError | html %] [% Data.ShowWarning | html %] Validate_Alphanumeric" type="text" maxlength="200" value="[% Data.Name | html %]" name="Name"/> <div id="NameError" class="TooltipErrorMessage"><p>[% Translate("Ez a mező kötelező, és az értéke csak betű és szám karakter lehet.") | html %]</p></div> <div id="NameServerError" class="TooltipErrorMessage"><p>[% Translate(Data.NameServerErrorMessage) | html %]</p></div> <p class="FieldExplanation">[% Translate("Egyedinek kell lennie, és csak betű és szám karaktereket fogad el.") | html %]</p> <p class="Warning Hidden">[% Translate("Az érték megváltoztatása kézi módosításokat fog igényelni a rendszeren.") | html %]</p> </div> <div class="Clear"></div> <label class="Mandatory" for="Label"><span class="Marker">*</span> [% Translate("Címke") | html %]:</label> <div class="Field"> <input id="Label" class="W50pc [% Data.LabelServerError | html %] Validate_Required" type="text" maxlength="200" value="[% Data.Label | html %]" name="Label"/> <div id="LabelError" class="TooltipErrorMessage"><p>[% Translate("Ez a mező kötelező.") | html %]</p></div> <div id="LabelServerError" class="TooltipErrorMessage"><p>[% Translate(Data.LabelServerErrorMessage) | html %]</p></div> <p class="FieldExplanation">[% Translate("Ez azokon a képernyőkön megjelenítendő név, ahol a mező aktív.") | html %]</p> </div> <div class="Clear"></div> <label class="Mandatory" for="FieldOrder"><span class="Marker">*</span> [% Translate("Mezősorrend") | html %]:</label> <div class="Field"> [% Data.DynamicFieldOrderSrtg %] <div id="FieldOrderError" class="TooltipErrorMessage"><p>[% Translate("Ez a mező kötelező, és csak számot tartalmazhat.") | html %]</p></div> <div id="FieldOrderServerError" class="TooltipErrorMessage"><p>[% Translate(Data.FieldOrderServerErrorMessage) | html %]</p></div> <p class="FieldExplanation">[% Translate("Ez az a sorrend, amelyben ez a mező meg fog jelenni a képernyőkön, ahol aktív.") | html %]</p> </div> <div class="Clear"></div> </fieldset> </div> <div class="Size1of2"> <fieldset class="TableLike"> <label for="ValidID">[% Translate("Érvényesség") | html %]:</label> <div class="Field"> [% Data.ValidityStrg %] </div> <div class="Clear"></div> <div class="SpacingTop"></div> <label for="FieldTypeName">[% Translate("Mezőtípus") | html %]:</label> <div class="Field"> <input id="FieldTypeName" readonly="readonly" class="W50pc" type="text" maxlength="200" value="[% Data.FieldTypeName | html %]" name="FieldTypeName"/> <div class="Clear"></div> </div> <div class="SpacingTop"></div> <label for="ObjectTypeName">[% Translate("Objektumtípus") | html %]:</label> <div class="Field"> <input id="ObjectTypeName" readonly="readonly" class="W50pc" type="text" maxlength="200" value="[% Data.ObjectTypeName | html %]" name="ObjectTypeName"/> <div class="Clear"></div> </div> </fieldset> </div> </div> </div> </div>

source: This first widget contains the common form attributes for the Dynamic Fields. For consistency with other Dynamic Fields is recommended to leave this part of the code unchanged.
hu: Ez az első felületi elem tartalmazza a szokásos űrlapattribútumokat a dinamikus mezőkhöz. A többi dinamikus mezővel való következetességért javasolt a kód ezen részének változatlanul hagyása.

source: <div class="WidgetSimple"> <div class="Header"> <h2>[% Translate(Data.FieldTypeName) | html %] [% Translate("Field Settings") | html %]</h2> </div> <div class="Content"> <fieldset class="TableLike"> <label for="DefaultValue">[% Translate("Default value") | html %]:</label> <div class="Field"> <input id="DefaultValue" class="W50pc" type="text" maxlength="200" value="[% Data.DefaultValue | html %]" name="DefaultValue"/> <p class="FieldExplanation">[% Translate("This is the default value for this field.") | html %]</p> </div> <div class="Clear"></div> <label for="ShowValue">[% Translate("Show value") | html %]:</label> <div class="Field"> [% Data.ShowValueStrg %] <p class="FieldExplanation"> [% Translate("To reveal the field value in non edit screens ( e.g. Ticket Zoom Screen )") | html %] </p> </div> <div class="Clear"></div> <label for="ValueMask">[% Translate("Hidden value mask") | html %]:</label> <div class="Field"> <input id="ValueMask" class="W50pc" type="text" maxlength="200" value="[% Data.ValueMask | html %]" name="ValueMask"/> <p class="FieldExplanation"> [% Translate("This is the alternate value to show if Show value is set to \"No\" ( Default: **** ).") | html %] </p> </div> <div class="Clear"></div> </fieldset> </div> </div>
hu: <div class="WidgetSimple"> <div class="Header"> <h2>[% Translate(Data.FieldTypeName) | html %] [% Translate("Mezőbeállítások") | html %]</h2> </div> <div class="Content"> <fieldset class="TableLike"> <label for="DefaultValue">[% Translate("Alapértelmezett érték") | html %]:</label> <div class="Field"> <input id="DefaultValue" class="W50pc" type="text" maxlength="200" value="[% Data.DefaultValue | html %]" name="DefaultValue"/> <p class="FieldExplanation">[% Translate("Ez az alapértelmezett érték ehhez a mezőhöz.") | html %]</p> </div> <div class="Clear"></div> <label for="ShowValue">[% Translate("Érték megjelenítése") | html %]:</label> <div class="Field"> [% Data.ShowValueStrg %] <p class="FieldExplanation"> [% Translate("A mezőérték felfedéséhez a nem szerkesztői képernyőkön (például jegynagyítás képernyő)") | html %] </p> </div> <div class="Clear"></div> <label for="ValueMask">[% Translate("Rejtett értékmaszk") | html %]:</label> <div class="Field"> <input id="ValueMask" class="W50pc" type="text" maxlength="200" value="[% Data.ValueMask | html %]" name="ValueMask"/> <p class="FieldExplanation"> [% Translate("Ez az alternatív érték annak megjelenítéséhez, ha az Érték megjelenítése „Nem” értékre van állítva (Alapértelmezett: **** ).") | html %] </p> </div> <div class="Clear"></div> </fieldset> </div> </div>

source: The second widget has the Dynamic Field specific form attributes. This is the place where new attributes can be set and it could use JavaScript and AJAX technologies to make it more easy or friendly for the end user.
hu: A második felületi elem a dinamikus mezőre jellemző űrlapattribútumokkal rendelkezik. Ez az a hely, ahol az új attribútumok beállíthatók, és használhatnak JavaScript és AJAX technológiákat, hogy egyszerűbbé és barátságosabbá tegyék a végfelhasználó számára.

source: <fieldset class="TableLike"> <div class="Field SpacingTop"> <button type="submit" class="Primary" value="[% Translate("Save") | html %]">[% Translate("Save") | html %]</button> [% Translate("or") | html %] <a href="[% Env("Baselink") %]Action=AdminDynamicField">[% Translate("Cancel") | html %]</a> </div> <div class="Clear"></div> </fieldset> </form> </div> </div> [% WRAPPER JSOnDocumentComplete %] <script type="text/javascript">//<![CDATA[ $('.ShowWarning').bind('change keyup', function (Event) { $('p.Warning').removeClass('Hidden'); }); Core.Agent.Admin.DynamicField.ValidationInit(); //
hu: <fieldset class="TableLike"> <div class="Field SpacingTop"> <button type="submit" class="Primary" value="[% Translate("Save") | html %]">[% Translate("Mentés") | html %]</button> [% Translate("vagy") | html %] <a href="[% Env("Baselink") %]Action=AdminDynamicField">[% Translate("Mégse") | html %]</a> </div> <div class="Clear"></div> </fieldset> </form> </div> </div> [% WRAPPER JSOnDocumentComplete %] <script type="text/javascript">//<![CDATA[ $('.ShowWarning').bind('change keyup', function (Event) { $('p.Warning').removeClass('Hidden'); }); Core.Agent.Admin.DynamicField.ValidationInit(); //

source: The final part of the file contains the "Submit" button and the "Cancel" link, as well as other needed JavaScript code.
hu: A fájl utolsó része tartalmazza a „Mentés” gombot és a „Mégse” hivatkozást, valamint az egyéb szükséges JavaScript kódot.

source: Dynamic Field Admin Dialog Example
hu: Dinamikus mező adminisztrátori párbeszédablak példa

source: The Admin Dialogs are standard Admin modules to manage (add or edit) the Dynamic Fields.
hu: Az adminisztrátori párbeszédablakok szabványos adminisztrátori modulok a dinamikus mezők kezeléséhez (hozzáadás vagy szerkesztés).

source: In this section an Admin Dialog for password dynamic field is shown and explained.
hu: Ebben a szakaszban a jelszó dinamikus mezőhöz egy adminisztrátori párbeszédablak van megjelenítve és elmagyarázva.

source: # -- # Kernel/Modules/AdminDynamicFieldPassword.pm - provides a dynamic fields password config view for admins # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Modules::AdminDynamicFieldPassword; use strict; use warnings; use Kernel::System::VariableCheck qw(:all); use Kernel::System::Valid; use Kernel::System::CheckItem; use Kernel::System::DynamicField;
hu: # -- # Kernel/Modules/AdminDynamicFieldPassword.pm - dinamikus mezők jelszó beállítási nézetét biztosítja az adminisztrátoroknak # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Modules::AdminDynamicFieldPassword; use strict; use warnings; use Kernel::System::VariableCheck qw(:all); use Kernel::System::Valid; use Kernel::System::CheckItem; use Kernel::System::DynamicField;

source: sub new { my ( $Type, %Param ) = @_; my $Self = {%Param}; bless( $Self, $Type ); for (qw(ParamObject LayoutObject LogObject ConfigObject)) { if ( !$Self->{$_} ) { $Self->{LayoutObject}->FatalError( Message => "Got no $_!" ); } } # create additional objects $Self->{ValidObject} = Kernel::System::Valid->new( %{$Self} ); $Self->{DynamicFieldObject} = Kernel::System::DynamicField->new( %{$Self} ); # get configured object types $Self->{ObjectTypeConfig} = $Self->{ConfigObject}->Get('DynamicFields::ObjectType'); # get the fields config $Self->{FieldTypeConfig} = $Self->{ConfigObject}->Get('DynamicFields::Backend') || {}; $Self->{DefaultValueMask} = '****'; return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; my $Self = {%Param}; bless( $Self, $Type ); for (qw(ParamObject LayoutObject LogObject ConfigObject)) { if ( !$Self->{$_} ) { $Self->{LayoutObject}->FatalError( Message => "Nincs $_!" ); } } # további objektumok létrehozása $Self->{ValidObject} = Kernel::System::Valid->new( %{$Self} ); $Self->{DynamicFieldObject} = Kernel::System::DynamicField->new( %{$Self} ); # beállított objektumtípusok lekérése $Self->{ObjectTypeConfig} = $Self->{ConfigObject}->Get('DynamicFields::ObjectType'); # a mezők beállításának lekérése $Self->{FieldTypeConfig} = $Self->{ConfigObject}->Get('DynamicFields::Backend') || {}; $Self->{DefaultValueMask} = '****'; return $Self; }

source: The constructor <literal>new</literal> creates a new instance of the class. According to the coding guidelines objects of other classes that are needed in this module have to be created in <literal>new</literal>.
hu: A <literal>new</literal> konstruktor hozza létre az osztály új példányát. A kódolási irányelvek szerint más osztályoknak azon objektumait kell a <literal>new</literal> konstruktorban létrehozni, amelyek ebben a modulban szükségesek.

source: sub Run { my ( $Self, %Param ) = @_; if ( $Self->{Subaction} eq 'Add' ) { return $Self->_Add( %Param, ); } elsif ( $Self->{Subaction} eq 'AddAction' ) { # challenge token check for write action $Self->{LayoutObject}->ChallengeTokenCheck(); return $Self->_AddAction( %Param, ); } if ( $Self->{Subaction} eq 'Change' ) { return $Self->_Change( %Param, ); } elsif ( $Self->{Subaction} eq 'ChangeAction' ) { # challenge token check for write action $Self->{LayoutObject}->ChallengeTokenCheck(); return $Self->_ChangeAction( %Param, ); } return $Self->{LayoutObject}->ErrorScreen( Message => "Undefined subaction.", ); }
hu: sub Run { my ( $Self, %Param ) = @_; if ( $Self->{Subaction} eq 'Add' ) { return $Self->_Add( %Param, ); } elsif ( $Self->{Subaction} eq 'AddAction' ) { # kihívási token ellenőrzése az írási művelethez $Self->{LayoutObject}->ChallengeTokenCheck(); return $Self->_AddAction( %Param, ); } if ( $Self->{Subaction} eq 'Change' ) { return $Self->_Change( %Param, ); } elsif ( $Self->{Subaction} eq 'ChangeAction' ) { # kihívási token ellenőrzése az írási művelethez $Self->{LayoutObject}->ChallengeTokenCheck(); return $Self->_ChangeAction( %Param, ); } return $Self->{LayoutObject}->ErrorScreen( Message => "Meghatározatlan alművelet.", ); }

source: <literal>Run</literal> is the default function to be called by the web request. We try to make this function as simple as possible and let the helper functions to do the "hard" work.
hu: A <literal>Run</literal> a webkérés által meghívott alapértelmezett függvény. Megpróbáljuk ezt a függvényt annyira egyszerűvé tenni, amennyire csak lehetséges, és lehetővé tenni a segítő függvényeknek a „kemény” munka elvégzését.

source: sub _Add { my ( $Self, %Param ) = @_; my %GetParam; for my $Needed (qw(ObjectType FieldType FieldOrder)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$Needed ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Need $Needed", ); } } # get the object type and field type display name my $ObjectTypeName = $Self->{ObjectTypeConfig}->{ $GetParam{ObjectType} }->{DisplayName} || ''; my $FieldTypeName = $Self->{FieldTypeConfig}->{ $GetParam{FieldType} }->{DisplayName} || ''; return $Self->_ShowScreen( %Param, %GetParam, Mode => 'Add', ObjectTypeName => $ObjectTypeName, FieldTypeName => $FieldTypeName, ); }
hu: sub _Add { my ( $Self, %Param ) = @_; my %GetParam; for my $Needed (qw(ObjectType FieldType FieldOrder)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$Needed ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Szükséges: $Needed", ); } } # az objektumtípus és a mezőtípus megjelenített nevének lekérése my $ObjectTypeName = $Self->{ObjectTypeConfig}->{ $GetParam{ObjectType} }->{DisplayName} || ''; my $FieldTypeName = $Self->{FieldTypeConfig}->{ $GetParam{FieldType} }->{DisplayName} || ''; return $Self->_ShowScreen( %Param, %GetParam, Mode => 'Add', ObjectTypeName => $ObjectTypeName, FieldTypeName => $FieldTypeName, ); }

source: <code>_Add</code> function is also pretty simple, it just get some parameters from the web request and call the <code>_ShowScreen()</code> function. Normally this function is not needed to be modified.
hu: Az <code>_Add</code> függvény is nagyon egyszerű, csak lekér néhány paramétert a webkérésből, és meghívja a <code>_ShowScreen()</code> függvényt. Normális esetben ezt a függvényt nem szükséges módosítani.

source: sub _AddAction { my ( $Self, %Param ) = @_; my %Errors; my %GetParam; for my $Needed (qw(Name Label FieldOrder)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$GetParam{$Needed} ) { $Errors{ $Needed . 'ServerError' } = 'ServerError'; $Errors{ $Needed . 'ServerErrorMessage' } = 'This field is required.'; } } if ( $GetParam{Name} ) { # check if name is alphanumeric if ( $GetParam{Name} !~ m{\A ( ?: [a-zA-Z] | \d )+ \z}xms ) { # add server error error class $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'The field does not contain only ASCII letters and numbers.'; } # check if name is duplicated my %DynamicFieldsList = %{ $Self->{DynamicFieldObject}->DynamicFieldList( Valid => 0, ResultType => 'HASH', ) }; %DynamicFieldsList = reverse %DynamicFieldsList; if ( $DynamicFieldsList{ $GetParam{Name} } ) { # add server error error class $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'There is another field with the same name.'; } } if ( $GetParam{FieldOrder} ) { # check if field order is numeric and positive if ( $GetParam{FieldOrder} !~ m{\A ( ?: \d )+ \z}xms ) { # add server error error class $Errors{FieldOrderServerError} = 'ServerError'; $Errors{FieldOrderServerErrorMessage} = 'The field must be numeric.'; } } for my $ConfigParam ( qw( ObjectType ObjectTypeName FieldType FieldTypeName DefaultValue ValidID ShowValue ValueMask ) ) { $GetParam{$ConfigParam} = $Self->{ParamObject}->GetParam( Param => $ConfigParam ); } # uncorrectable errors if ( !$GetParam{ValidID} ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Need ValidID", ); } # return to add screen if errors if (%Errors) { return $Self->_ShowScreen( %Param, %Errors, %GetParam, Mode => 'Add', ); } # set specific config my $FieldConfig = { DefaultValue => $GetParam{DefaultValue}, ShowValue => $GetParam{ShowValue}, ValueMask => $GetParam{ValueMask} || $Self->{DefaultValueMask}, }; # create a new field my $FieldID = $Self->{DynamicFieldObject}->DynamicFieldAdd( Name => $GetParam{Name}, Label => $GetParam{Label}, FieldOrder => $GetParam{FieldOrder}, FieldType => $GetParam{FieldType}, ObjectType => $GetParam{ObjectType}, Config => $FieldConfig, ValidID => $GetParam{ValidID}, UserID => $Self->{UserID}, ); if ( !$FieldID ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Could not create the new field", ); } return $Self->{LayoutObject}->Redirect( OP => "Action=AdminDynamicField", ); }
hu: sub _AddAction { my ( $Self, %Param ) = @_; my %Errors; my %GetParam; for my $Needed (qw(Name Label FieldOrder)) { $GetParam{$Needed} = $Self->{ParamObject}->GetParam( Param => $Needed ); if ( !$GetParam{$Needed} ) { $Errors{ $Needed . 'ServerError' } = 'ServerError'; $Errors{ $Needed . 'ServerErrorMessage' } = 'Ez a mező kötelező.'; } } if ( $GetParam{Name} ) { # annak ellenőrzése, hogy a név csak betűket és számokat tartalmaz-e if ( $GetParam{Name} !~ m{\A ( ?: [a-zA-Z] | \d )+ \z}xms ) { # kiszolgálóhiba hibaosztály hozzáadása $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'A mező nem csak ASCII betűket és számokat tartalmaz.'; } # annak ellenőrzése, hogy a név kettőzött-e my %DynamicFieldsList = %{ $Self->{DynamicFieldObject}->DynamicFieldList( Valid => 0, ResultType => 'HASH', ) }; %DynamicFieldsList = reverse %DynamicFieldsList; if ( $DynamicFieldsList{ $GetParam{Name} } ) { # kiszolgálóhiba hibaosztály hozzáadása $Errors{NameServerError} = 'ServerError'; $Errors{NameServerErrorMessage} = 'Már létezik egy másik ugyanilyen nevű mező.'; } } if ( $GetParam{FieldOrder} ) { # annak ellenőrzése, hogy a mezősorrend számszerű és pozitív-e if ( $GetParam{FieldOrder} !~ m{\A ( ?: \d )+ \z}xms ) { # kiszolgálóhiba hibaosztály hozzáadása $Errors{FieldOrderServerError} = 'ServerError'; $Errors{FieldOrderServerErrorMessage} = 'A mezőnek számnak kell lennie.'; } } for my $ConfigParam ( qw( ObjectType ObjectTypeName FieldType FieldTypeName DefaultValue ValidID ShowValue ValueMask ) ) { $GetParam{$ConfigParam} = $Self->{ParamObject}->GetParam( Param => $ConfigParam ); } # kijavíthatatlan hibák if ( !$GetParam{ValidID} ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Szükséges: ValidID", ); } # visszatérés a hozzáadás képernyőre, ha hibák vannak if (%Errors) { return $Self->_ShowScreen( %Param, %Errors, %GetParam, Mode => 'Add', ); } # bizonyos beállítások elvégzése my $FieldConfig = { DefaultValue => $GetParam{DefaultValue}, ShowValue => $GetParam{ShowValue}, ValueMask => $GetParam{ValueMask} || $Self->{DefaultValueMask}, }; # egy új mező létrehozása my $FieldID = $Self->{DynamicFieldObject}->DynamicFieldAdd( Name => $GetParam{Name}, Label => $GetParam{Label}, FieldOrder => $GetParam{FieldOrder}, FieldType => $GetParam{FieldType}, ObjectType => $GetParam{ObjectType}, Config => $FieldConfig, ValidID => $GetParam{ValidID}, UserID => $Self->{UserID}, ); if ( !$FieldID ) { return $Self->{LayoutObject}->ErrorScreen( Message => "Nem sikerült létrehozni az új mezőt", ); } return $Self->{LayoutObject}->Redirect( OP => "Action=AdminDynamicField", ); }
