Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # for git master shell> git clone git@github.com:OTRS/otrs.git -b master # for a specific branch like OTRS 3.3 shell> git clone git@github.com:OTRS/otrs.git -b rel-3_3
hu: # a git master ágnál shell> git clone git@github.com:OTRS/otrs.git -b master # egy adott ágnál, például OTRS 3.3 shell> git clone git@github.com:OTRS/otrs.git -b rel-3_3

source: Check out the <literal>module-tools</literal> module (from github) too, for your development environment. It contains a number of useful tools:
hu: Töltse le a <literal>module-tools</literal> modult is (a githubról) a fejlesztői környezetéhez. Ez számos hasznos eszközt tartalmaz:

source: Please configure the OTRS system according to the <ulink url="http://otrs.github.io/doc/manual/admin/stable/en/html/installation.html">installation instructions</ulink> in the admin manual.
hu: Állítsa be az OTRS rendszert az adminisztrációs kézikönyvben olvasható <ulink url="http://otrs.github.io/doc/manual/admin/stable/en/html/installation.html">telepítési utasítások</ulink> szerint.

source: Useful Tools
hu: Hasznos eszközök

source: There are two modules that are highly recommended for OTRS development: <ulink url="https://github.com/OTRS/otrscodepolicy">OTRSCodePolicy</ulink> and <ulink url="https://github.com/OTRS/Fred">Fred</ulink>.
hu: Létezik két modul, amely erősen ajánlott az OTRS fejlesztésnél: <ulink url="https://github.com/OTRS/otrscodepolicy">OTRSCodePolicy</ulink> és <ulink url="https://github.com/OTRS/Fred">Fred</ulink>.

source: OTRSCodePolicy is a code quality checker that enforces the use of common coding standards also for the OTRS development team. It is highly recommended to use it if you plan to make contributions. You can use it as a standalone test script or even register it as a git commit hook that runs every time that you create a commit. Please see <ulink url="https://github.com/OTRS/otrscodepolicy/blob/master/doc/en/OTRSCodePolicy.xml"> the module documentation </ulink> for details.
hu: Az OTRSCodePolicy egy kódolási minőségellenőrző, amely kikényszeríti a közös kódolási szabványok használatát az OTRS fejlesztőcsapatnál is. Erősen ajánlott ennek használata, ha hozzájárulásokat tervez készíteni. Használhatja önálló tesztelő parancsfájlként, vagy akár regisztrálhatja egy olyan git véglegesítés horogként, amely minden alkalommal lefut, amikor egy véglegesítést készít. A részletekért nézze meg a <ulink url="https://github.com/OTRS/otrscodepolicy/blob/master/doc/en/OTRSCodePolicy.xml">modul dokumentációját</ulink>.

source: Fred is a little development helper module that you can actually install or link (as described below) into your development system. It features several helpful modules that you can activate, such as an SQL logger or an STDERR console. You can find some more details in its <ulink url="https://github.com/OTRS/Fred/blob/master/doc/en/Fred.xml">module documentation</ulink>.
hu: A Fred egy kicsi fejlesztést segítő modul, amelyet ténylegesen telepíthet vagy hozzákapcsolhat (a lent leírt módon) a fejlesztői rendszeréhez. Számos hasznos modult szerepeltet, amelyet bekapcsolhat, mint például egy SQL naplózóként vagy egy szabványos hibakimenet konzolként. Néhány további részletet találhat a <ulink url="https://github.com/OTRS/Fred/blob/master/doc/en/Fred.xml">modul dokumentációjában</ulink>.

source: By the way, these tools are also open source, and we will be happy about any improvements that you can contribute.
hu: Mellesleg ezek az eszközök szintén nyílt forrásúak, és nagyon örülnénk bármilyen továbbfejlesztésnek, amellyel hozzájárul.

source: Linking Expansion Modules
hu: Bővítőmodulok hozzákapcsolása

source: A clear separation between OTRS and the modules is necessary for proper developing. Particularly when using a git clone, a clear separation is crucial. In order to facilitate the OTRS access the files, links must be created. This is done by a script in the directory module tools repository. Example: Linking the Calendar Module:
hu: Egyértelmű szétválasztás szükséges az OTRS és a modulok között a megfelelő fejlesztéshez. Különösen egy git klón használatakor kritikus az egyértelmű szétválasztás. Annak érdekében, hogy megkönnyítse az OTRS-nek a fájlokhoz történő hozzáférést, linkeket kell létrehozni. Ez megtehető a könyvtármodul eszközök tárolójában lévő parancsfájllal. Példa: a Naptár modul hozzákapcsolása:

source: Whenever new files are added, they must be linked as described above.
hu: Amikor új fájlok kerülnek hozzáadásara, akkor azokat a fent bemutatott módon kell hozzákapcsolni.

source: As soon as the linking is completed, the SysConfig must be rebuilt to register the module in OTRS. Additional SQL or Perl code from the module must also be executed. Example:
hu: Amint a hozzákapcsolás befejeződött, újra kell építeni a rendszerbeállításokat a modul regisztrálásához az OTRS-be. A további SQL vagy Perl-kódot is végre kell hajtani a modulból. Példa:

source: To remove links from OTRS enter the following command:
hu: A kapcsolatoknak az OTRS-ből történő eltávolításához adja ki a következő parancsot:

source: Config Mechanism
hu: Beállítási mechanizmus

source: OTRS comes with a dedicated mechanism to manage configuration options via a graphical interface (System Configuration). This section describes how it works internally and how you can provide new configuration options or change existing default values.
hu: Az OTRS dedikált mechanizmussal érkezik a konfigurációs beállítások kezeléséhez egy grafikus felületen (rendszerbeállításokon) keresztül. Ez a szakasz azt írja le, hogy hogyan működik belsőleg, és hogyan adhat meg új konfigurációs beállításokat, vagy hogyan változtathatja meg a meglévő alapértelmezett értékeket.

source: <filename>Defaults.pm</filename>: OTRS Default Configuration
hu: <filename>Defaults.pm</filename>: az OTRS alapértelmezett beállításai

source: The default configuration file of OTRS is <filename>Kernel/Config/Defaults.pm</filename>. This file is needed for operation of freshly installed systems without a deployed XML configuration and should be left untouched as it is automatically updated on framework updates.
hu: Az OTRS alapértelmezett beállítófájlja a <filename>Kernel/Config/Defaults.pm</filename>. Ez a fájl szükséges az üzembe állított XML-beállítások nélküli, frissen telepített rendszerek működéséhez, és a fájlt érintetlenül kell hagyni, mivel automatikusan frissítésre kerül a keretrendszer frissítéseikor.

source: Automatically Generated Configuration Files
hu: Automatikusan előállított beállítófájlok

source: In <filename>Kernel/Config/Files</filename> you can find some automatically generated configuration files:
hu: A <filename>Kernel/Config/Files</filename> mappában néhány automatikusan előállított beállítófájl található:

source: Perl cache of the XML configuration's current values (default or modified by user)
hu: Az XML beállítások aktuális értékeinek Perl gyorsítótára (alapértelmezett vagy a felhasználó által módosított)

source: Perl cache of ACL configuration from database
hu: Az adatbázisból származó ACL beállítások Perl gyorsítótára

source: Perl cache of ProcessManagement configuration from database
hu: Az adatbázisból származó folyamatmenedzsment beállítások Perl gyorsítótára

source: These files are a Perl representation of the current system configuration. They should never be manually changed as they are overwritten by OTRS.
hu: Ezek a fájlok az aktuális rendszerbeállítások Perl változatai. Sosem szabad kézzel megváltoztatni, mivel az OTRS felülírja azokat.

source: XML Configuration Files
hu: XML beállítófájlok

source: In OTRS, configuration options that the administrator can configure via SysConfig are provided via XML files with a special format. To convert old XML's you can use 'otrs.Console.pl Dev::Tools::Migrate::ConfigXMLStructure' command. The file <filename>Kernel/Config/Files/ZZZAAuto.pm</filename> is a cached Perl version of the XML that contains all settings with their current value. It can be (re-)generated with <filename>bin/otrs.Console.pl Maint::Config::Rebuild</filename>.
hu: Az OTRS-ben azok a beállítási lehetőségek, amelyeket az adminisztrátor a rendszerbeállításokon keresztül be tud állítani, különleges formátumban lévő XML-fájlokon keresztül biztosítottak. A régi XML-ek átalakításához használhatja a <filename>otrs.Console.pl Dev::Tools::Migrate::ConfigXMLStructure</filename> parancsot. A <filename>Kernel/Config/Files/ZZZAAuto.pm</filename> fájl az XML gyorsítótárazott Perl verziója, amely tartalmazza az összes beállítás azok aktuális értékeivel. Újra előállíthatók a <filename>bin/otrs.Console.pl Maint::Config::Rebuild</filename> paranccsal.

source: <literal>Note:</literal> <filename>$OTRS_HOME/Kernel/Config/Files/ZZZAuto.pm</filename> does not exist any more, it has been merged into <filename>$OTRS_HOME/Kernel/Config/Files/ZZZAAuto.pm</filename>.
hu: <literal>Megjegyzés:</literal> Az <filename>$OTRS_HOME/Kernel/Config/Files/ZZZAuto.pm</filename> fájl többé nem létezik, be lett olvasztva az <filename>$OTRS_HOME/Kernel/Config/Files/ZZZAAuto.pm</filename> fájlba.

source: Each XML config file has the following layout:
hu: Az egyes XML beállítófájloknak a következő elrendezésük van:

source: <?xml version="1.0" encoding="utf-8" ?> <otrs_config version="2.0" init="Changes"> <!-- settings will be here --> </otrs_config>
hu: <?xml version="1.0" encoding="utf-8" ?> <otrs_config version="2.0" init="Changes"> <!-- itt lesznek a beállítások --> </otrs_config>

source: Attributes of the <literal>otrs_config</literal> element
hu: Az <literal>otrs_config</literal> elem attribútumai

source: The global <literal>init</literal> attribute describes where the config options should be loaded. There are different levels available and will be loaded/overloaded in the following order: <literal>Framework</literal> (for framework settings e. g. session option), <literal>Application</literal> (for application settings e. g. ticket options), <literal>Config</literal> (for extensions to existing applications e. g. ITSM options) and <literal>Changes</literal> (for custom development e. g. to overwrite framework or ticket options).
hu: A globális <literal>init</literal> attribútum azt írja le, hogy honnan kell a beállítási lehetőségeket betölteni. Különböző szintek érhetők el, és a következő sorrendben lesznek betöltve/felülírva: <literal>Framework</literal> (a keretrendszer beállításaihoz, például munkamenet beállítás), <literal>Application</literal> (az alkalmazás beállításaihoz, például jegybeállítások), <literal>Config</literal> (kiterjesztésekhez a meglévő alkalmazásoknál, például ITSM beállítások) és <literal>Changes</literal> (egyéni fejlesztésekhez, például keretrendszer vagy jegybeállítások felülírásához).

source: The configuration items are written as <literal>Setting</literal> elements with a <literal>Description</literal>, a <literal>Navigation</literal> group (for the tree-based navigation in the GUI) and the <literal>Value</literal> that it represents. Here's an example:
hu: A beállítási elemek <literal>Setting</literal> elemekként vannak írva egy <literal>Description</literal> leírással, egy <literal>Navigation</literal> csoporttal (a fa alapú navigációhoz a grafikus felhasználói felületen) és a <literal>Value</literal> értékkel, amely azt képviseli. Álljon itt egy példa:

source: Attributes of the <literal>Setting</literal> element
hu: A <literal>Setting</literal> elem attribútumai

source: If this is set to 1, the config setting cannot be disabled.
hu: Ha ez 1 értékre van állítva, akkor a konfigurációs beállítást nem lehet letiltani.

source: Determines if the config setting is active (1) or inactive (0) by default.
hu: Meghatározza, hogy a konfigurációs beállítás alapértelmezetten be van kapcsolva (1) vagy ki van kapcsolva (0).

source: If the optional attribute <literal>ConfigLevel</literal> is set, the config variable might not be edited by the administrator, depending on his own config level. The config variable <literal>ConfigLevel</literal> sets the level of technical experience of the administrator. It can be 100 (Expert), 200 (Advanced) or 300 (Beginner). As a guideline which config level should be given to an option, it is recommended that all options having to do with the configuration of external interaction, like Sendmail, LDAP, SOAP, and others should get a config level of at least 200 (Advanced).
hu: Ha az opcionális <literal>ConfigLevel</literal> attribútum be van állítva, akkor a beállítási változót esetleg nem szerkesztheti az adminisztrátor a saját beállítási szintjétől függően. A <literal>ConfigLevel</literal> beállítási változó állítja be az adminisztrátor szakmai tapasztalatának szintjét. Lehet 100 (Szakértő), 200 (Speciális) vagy 300 (Kezdő). Iránymutatásként, hogy mely beállítási szintet kell egy lehetőséghez megadni, az az ajánlott, hogy az összes olyan lehetőségnek, amelyet külső interakció beállításával kell megtenni (mint például Sendmail, LDAP, SOAP és egyebek), legalább 200 (Speciális) beállítási szintet kell kapnia.

source: If set to 1, the config setting is not shown in the GUI.
hu: Ha 1 értékre van állítva, akkor a konfigurációs beállítás nem jelenik meg a grafikus felhasználói felületen.

source: If set to 1, the config setting cannot be changed in the GUI.
hu: Ha 1 értékre van állítva, akkor a konfigurációs beállítást nem lehet megváltoztatni a grafikus felhasználói felületen.

source: If <literal>UserModificationPossible</literal> is set to <literal>1</literal>, administrators can enable user modifications of this setting (in user preferences). Please note that this feature requires the <emphasis role="bold">OTRS Business Solution™</emphasis>.
hu: Ha a <literal>UserModificationPossible</literal> <literal>1</literal> értékre van állítva, akkor az adminisztrátorok engedélyezhetik a beállítás felhasználói módosításait (a felhasználói beállításokban). Ne feledje, hogy ez a funkció az <emphasis role="bold">OTRS Business Solution™</emphasis> meglétét igényli.

source: If <literal>UserModificationActive</literal> is set to <literal>1</literal>, user modifications of this setting is enabled (in user preferences). You should use this attribute together with <literal>UserModificationPossible</literal>.
hu: Ha a <literal>UserModificationActive</literal> <literal>1</literal> értékre van állítva, akkor a beállítás felhasználói módosításai engedélyezve vannak (a felhasználói beállításokban). Ezt az attribútumot a <literal>UserModificationPossible</literal> attribútummal együtt kell használnia.

source: Use <literal>UserPreferencesGroup</literal> attribute to define under which group config variable belongs (in the UserPreferences screen). You should use this attribute together with <literal>UserModificationPossible</literal>.
hu: Használja a <literal>UserPreferencesGroup</literal> attribútumot annak meghatározásához, hogy mely csoport alá tartozik a konfigurációs érték (a felhasználói beállítások képernyőn). Ezt az attribútumot a <literal>UserModificationPossible</literal> attribútummal együtt kell használnia.

source: Guidelines for placing settings in the right <literal>Navigation</literal> nodes
hu: Iránymutatások a beállítások megfelelő <literal>Navigation</literal> csomópontokba való elhelyezéséhez

source: Only create new nodes if neccessary. Avoid nodes with only very few settings if possible.
hu: Csak akkor hozzon létre új csomópontot, ha szükséges. Kerülje a csak nagyon kevés beállítással rendelkező csomópontokat, ha lehetséges.

source: On the first tree level, no new nodes should be added.
hu: A fa első szintjén nem szabad új csomópontokat hozzáadni.

source: Don't place new settings in <literal>Core</literal> directly. This is reserved for a few important global settings.
hu: Ne tegyen új beállításokat a <literal>Core</literal> csomópontba közvetlenül. Ez néhány fontos globális beállításnak van fenntartva.

source: <literal>Core::*</literal> can take new groups that contain settings that cover the same topic (like <literal>Core::Email</literal>) or relate to the same entity (like <literal>Core::Queue</literal>).
hu: A <literal>Core::*</literal> kaphat új csoportokat, amelyek hasonló témát lefedő beállításokat tartalmaznak (például <literal>Core::Email</literal>) vagy ugyanahhoz az entitáshoz kapcsolódnak (például <literal>Core::Queue</literal>).

source: All event handler registrations go to <literal>Core::Event</literal>.
hu: Az összes eseménykezelő regisztráció a <literal>Core::Event</literal> csoportba kerüljön.

source: Don't add new direct child nodes within <literal>Frontend</literal>. Global front end settings go to <literal>Frontend::Base</literal>, settings only affecting a part of the system go to the respective <literal>Admin, Agent, Customer</literal> or <literal>Public</literal> sub nodes.
hu: Ne adjon hozzá új közvetlen gyermekcsomópontokat a <literal>Frontend</literal> csomóponton belül. A globális előtétprogram beállítások a <literal>Frontend::Base</literal> csoportba kerüljenek, a csak a rendszer egy részét érintő beállítások a megfelelő <literal>Admin, Agent, Customer</literal> vagy <literal>Public</literal> alcsoportokba kerüljenek.

source: Front end settings that only affect one screen should go to the relevant screen (<literal>View</literal>) node (create one if needed), for example <literal>AgentTicketZoom</literal> related settings go to <literal>Frontend::Agent::View::TicketZoom</literal>. If there are module layers within one screen with groups of related settings, they would also go to a sub group here (e. g. <literal>Frontend::Agent::View::TicketZoom::MenuModule</literal> for all ticket zoom menu module registrations).
hu: Azok az előtétprogram beállítások, amelyek csak egy képernyőt érintenek, a kapcsolódó képernyő (<literal>View</literal>) csomópontjába (hozzon létre egyet, ha szükséges) kerüljenek. Például az <literal>AgentTicketZoom</literal> képernyőhöz kapcsolódó beállítások a <literal>Frontend::Agent::View::TicketZoom</literal> csoportba kerüljenek. Ha kapcsolódó beállítások csoportjaival rendelkező modulrétegek vannak egy képernyőn belül, akkor azok is kerülhetnek ide egy alcsoportba (például <literal>Frontend::Agent::View::TicketZoom::MenuModule</literal> az összes jegynagyítás menü modulregisztrációjához).

source: All global Loader settings go to <literal>Frontend::Base::Loader</literal>, screen specific Loader settings to <literal>Frontend::*::ModuleRegistration::Loader</literal>.
hu: Az összes globális betöltő beállítások a <literal>Frontend::Base::Loader</literal> csoportba, a képernyőre jellemző betöltő beállítások a <literal>Frontend::*::ModuleRegistration::Loader</literal> csoportba kerüljenek.

source: Structure of <literal>Value</literal> elements
hu: A <literal>Value</literal> elemek szerkezete

source: <literal>Value</literal> elements hold the actual configuration data payload. They can contain single values, hashes or arrays.
hu: A <literal>Value</literal> elemek tartalmazzák a tényleges beállítási adatok hasznos terhét. Tartalmazhatnak önálló értékeket, kivonatokat vagy tömböket.

source: An <literal>Item</literal> element holds one piece of data. The optional <literal>ValueType</literal> attribute determines which kind of data and how it needs to be presented to the user in the GUI. If no <literal>ValueType</literal> is specified, it defaults to <literal>String</literal>.
hu: Egy <literal>Item</literal> elem egyetlen adatot tartalmaz. Az elhagyható <literal>ValueType</literal> attribútum határozza meg, hogy milyen típusú adat, és hogyan kell megjeleníteni a felhasználónak a grafikus felületen. Ha nincs <literal>ValueType</literal> megadva, akkor alapértelmezetten <literal>String</literal> lesz.

source: Please <link linkend="xml-config-value-types">see below</link> for a definition of the different value types.
hu: <link linkend="xml-config-value-types">Nézze meg a lent</link> a különböző értéktípusok meghatározását.

source: With this config element arrays can be displayed.
hu: Ezzel a beállítási elemmel tömbök jeleníthetők meg.

source: <Setting Name="SettingName"> ... <Value> <Array> <Item Translatable="1">Value 1</Item> <Item Translatable="1">Value 2</Item> ... </Array> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Array> <Item Translatable="1">1. érték</Item> <Item Translatable="1">2. érték</Item> ... </Array> </Value> </Setting>

source: With this config element hashes can be displayed.
hu: Ezzel a beállítási elemmel kivonatok jeleníthetők meg.

source: <Setting Name="SettingName"> ... <Value> <Hash> <Item Key="One" Translatable="1">First</Item> <Item Key="Two" Translatable="1">Second</Item> ... </Hash> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Hash> <Item Key="Egy" Translatable="1">Első</Item> <Item Key="Ketto" Translatable="1">Második</Item> ... </Hash> </Value> </Setting>

source: It's possible to have nested array/hash elements (like hash of arrays, array of hashes, array of hashes of arrays, ...). Below is an example array of hashes.
hu: Lehetőség van egymásba ágyazott tömb vagy kivonat elemek meglétére is (mint például tömbök kivonata, kivonatok tömbje, tömbök kivonatainak tömbje, stb.). Lent van egy példa a kivonatok tömbjére.

source: <Setting Name="ExampleAoH"> ... <Value> <Array> <DefaultItem> <Hash> <Item></Item> </Hash> </DefaultItem> <Item> <Hash> <Item Key="One">1</Item> <Item Key="Two">2</Item> </Hash> </Item> <Item> <Hash> <Item Key="Three">3</Item> <Item Key="Four">4</Item> </Hash> </Item> </Array> </Value> </Setting>
hu: <Setting Name="ExampleAoH"> ... <Value> <Array> <DefaultItem> <Hash> <Item></Item> </Hash> </DefaultItem> <Item> <Hash> <Item Key="Egy">1</Item> <Item Key="Ketto">2</Item> </Hash> </Item> <Item> <Hash> <Item Key="Harom">3</Item> <Item Key="Negy">4</Item> </Hash> </Item> </Array> </Value> </Setting>

source: Value Types
hu: Értéktípusok

source: The XML config settings support various types of configuration variables.
hu: Az XML konfigurációs beállítások különféle típusú beállítási változókat támogatnak.

source: String
hu: <literal>String</literal>

source: A config element for numbers and single-line strings. Checking the validity with a regular expression is possible (optional). This is the default <literal>ValueType</literal>.
hu: Egy beállítási elem számokhoz és egysoros karakterláncokhoz. Ellenőrizhető az érvényesség egy reguláris kifejezéssel, ha lehetséges (elhagyható). Ez az alapértelmezett <literal>ValueType</literal>.

source: <Setting Name="SettingName"> ... <Value> <Item ValueType="String" ValueRegex="" Translatable="1">Value</Item> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Item ValueType="String" ValueRegex="" Translatable="1">Érték</Item> </Value> </Setting>

source: The optional <literal>Translatable</literal> attribute marks this setting as translatable, which will cause it to be included in the OTRS translation files. This attribute can be placed on any tag (see also below).
hu: Az opcionális <literal>Translatable</literal> attribútum jelöli meg ezt a beállítást fordíthatóként, amely azt fogja eredményezni, hogy fel lesz véve az OTRS fordítási fájljaiba. Ezt az attribútumot bármely címkére el lehet helyezni (lásd lent is).

source: Password
hu: <literal>Password</literal>

source: A config element for passwords. It's still stored as plain text in the XML, but it's masked in the GUI.
hu: Egy beállítási elem jelszavakhoz. Továbbra is egyszerű szövegként van tárolva az XML-ben, de el van fedve a grafikus felhasználói felületen.

source: <Setting Name="SettingName"> ... <Value> <Item ValueType="Password">Secret</Item> </Value> </Setting>
hu: <Setting Name="SettingName"> ... <Value> <Item ValueType="Password">Titok</Item> </Value> </Setting>

source: PerlModule
hu: <literal>PerlModule</literal>
