Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # -- # Kernel/System/CustomerAuth/CustomAuth.pm - provides the custom Authentication # based on Martin Edenhofer's Kernel::System::Auth::DB # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: CustomAuth.pm,v 1.11 2009/09/22 15:16:05 mb Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::CustomerAuth::CustomAuth; use strict; use warnings; use Authen::CustomAuth; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for (qw(LogObject ConfigObject DBObject)) { $Self->{$_} = $Param{$_} || die "No $_!"; } # Debug 0=off 1=on $Self->{Debug} = 0; # get config $Self->{Die} = $Self->{ConfigObject}->Get( 'Customer::AuthModule::CustomAuth::Die' . $Param{Count} ); # get user table $Self->{CustomAuthHost} = $Self->{ConfigObject}->Get( 'Customer::AuthModule::CustomAuth::Host' . $Param{Count} ) || die "Need Customer::AuthModule::CustomAuth::Host$Param{Count} in Kernel/Config.pm"; $Self->{CustomAuthSecret} = $Self->{ConfigObject}->Get( 'Customer::AuthModule::CustomAuth::Password' . $Param{Count} ) || die "Need Customer::AuthModule::CustomAuth::Password$Param{Count} in Kernel/Config.pm"; return $Self; } sub GetOption { my ( $Self, %Param ) = @_; # check needed stuff if ( !$Param{What} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need What!" ); return; } # module options my %Option = ( PreAuth => 0, ); # return option return $Option{ $Param{What} }; } sub Auth { my ( $Self, %Param ) = @_; # check needed stuff if ( !$Param{User} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need User!" ); return; } # get params my $User = $Param{User} || ''; my $Pw = $Param{Pw} || ''; my $RemoteAddr = $ENV{REMOTE_ADDR} || 'Got no REMOTE_ADDR env!'; my $UserID = ''; my $GetPw = ''; # just in case for debug! if ( $Self->{Debug} > 0 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: '$User' tried to authentificate with Pw: '$Pw' ($RemoteAddr)", ); } # just a note if ( !$User ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "No User given!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # just a note if ( !$Pw ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: $User Authentication without Pw!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # Create a custom object my $CustomAuth = Authen::CustomAuth->new( Host => $Self->{CustomAuthHost}, Secret => $Self->{CustomAuthSecret}, ); if ( !$CustomAuth ) { if ( $Self->{Die} ) { die "Can't connect to $Self->{CustomAuthHost}: $@"; } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Can't connect to $Self->{CustomAuthHost}: $@", ); return; } } my $AuthResult = $CustomAuth->check_pwd( $User, $Pw ); # login note if ( defined($AuthResult) && $AuthResult == 1 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: $User Authentication ok (REMOTE_ADDR: $RemoteAddr).", ); return $User; } # just a note else { $Self->{LogObject}->Log( Priority => 'notice', Message => "User: $User Authentication with wrong Pw!!! (REMOTE_ADDR: $RemoteAddr)" ); return; } } 1;
hu: # -- # Kernel/System/CustomerAuth/CustomAuth.pm - az egyéni hitelesítést biztosítja # Martin Edenhofer Kernel::System::Auth::DB osztálya alapján # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: CustomAuth.pm,v 1.11 2009/09/22 15:16:05 mb Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::CustomerAuth::CustomAuth; use strict; use warnings; use Authen::CustomAuth; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok ellenőrzése for (qw(LogObject ConfigObject DBObject)) { $Self->{$_} = $Param{$_} || die "Nincs $_!"; } # Hibakeresés: 0 = ki, 1 = be $Self->{Debug} = 0; # beállítás lekérése $Self->{Die} = $Self->{ConfigObject}->Get( 'Customer::AuthModule::CustomAuth::Die' . $Param{Count} ); # felhasználótábla lekérése $Self->{CustomAuthHost} = $Self->{ConfigObject}->Get( 'Customer::AuthModule::CustomAuth::Host' . $Param{Count} ) || die "Customer::AuthModule::CustomAuth::Host$Param{Count} szükséges ebben: Kernel/Config.pm"; $Self->{CustomAuthSecret} = $Self->{ConfigObject}->Get( 'Customer::AuthModule::CustomAuth::Password' . $Param{Count} ) || die "Customer::AuthModule::CustomAuth::Password$Param{Count} szükséges ebben: Kernel/Config.pm"; return $Self; } sub GetOption { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése if ( !$Param{What} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Mi szükséges!" ); return; } # modul beállítások my %Option = ( PreAuth => 0, ); # beállítás visszaadása return $Option{ $Param{What} }; } sub Auth { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése if ( !$Param{User} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Felhasználó szükséges!" ); return; } # paraméterek lekérése my $User = $Param{User} || ''; my $Pw = $Param{Pw} || ''; my $RemoteAddr = $ENV{REMOTE_ADDR} || 'A REMOTE_ADDR környezetet nem sikerült lekérni!'; my $UserID = ''; my $GetPw = ''; # csak hibakeresés esetén! if ( $Self->{Debug} > 0 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: „$User” megpróbált a következő jelszóval hitelesíteni: „$Pw” ($RemoteAddr)", ); } # csak egy megjegyzés if ( !$User ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Nincs felhasználó megadva!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # csak egy megjegyzés if ( !$Pw ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: $User hitelesítés jelszó nélkül!!! (REMOTE_ADDR: $RemoteAddr)", ); return; } # Egyéni objektum létrehozása my $CustomAuth = Authen::CustomAuth->new( Host => $Self->{CustomAuthHost}, Secret => $Self->{CustomAuthSecret}, ); if ( !$CustomAuth ) { if ( $Self->{Die} ) { die "Nem lehet kapcsolódni ehhez: $Self->{CustomAuthHost}: $@"; } else { $Self->{LogObject}->Log( Priority => 'error', Message => "Nem lehet kapcsolódni ehhez: $Self->{CustomAuthHost}: $@", ); return; } } my $AuthResult = $CustomAuth->check_pwd( $User, $Pw ); # bejelentkezési jegyzet if ( defined($AuthResult) && $AuthResult == 1 ) { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: $User hitelesítése OK (REMOTE_ADDR: $RemoteAddr).", ); return $User; } # csak egy jegyzet else { $Self->{LogObject}->Log( Priority => 'notice', Message => "Felhasználó: $User hitelesítése rossz jelszóval!!! (REMOTE_ADDR: $RemoteAddr)" ); return; } } 1;

source: There is the need to activate your custom customer authenticate module. This can be done using the XML configuration below.
hu: Szükség van az egyéni ügyfél hitelesítő modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.

source: <ConfigItem Name="AuthModule" Required="1" Valid="1"> <Description Lang="en">Module to authenticate customers.</Description> <Description Lang="de">Modul zum Authentifizieren der Customer.</Description> <Group>Framework</Group> <SubGroup>Frontend::CustomerAuthAuth</SubGroup> <Setting> <Option Location="Kernel/System/CustomerAuth/*.pm" SelectedID="Kernel::System::CustomerAuth::CustomAuth"></Option> </Setting> </ConfigItem>
hu: <ConfigItem Name="AuthModule" Required="1" Valid="1"> <Description Lang="en">Module to authenticate customers.</Description> <Description Lang="hu">Egy modul az ügyfelek hitelesítéséhez.</Description> <Group>Framework</Group> <SubGroup>Frontend::CustomerAuthAuth</SubGroup> <Setting> <Option Location="Kernel/System/CustomerAuth/*.pm" SelectedID="Kernel::System::CustomerAuth::CustomAuth"></Option> </Setting> </ConfigItem>

source: Useful authentication implementation could be a SOAP backend.
hu: Hasznos hitelesítés megvalósítás lehet egy SOAP háttérprogram.

source: Customer User Preferences Module
hu: Ügyfél-felhasználó beállítások modul

source: There is a DB customer-user preferences module which come with the OTRS framework. It is also possible to develop your own customer-user preferences modules. The customer-user preferences modules are located under <filename>Kernel/System/CustomerUser/Preferences/*.pm</filename>. For more information about their configuration see the admin manual. Following, there is an example of a customer-user preferences module. Save it under <filename>Kernel/System/CustomerUser/Preferences/Custom.pm</filename>. You just need 4 functions: <code>new()</code>, <code>SearchPreferences()</code>, <code>SetPreferences()</code> and <code>GetPreferences()</code>.
hu: Létezik egy DB ügyfél-felhasználó beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját ügyfél-felhasználó beállítási modulok fejlesztésére is. Az ügyfél-felhasználó beállítási modulok a <filename>Kernel/System/CustomerUser/Preferences/*.pm</filename> alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy ügyfél-felhasználó beállítások modul példája található. Mentse el a <filename>Kernel/System/CustomerUser/Preferences/Custom.pm</filename> helyre. Mindössze négy függvényre van szüksége: <code>new()</code>, <code>SearchPreferences()</code>, <code>SetPreferences()</code> és <code>GetPreferences()</code>.

source: The interface class is called <literal>Kernel::System::CustomerUser</literal>. The example customer-user preferences may be called <literal>Kernel::System::CustomerUser::Preferences::Custom</literal>. You can find an example below.
hu: A felületosztály neve <literal>Kernel::System::CustomerUser</literal>. A példa ügyfél-felhasználó beállítások hívhatók <literal>Kernel::System::CustomerUser::Preferences::Custom</literal> néven. Lent találhat egy példát.

source: # -- # Kernel/System/CustomerUser/Preferences/Custom.pm - some customer user functions # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: Custom.pm,v 1.20 2009/10/07 20:41:50 martin Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::CustomerUser::Preferences::Custom; use strict; use warnings; use vars qw(@ISA $VERSION); sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # check needed objects for my $Object (qw(DBObject ConfigObject LogObject)) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } # preferences table data $Self->{PreferencesTable} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{Table} || 'customer_preferences'; $Self->{PreferencesTableKey} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{TableKey} || 'preferences_key'; $Self->{PreferencesTableValue} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{TableValue} || 'preferences_value'; $Self->{PreferencesTableUserID} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{TableUserID} || 'user_id'; return $Self; } sub SetPreferences { my ( $Self, %Param ) = @_; my $UserID = $Param{UserID} || return; my $Key = $Param{Key} || return; my $Value = defined( $Param{Value} ) ? $Param{Value} : ''; # delete old data return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . " $Self->{PreferencesTableUserID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$UserID, \$Key ], ); $Value .= 'Custom'; # insert new data return if !$Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableUserID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$UserID, \$Key, \$Value ], ); return 1; } sub GetPreferences { my ( $Self, %Param ) = @_; my $UserID = $Param{UserID} || return; my %Data; # get preferences return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableUserID} = ?", Bind => [ \$UserID ], ); while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # return data return %Data; } sub SearchPreferences { my ( $Self, %Param ) = @_; my %UserID; my $Key = $Param{Key} || ''; my $Value = $Param{Value} || ''; # get preferences my $SQL = "SELECT $Self->{PreferencesTableUserID}, $Self->{PreferencesTableValue} " . " FROM " . " $Self->{PreferencesTable} " . " WHERE " . " $Self->{PreferencesTableKey} = '" . $Self->{DBObject}->Quote($Key) . "'" . " AND " . " LOWER($Self->{PreferencesTableValue}) LIKE LOWER('" . $Self->{DBObject}->Quote( $Value, 'Like' ) . "')"; return if !$Self->{DBObject}->Prepare( SQL => $SQL ); while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $UserID{ $Row[0] } = $Row[1]; } # return data return %UserID; } 1;
hu: # -- # Kernel/System/CustomerUser/Preferences/Custom.pm - néhány ügyfél-felhasználó függvény # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: Custom.pm,v 1.20 2009/10/07 20:41:50 martin Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::CustomerUser::Preferences::Custom; use strict; use warnings; use vars qw(@ISA $VERSION); sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # szükséges objektumok ellenőrzése for my $Object (qw(DBObject ConfigObject LogObject)) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } # beállítások tábla adatai $Self->{PreferencesTable} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{Table} || 'customer_preferences'; $Self->{PreferencesTableKey} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{TableKey} || 'preferences_key'; $Self->{PreferencesTableValue} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{TableValue} || 'preferences_value'; $Self->{PreferencesTableUserID} = $Self->{ConfigObject}->Get('CustomerPreferences')->{Params}->{TableUserID} || 'user_id'; return $Self; } sub SetPreferences { my ( $Self, %Param ) = @_; my $UserID = $Param{UserID} || return; my $Key = $Param{Key} || return; my $Value = defined( $Param{Value} ) ? $Param{Value} : ''; # régi adatok törlése return if !$Self->{DBObject}->Do( SQL => "DELETE FROM $Self->{PreferencesTable} WHERE " . " $Self->{PreferencesTableUserID} = ? AND $Self->{PreferencesTableKey} = ?", Bind => [ \$UserID, \$Key ], ); $Value .= 'Custom'; # új adatok beszúrása return if !$Self->{DBObject}->Do( SQL => "INSERT INTO $Self->{PreferencesTable} ($Self->{PreferencesTableUserID}, " . " $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue}) " . " VALUES (?, ?, ?)", Bind => [ \$UserID, \$Key, \$Value ], ); return 1; } sub GetPreferences { my ( $Self, %Param ) = @_; my $UserID = $Param{UserID} || return; my %Data; # beállítások lekérése return if !$Self->{DBObject}->Prepare( SQL => "SELECT $Self->{PreferencesTableKey}, $Self->{PreferencesTableValue} " . " FROM $Self->{PreferencesTable} WHERE $Self->{PreferencesTableUserID} = ?", Bind => [ \$UserID ], ); while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $Data{ $Row[0] } = $Row[1]; } # adatok visszaadása return %Data; } sub SearchPreferences { my ( $Self, %Param ) = @_; my %UserID; my $Key = $Param{Key} || ''; my $Value = $Param{Value} || ''; # beállítások lekérése my $SQL = "SELECT $Self->{PreferencesTableUserID}, $Self->{PreferencesTableValue} " . " FROM " . " $Self->{PreferencesTable} " . " WHERE " . " $Self->{PreferencesTableKey} = '" . $Self->{DBObject}->Quote($Key) . "'" . " AND " . " LOWER($Self->{PreferencesTableValue}) LIKE LOWER('" . $Self->{DBObject}->Quote( $Value, 'Like' ) . "')"; return if !$Self->{DBObject}->Prepare( SQL => $SQL ); while ( my @Row = $Self->{DBObject}->FetchrowArray() ) { $UserID{ $Row[0] } = $Row[1]; } # adatok visszaadása return %UserID; } 1;

source: There is the need to activate your custom customer-user preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni ügyfél-felhasználó beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.

source: <ConfigItem Name="CustomerPreferences" Required="1" Valid="1"> <Description Lang="en">Parameters for the customer preference table.</Description> <Description Lang="de">Parameter für die Tabelle mit den Einstellungen für die Customer.</Description> <Group>Framework</Group> <SubGroup>Frontend::Customer::Preferences</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::System::CustomerUser::Preferences::Custom</Item> <Item Key="Params"> <Hash> <Item Key="Table">customer_preferences</Item> <Item Key="TableKey">preferences_key</Item> <Item Key="TableValue">preferences_value</Item> <Item Key="TableUserID">user_id</Item> </Hash> </Item> </Hash> </Setting> </ConfigItem>
hu: <ConfigItem Name="CustomerPreferences" Required="1" Valid="1"> <Description Lang="en">Parameters for the customer preference table.</Description> <Description Lang="hu">Paraméterek az ügyfél beállításainak táblájához.</Description> <Group>Framework</Group> <SubGroup>Frontend::Customer::Preferences</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::System::CustomerUser::Preferences::Custom</Item> <Item Key="Params"> <Hash> <Item Key="Table">customer_preferences</Item> <Item Key="TableKey">preferences_key</Item> <Item Key="TableValue">preferences_value</Item> <Item Key="TableUserID">user_id</Item> </Hash> </Item> </Hash> </Setting> </ConfigItem>

source: Useful preferences implementation could be a SOAP or LDAP backend.
hu: Hasznos beállítások megvalósítás lehet egy SOAP vagy egy LDAP háttérprogram.

source: Dashboard Module
hu: Vezérlőpult modul

source: Dashboard module to display statistics in the form of a line graph.
hu: Vezérlőpult modul statisztikák megjelenítéséhez vonaldiagram formájában.

source: Dashboard Widget
hu: Vezérlőpult felületi elem
