Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: See <filename>Kernel/Config/Files/TicketNumberGenerator.xml</filename> in the package <literal>TemplateModule</literal>.
hu: Nézze meg a <filename>Kernel/Config/Files/TicketNumberGenerator.xml</filename> fájlt a <literal>TemplateModule</literal> csomagban.

source: Ticket numbers should follow a specific scheme.
hu: A jegyszámoknak egy bizonyos sémát kell követniük.

source: You will need to create a new ticket number generator if the default modules don't provide the ticket number scheme you'd like to use.
hu: Akkor kell majd egy új jegyszám előállítót létrehoznia, ha az alapértelmezett modulok nem biztosítják azt a jegyszám sémát, amelyet használni szeretne.

source: You should stick to the code of <code>GetTNByString()</code> as used in existing ticket number generators to prevent problems with ticket number parsing. Also the routine to detect a loop in <code>TicketCreateNumber()</code> should be kept intact to prevent duplicate ticket numbers.
hu: Ragaszkodnia kell a meglévő jegyszám előállítókban használt <code>GetTNByString()</code> kódjához, hogy megelőzze a jegyszám feldolgozással kapcsolatos problémákat. A <code>TicketCreateNumber()</code> metódusban lévő hurok felismeréséhez használt rutint is érintetlenül kell hagynia a kettőzött jegyszámok megelőzéséhez.

source: Ticket number generators have been available in OTRS since OTRS 1.1.
hu: A jegyszám előállítók az OTRS 1.1 óta lettek elérhetők az OTRS-ben.

source: OTRS Daemon
hu: OTRS démon

source: The OTRS Daemon is a separated process that helps OTRS to execute certain actions asynchronously and detached of the web server process, but sharing the same database.
hu: Az OTRS démon egy elkülönített folyamat, amely segít az OTRS-nek bizonyos műveleteket aszinkron módon és a webszolgáltatás folyamattól leválasztva végrehajtani, de ugyanazt az adatbázist megosztva.

source: OTRS Daemon Modules
hu: OTRS démonmodulok

source: The OTRS Daemon <filename>bin/otrs.Daemon.pl</filename> main purpose is to call (Daemonize) all the registered daemon modules in the System Configuration.
hu: A <filename>bin/otrs.Daemon.pl</filename> OTRS démon fő célja, hogy meghívja (démonizálja) a rendszerbeállításokban lévő összes regisztrált démonmodult.

source: Each daemon module must implement a common API in order to be correctly called by the OTRS Daemon and be a semi persistent process in the system. Persistent process could grow in size and memory usage over the time and normally they do not respond to changes in the configuration. That is why the daemon modules should implement a discard mechanism to be stopped and re-spawned again from time to time, freeing system resources and re-reading the configuration.
hu: Minden egyes démonmodulnak meg kell valósítania egy közös API-t annak érdekében, hogy az OTRS démon helyesen tudja meghívni, és félig állandó folyamat legyen a rendszeren. Az állandó folyamat megnövelheti a méretét és memóriahasználatát az idő múlásával, és normális esetben nem válaszolnak a beállításokban lévő változásokra. Ezért kell a démonmoduloknak megvalósítaniuk egy eldobási mechanizmust, hogy leállíthatók és újra meghívhatók legyenek időről időre, felszabadítva a rendszer erőforrásait és újraolvasva a beállításokat.

source: A daemon module could be an all-in-one solution to perform a certain job, but there could be the case that a solution requires different daemon modules due to its complexity. That is exactly the case of the OTRS Scheduler Daemon that is split into several daemon modules including some daemon modules for task management and task execution.
hu: Egy démonmodul lehet mindenre jó megoldás bizonyos feladat végrehajtásánál, de lehet olyan eset is, amikor egy megoldás különböző démonmodulokat igényel az összetettsége miatt. Pontosan ez az eset az OTRS ütemező démonjával, amely fel van osztva számos démonmodulra, beleértve a feladatkezeléshez és a feladatvégrehajtáshoz szükséges néhány démonmodult.

source: It is not always necessary to create a new daemon module to perform certain task, usually the OTRS Scheduler Daemon can deal with the majority of them, either if it is an OTRS function that needs to be executed on a regular basis (CRON like) or if it's triggered by an OTRS event, the OTRS Scheduler should be capable to deal with it out of the box or by adding a new scheduler task worker module.
hu: Nem szükséges mindig új démonmodult létrehozni bizonyos feladatok végrehajtásához. Általában az OTRS ütemező démon elboldogul ezek jelentős részével – akár ha egy olyan OTRS függvényről van szó, amelyet rendszeresen végre kell hajtani (CRON-szerűen), vagy ha egy OTRS esemény aktiválta azt – az OTRS ütemezőnek képesnek kell lenni kezelnie mindenféle beállítás nélkül, vagy egy új ütemező feladatelvégző modul hozzáadásával.

source: Creating A New Daemon Module
hu: Új démonmodul létrehozása

source: All daemon modules requires to be registered in the System Configuration in order to be called by the main OTRS Daemon.
hu: Az összes démonmodulnak regisztrálva kell lennie a rendszerbeállításokban azért, hogy a fő OTRS démon meg tudja hívni azokat.

source: Daemon Module Registration Code Example
hu: Démonmodul regisztrációs kódpélda

source: Daemon Module Code Example
hu: Démonmodul kódpélda

source: The following code implements a daemon module that displays the system time every 2 seconds.
hu: A következő kód egy olyan démonmodult valósít meg, amely megjeleníti a rendszeridőt 2 másodpercenként.

source: This is common header that can be found in most OTRS modules. The class/package name is declared via the package keyword.
hu: Ez egy gyakori fejléc, amely megtalálható a legtöbb OTRS modulban. Az osztály/csomag neve a <literal>package</literal> kulcsszón keresztül van deklarálva.

source: In this case we are inheriting from <literal>BaseDaemon</literal> class, and the object manager dependencies are set.
hu: Ebben az esetben a <literal>BaseDaemon</literal> osztályból származtatunk le, és az objektumkezelő függőségei be vannak állítva.

source: sub new { my ( $Type, %Param ) = @_; # Allocate new hash for object. my $Self = {}; bless $Self, $Type; # Get objects in constructor to save performance. $Self->{ConfigObject} = $Kernel::OM->Get('Kernel::Config'); $Self->{CacheObject} = $Kernel::OM->Get('Kernel::System::Cache'); $Self->{DBObject} = $Kernel::OM->Get('Kernel::System::DB'); # Disable in memory cache to be clusterable. $Self->{CacheObject}->Configure( CacheInMemory => 0, CacheInBackend => 1, ); $Self->{SleepPost} = 2; # sleep 2 seconds after each loop $Self->{Discard} = 60 * 60; # discard every hour $Self->{DiscardCount} = $Self->{Discard} / $Self->{SleepPost}; $Self->{Debug} = $Param{Debug}; $Self->{DaemonName} = 'Daemon: TestDaemon'; return $Self; }
hu: sub new { my ( $Type, %Param ) = @_; # Új kivonat lefoglalása az objektumhoz. my $Self = {}; bless $Self, $Type; # Objektumok lekérése a konstruktorban a teljesítmény megtartásáért. $Self->{ConfigObject} = $Kernel::OM->Get('Kernel::Config'); $Self->{CacheObject} = $Kernel::OM->Get('Kernel::System::Cache'); $Self->{DBObject} = $Kernel::OM->Get('Kernel::System::DB'); # Letiltás a memóriagyorsítótárban, hogy fürtözhető legyen. $Self->{CacheObject}->Configure( CacheInMemory => 0, CacheInBackend => 1, ); $Self->{SleepPost} = 2; # 2 másodperc alvás minden hurok után $Self->{Discard} = 60 * 60; # eldobás minden órában $Self->{DiscardCount} = $Self->{Discard} / $Self->{SleepPost}; $Self->{Debug} = $Param{Debug}; $Self->{DaemonName} = 'Daemon: TestDaemon'; return $Self; }

source: The constructor <literal>new</literal> creates a new instance of the class. Some used objects are also created here. It is highly recommended to disable in-memory cache in daemon modules especially if OTRS runs in a cluster environment.
hu: A <literal>new</literal> konstruktor hozza létre az osztály új példányát. Néhány felhasznált objektum is itt lesz létrehozva. Erősen ajánlott a memóriába történő gyorsítótárazás letiltása a démonmodulokban, különösen akkor, ha az OTRS fürtözött környezetben fut.

source: In order to make this daemon module to be executed every two seconds it is necessary to define a sleep time accordingly, otherwise it will be executed as soon as possible.
hu: Azért, hogy ez a démonmodul minden második másodpercben végrehajtható legyen, egy alvási idő meghatározása szükséges annak megfelelően, egyébként azonnal végrehajtásra kerül, amint lehetséges.

source: Refreshing the daemon module from time to time is necessary in order to define when it should be discarded.
hu: A démonmodul frissítése időről időre azért szükséges, hogy meghatározható legyen, mikor kell eldobni.

source: For the following functions (<literal>PreRun</literal>, <literal>Run</literal> and <literal>PostRun</literal>) if they return false, the main OTRS Daemon will discard the object and create a new one as soon as possible.
hu: A következő függvényeknél (<literal>PreRun</literal>, <literal>Run</literal> és <literal>PostRun</literal>) ha azok hamis értékkel térnek vissza, akkor a fő OTRS démon el fogja dobni az objektumot, és egy újat hoz létre, amint lehetséges.

source: sub PreRun { my ( $Self, %Param ) = @_; # Check if database is on-line. return 1 if $Self->{DBObject}->Ping(); sleep 10; return; }
hu: sub PreRun { my ( $Self, %Param ) = @_; # Annak ellenőrzése, hogy az adatbázis elérhető-e. return 1 if $Self->{DBObject}->Ping(); sleep 10; return; }

source: The <literal>PreRun</literal> method is executed before the main daemon module method, and the its purpose is to perform some test before the real operation. In this case a check to the database is done (always recommended), otherwise it sleeps for 10 seconds. This is needed in order to wait for DB connection to be reestablished.
hu: A <literal>PreRun</literal> metódus a fő démonmodul metódusa előtt kerül végrehajtásra, és a célja néhány teszt elvégzése a valódi műfelet előtt. Ebben az esetben az adatbázis ellenőrzése készen van (mindig javasolt), egyébként 10 másodpercet alszik. Ez azért szükséges, hogy megvárja az adatbázis-kapcsolat ismételt felépítését.

source: sub Run { my ( $Self, %Param ) = @_; print "Current time " . localtime . "\n"; return 1; }
hu: sub Run { my ( $Self, %Param ) = @_; print "Jelenlegi idő: " . localtime . "\n"; return 1; }

source: The <literal>Run</literal> method is where the main daemon module code resides, in this case it only prints the current time.
hu: A <literal>Run</literal> metódus az, ahol a fő démonmodul kódja található. Ebben az esetben csak az aktuális időt írja ki.

source: sub PostRun { my ( $Self, %Param ) = @_; sleep $Self->{SleepPost}; $Self->{DiscardCount}--; if ( $Self->{Debug} ) { print " $Self->{DaemonName} Discard Count: $Self->{DiscardCount}\n"; } return if $Self->{DiscardCount} <= 0; return 1; }
hu: sub PostRun { my ( $Self, %Param ) = @_; sleep $Self->{SleepPost}; $Self->{DiscardCount}--; if ( $Self->{Debug} ) { print " $Self->{DaemonName} eldobásainak száma: $Self->{DiscardCount}\n"; } return if $Self->{DiscardCount} <= 0; return 1; }

source: The <literal>PostRun</literal> method is used to perform the sleeps (preventing the daemon module to be executed too often) and also to manage the safe discarding of the object. Other operations like verification or cleanup can be done here.
hu: A <literal>PostRun</literal> metódus használható az alvások végrehajtásához (annak megakadályozásához, hogy a démonmodul túl gyakran legyen végrehajtva), valamint az objektum biztonságos eldobásának kezeléséhez is. Egyéb műveletek is elvégezhetők itt, mint például ellenőrzés vagy tisztítás.

source: sub Summary { my ( $Self, %Param ) = @_; my %Summary = ( Header => 'Test Daemon Summary:', Column => [ { Name => 'SomeColumn', DisplayName => 'Some Column', Size => 15, }, { Name => 'AnotherColumn', DisplayName => 'Another Column', Size => 15, }, # ... ], Data => [ { SomeColumn => 'Some Data 1', AnotherColumn => 'Another Data 1', }, { SomeColumn => 'Some Data 2', AnotherColumn => 'Another Data 2', }, # ... ], NoDataMesssage => '', ); return \%Summary; }
hu: sub Summary { my ( $Self, %Param ) = @_; my %Summary = ( Header => 'Tesztdémon összegzés:', Column => [ { Name => 'SomeColumn', DisplayName => 'Valamilyen oszlop', Size => 15, }, { Name => 'AnotherColumn', DisplayName => 'Egy másik oszlop', Size => 15, }, # ... ], Data => [ { SomeColumn => '1. valamilyen adat', AnotherColumn => '1. másik adat', }, { SomeColumn => '2. valamilyen adat', AnotherColumn => '2. másik adat', }, # ... ], NoDataMesssage => '', ); return \%Summary; }

source: The <literal>Summary</literal> method is called by the console command <literal>Maint::Daemon::Summary</literal> and it's required to return <literal>Header</literal>, <literal>Column</literal>, <literal>Data</literal> and <literal>NoDataMessages</literal> keys. <literal>Column</literal> and <literal>Data</literal> needs to be an array of hashes. It is used to display useful information of what the daemon module is currently doing, or what has been done so far. This method is optional.
hu: A <literal>Summary</literal> metódust a <literal>Maint::Daemon::Summary</literal> konzolparancs hívja meg, és <literal>Header</literal>, <literal>Column</literal>, <literal>Data</literal> és <literal>NoDataMessages</literal> kulcsokat kell visszaadnia. A <literal>Column</literal> és a <literal>Data</literal> kulcsoknak tömböknek vagy kivonatoknak kell lenniük. Arra használható, hogy hasznos információkat jelenítsen meg arról, amit a démonmodul éppen csinál, vagy ami eddig történt. Ez a metódus elhagyható.

source: End of file.
hu: Fájl vége.

source: OTRS Scheduler
hu: OTRS ütemező

source: The OTRS Scheduler is a conjunction of daemon modules and task workers that runs together in order to perform all needed OTRS tasks asynchronously from the web server process.
hu: Az OTRS ütemező a démonmodulok és a feladatelvégzők együttese, amelyek együtt futnak azért, hogy az összes szükséges OTRS feladatot aszinkron módon végrehajtsák a webkiszolgáló folyamatából.

source: OTRS Scheduler Task Managers
hu: OTRS ütemező feladatkezelők

source: <literal>SchedulerCronTaskManager</literal> reads registered cron tasks from the OTRS SysConfig and determines the correct time to create a task to be executed.
hu: A <literal>SchedulerCronTaskManager</literal> kiolvassa a regisztrált cron-feladatokat az OTRS rendszerbeállításaiból, és meghatározza a helyes időt a végrehajtandó feladat létrehozásához.

source: <literal>SchedulerFutureTaskManager</literal> checks the tasks that are set to be executed just one time in the future and sets this task to be executed in time. For example, when a Generic Interface Invoker can not reach the remote server, it can self schedule to be run again 5 minutes later.
hu: A <literal>SchedulerFutureTaskManager</literal> ellenőrzi azokat a feladatokat, amelyek úgy vannak beállítva, hogy csak egy alkalommal fussanak a jövőben, és beállítja, hogy a feladat időben kerüljön végrehajtásra. Például amikor egy általános felület meghívónak nem sikerül elérnie a távoli kiszolgálót, akkor ütemezni tudja magát, hogy 5 perccel később újra fusson.

source: <literal>SchedulerGenericAgentTaskManager</literal> continuously reads the <literal>GenericAgent</literal> tasks that are set to be run on regular time basis and sets their execution accordingly.
hu: A <literal>SchedulerGenericAgentTaskManager</literal> folyamatosan olvassa a <literal>GenericAgent</literal> feladatot, amely rendszeres időközönkénti futáshoz van beállítva, és annak megfelelően állítja be azok végrehajtását.

source: Whenever these tasks managers are not enough, a new daemon module can be created. At a certain point of its <literal>Run()</literal> method it needs to call <literal>TaskAdd()</literal> from the <literal>chedulerDB</literal> object to register a task, and as soon as it is registered, it will be executed in the next free slot by the <literal>SchedulerTaskWorker</literal>.
hu: Amikor ezek a feladatkezelők nem elegendőek, akkor egy új démonmodul hozható létre. Egy feladat regisztrálásához a <literal>Run()</literal> metódusuk egy bizonyos pontján meg kell hívni a <literal>TaskAdd()</literal> függvényt a <literal>chedulerDB</literal> objektumból, és amint regisztrálva lett, akkor a <literal>SchedulerTaskWorker</literal> végrehajtja a következő szabad időszeletben.

source: OTRS Scheduler Task Workers
hu: OTRS ütemező feladatelvégzők

source: <literal>SchedulerTaskWorker</literal> execute all tasks planned by the previous tasks managers plus the ones that come directly from the code by using the Asynchronous Executor.
hu: A <literal>SchedulerTaskWorker</literal> az aszinkron végrehajtó használatával végrehajtja az előző feladatkezelő által tervezett összes feladatot, és még azokat is, amelyek közvetlenül a kódból jönnek.

source: In order to execute each task, the <literal>SchedulerTaskWorker</literal> calls a backend module (Task Worker) to perform the specific task. The worker module is determined by the task type. If a new task type is added, it will require a new task worker.
hu: Annak érdekében, hogy az összes feladatot végrehajtsa, a <literal>SchedulerTaskWorker</literal> meghív egy háttérprogram-modult (feladatelvégzőt) az adott feladat végrehajtásához. Az elvégző modult a feladat típusa határozza meg. Ha új feladattípus kerül hozzáadásra, akkor az új feladatelvégzőt is igényel.

source: Creating A New Scheduler Task Worker
hu: Új ütemező feladatelvégző létrehozása

source: All files placed under <filename>Kernel/System/Daemon/DaemonModules/SchedulerTaskWorker</filename> could potentially be task workers and they do not require any registration in the system configuration.
hu: A <filename>Kernel/System/Daemon/DaemonModules/SchedulerTaskWorker</filename> mappa alatt elhelyezett összes fájl lehet potenciális feladatelvégző, és azok nem igényelnek semmilyen regisztrációt a rendszerbeállításokban.

source: Scheduler Task Worker Code Example
hu: Ütemező feladatelvégző kódpélda

source: In this case we are inheriting from <literal>BaseTaskWorker</literal> class, and the object manager dependencies are set.
hu: Ebben az esetben a <literal>BaseTaskWorker</literal> osztályból származtatunk le, és az objektumkezelő függőségei be vannak állítva.

source: The constructor <literal>new</literal> creates a new instance of the class.
hu: A <literal>new</literal> konstruktor hozza létre az osztály új példányát.

source: sub Run { my ( $Self, %Param ) = @_; # Check task params. my $CheckResult = $Self->_CheckTaskParams( %Param, NeededDataAttributes => [ 'NeededAtrribute1', 'NeededAtrribute2' ], DataParamsRef => 'HASH', # or 'ARRAT' ); # Stop execution if an error in params is detected. return if !$CheckResult; my $Success; my $ErrorMessage; if ( $Self->{Debug} ) { print " $Self->{WorkerName} executes task: $Param{TaskName}\n"; } do { # Localize the standard error. local *STDERR; # Redirect the standard error to a variable. open STDERR, ">>", \$ErrorMessage; $Success = $Kernel::OM->Get('Kernel::System::MyPackage')->Run( Param1 => 'someparam', ); }; if ( !$Success ) { $ErrorMessage ||= "$Param{TaskName} execution failed without an error message!"; $Self->_HandleError( TaskName => $Param{TaskName}, TaskType => 'Test', LogMessage => "There was an error executing $Param{TaskName}: $ErrorMessage", ErrorMessage => "$ErrorMessage", ); } return $Success; }
hu: sub Run { my ( $Self, %Param ) = @_; # Feladatparaméterek ellenőrzése. my $CheckResult = $Self->_CheckTaskParams( %Param, NeededDataAttributes => [ 'NeededAtrribute1', 'NeededAtrribute2' ], DataParamsRef => 'HASH', # vagy 'ARRAT' ); # Végrehajtás leállítása, ha hiba található a paraméterekben. return if !$CheckResult; my $Success; my $ErrorMessage; if ( $Self->{Debug} ) { print " $Self->{WorkerName} végrehajtja a feladatot: $Param{TaskName}\n"; } do { # A szabványos hiba lokalizálása. local *STDERR; # A szabványos hiba átirányítása egy változóba. open STDERR, ">>", \$ErrorMessage; $Success = $Kernel::OM->Get('Kernel::System::MyPackage')->Run( Param1 => 'someparam', ); }; if ( !$Success ) { $ErrorMessage ||= "$Param{TaskName} végrehajtása sikertelen egy hibaüzenettel!"; $Self->_HandleError( TaskName => $Param{TaskName}, TaskType => 'Test', LogMessage => "Hiba történt a(z) $Param{TaskName} végrehajtásakor: $ErrorMessage", ErrorMessage => "$ErrorMessage", ); } return $Success; }

source: The <literal>Run</literal> is the main method. A call to <literal>_CheckTaskParams()</literal> from the base class will save some lines of code. Executing the task while capturing the STDERR is a very good practice, since the OTRS Scheduler runs normally unattended, and saving all errors to a variable will make it available for further processing. <literal>_HandleError()</literal> provides a common interface to send the error messages as email to the recipient specified in the System Configuration.
hu: A <literal>Run</literal> a fő metódus. Egy <literal>_CheckTaskParams()</literal> hívás az alaposztályból megspórol néhány kódsort. A feladat végrehajtása a szabványos hibakimenet megszerzése közben nagyon jó gyakorlat, mivel az OTRS ütemező normális esetben felügyelet nélkül fut, és az összes hiba egy változóba történő mentése lehetővé fogja tenni a későbbi feldolgozást. A <literal>_HandleError()</literal> közös felületet biztosít a hibaüzenetek e-mailben történő küldéséhez a rendszerbeállításokban megadott címzetteknek.

source: Dynamic Field Backend Extension Example
hu: Dinamikus mező háttérprogram kiterjesztés példa

source: Backend extensions will be loaded transparently into the Backend itself as a base class. All defined object and properties from the Backend will be accessible in the extension.
hu: A háttérprogram kiterjesztések átláthatóan lesznek betöltve magába a háttérprogramba egy alaposztályként. A háttérprogramból az összes meghatározott objektum és tulajdonság elérhető lesz a kiterjesztésben.

source: All new functions defined in the Backend extension should be implemented in a Driver extension.
hu: A háttérprogram kiterjesztésben meghatározott összes új függvényt meg kell valósítani egy illesztőprogram kiterjesztésben.

source: Code Example:
hu: Kódpélda:

source: In this section the <literal>Foo</literal> extension for Backend is shown and explained. The extension only defines the function <code>Foo()</code>.
hu: Ebben a szakaszban a háttérprogramhoz készített <literal>Foo</literal> kiterjesztés van megjelenítve és elmagyarázva. A kiterjesztés csak a <code>Foo()</code> függvényt határozza meg.

source: # -- # Kernel/System/DynamicField/FooExtensionBackend.pm - Extension for DynamicField backend # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::DynamicField::FooExtensionBackend; use strict; use warnings; use Kernel::System::VariableCheck qw(:all); =head1 NAME Kernel::System::DynamicField::FooExtensionBackend =head1 SYNOPSIS DynamicFields Extension for Backend =head1 PUBLIC INTERFACE =over 4 =cut
hu: # -- # Kernel/System/DynamicField/FooExtensionBackend.pm - Kiterjesztés a dinamikus mező háttérprogramhoz # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::DynamicField::FooExtensionBackend; use strict; use warnings; use Kernel::System::VariableCheck qw(:all); =head1 NAME Kernel::System::DynamicField::FooExtensionBackend =head1 SYNOPSIS Dinamikus mezők kiterjesztés a háttérprogramhoz =head1 PUBLIC INTERFACE =over 4 =cut
