Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: Why is it necessary to enclose the JavaScript code in <literal>[% WRAPPER JSOnDocumentComplete %]...[% END %]</literal>? Starting with OTRS 3.0, JavaScript loading was moved to the footer part of the page for performance reasons. This means that within the <literal>&lt;body&gt;</literal> of the page, no JavaScript libraries are loaded yet. With <literal>[% WRAPPER JSOnDocumentComplete %]...[% END %]</literal> you can make sure that this JavaScript is moved to a part of the final HTML document, where it will be executed only after the entire external JavaScript and CSS content has been successfully loaded and initialized.
hu: Miért van szükség a JavaScript kód körbezárására a <literal>[% WRAPPER JSOnDocumentComplete %]...[% END %]</literal> blokkban? Az OTRS 3.0-tól kezdve a JavaScript betöltést teljesítmény okok miatt áthelyezték az oldal lábrészébe. Ez azt jelenti, hogy az oldal <literal>&lt;body&gt;</literal> részén belül még nincsenek JavaScript programkönyvtárak betöltve. A <literal>[% WRAPPER JSOnDocumentComplete %]...[% END %]</literal> blokkal lehet biztos abban, hogy ez a JavaScript áthelyezésre kerül a végső HTML dokumentumnak egy olyan részébe, ahol csak akkor kerül végrehajtásra, miután a teljes külső JavaScript és CSS tartalom sikeresen be lett töltve és elő lett készítve.

source: Inside the <literal>[% WRAPPER JSOnDocumentComplete %]...[% END %]</literal> block, you can use <literal>&lt;script&gt;</literal> tags to enclose your JavaScript code, but you do not have to do so. It may be beneficial because it will enable correct syntax highlighting in IDEs which support it.
hu: A <literal>[% WRAPPER JSOnDocumentComplete %]...[% END %]</literal> blokkon belül használhatja a <literal>&lt;script&gt;</literal> címkéket a JavaScript kód körbezárásához, de ezt nem kell megtennie. Előnyös lehet, mert engedélyezni fogja a helyes szintaxis-kiemelést az olyan integrált fejlesztői környezetekben, amelyek támogatják azt.

source: Using a template file
hu: Egy sablonfájl használata

source: Ok, but how to actually process a template file and generate the result? This is really simple:
hu: Rendben, de tulajdonképpen hogyan kell egy sablonfájlt feldolgozni és az eredményt előállítani? Ez igazán egyszerű:

source: In the frontend modules, the <literal>Output()</literal> function of <literal>Kernel::Output::HTML::Layout</literal> is called (after all the needed blocks have been called in this template) to generate the final output. An optional set of data parameters is passed to the template, for all data inserting commands which are not inside of a block.
hu: Az előtétprogram modulokban a <literal>Kernel::Output::HTML::Layout</literal> objektum <literal>Output()</literal> függvénye lesz meghívva (miután az összes szükséges blokk meg lett hívva ebben a sablonban) a végső kimenet előállításához. Adatparaméterek opcionális halmaza is átadásra kerül a sablonnak minden olyan adatbeszúró parancsnál, amelyek nincsenek egy blokk belsejében.

source: Creating Your Own Themes
hu: Saját témák létrehozása

source: You can create your own themes so as to use the layout you like in the OTRS web frontend. To create custom themes, you should customize the output templates to your needs. More information on the syntax and structure of output templates can be found in the <link linkend="TemplatingMechanism">templating section</link>.
hu: Létrehozhatja a saját témáit, így olyan elrendezést használhat az OTRS webes előtétprogramján, amilyet csak szeretne. Egyéni témák létrehozásához személyre kell szabnia a kimeneti sablonokat az igényei szerint. A kimeneti sablonok szerkezetéről és szintaxisáról további információk találhatók a <link linkend="TemplatingMechanism">sablonozás szakaszban</link>.

source: As an example, perform the following steps to create a new theme called "Company":
hu: Példaként hajtsa végre a következő lépéseket egy új „Vállalat” nevű téma létrehozásához:

source: Create a directory called <filename>Kernel/Output/HTML/Templates/Company</filename> and copy all files that you like to change from <filename>Kernel/Output/HTML/Templates/Standard</filename> into the new folder.
hu: Hozzon létre egy <filename>Kernel/Output/HTML/Templates/Company</filename> nevű könyvtárat, és másoljon át a <filename>Kernel/Output/HTML/Templates/Standard</filename> mappából minden olyan fájlt az új mappába, amelyet meg szeretne változtatni.

source: Only copy over the files you're planning to change. OTRS will automatically get the missing files from the Standard theme. This will make upgrading at a later stage much easier.
hu: Csak azokat a fájlokat másolja át, amelyeket meg szeretne változtatni. Az OTRS automatikusan be fogja szerezni a hiányzó fájlokat a szabványos témából. Ez sokkal könnyebbé fogja tenni a későbbiekben a frissítést.

source: Customize the files in the directory <filename>Kernel/Output/HTML/Templates/Company</filename> and change the layout to your needs.
hu: Szabja személyre a <filename>Kernel/Output/HTML/Templates/Company</filename> könyvtárban lévő fájlokat, és változtassa meg az elrendezést az igényei szerint.

source: To activate the new theme, add them in SysConfig under Frontend::Themes.
hu: Az új téma bekapcsolásához adja hozzá azokat a rendszerbeállításokban a <literal>Frontend::Themes</literal> alatt.

source: Now the new theme should be usable. You can select it via your personal preferences.
hu: Most az új témának használhatónak kell lennie. A személyes beállítások oldalán keresztül tudja kiválasztani.

source: Do not change the theme files shipped with OTRS, since these changes will be lost after an update. Create your own themes only by performing the steps described above.
hu: Ne változtassa meg az OTRS-sel szállított témafájlokat, mivel azok a változtatások el fognak veszni egy frissítés után. Csak a fent leírt lépések végrehajtásával hozzon létre saját témákat.

source: Localization / Translation Mechanism
hu: Honosítási és fordítási mechanizmus

source: There are four steps needed to translate / localize software: marking localizable strings in the source files, generating the translation database/file, the translation process itself, and the usage of translated data within the code.
hu: Négy lépés szükséges a szoftver lefordításához és honosításához: a honosítható szövegek megjelölése a forrásfájlokban, a fordítási adatbázis/fájl előállítása, maga a fordítási folyamat, és a lefordított adatok használata a kódon belül.

source: Marking translatable strings in the source files
hu: Lefordítható szövegek megjelölése a forrásfájlokban

source: In Perl code, all literal strings to be translated are automatically marked for translation: <code>$LanguageObject->Translate('My string %s', $Data)</code> will mark 'My string %s' for translation. If you need to mark strings, but NOT translate them in the code yet, you can use the NOOP method <code>Kernel::Langauge::Translatable()</code>.
hu: A Perl-kódban az összes lefordítandó literál szöveg automatikusan meg van jelölve a fordításhoz: a <code>$LanguageObject->Translate('My string %s', $Data)</code> fogja megjelölni a 'My string %s' szöveget a fordításhoz. Ha arra van szüksége, hogy a kódban megjelölje a szövegeket, de még NE fordítsa le azokat, akkor használhatja a <code>Kernel::Langauge::Translatable()</code> NOOP metódust.

source: In Template files, all literal strings enclosed in <link linkend="translate-tag">the <code>Translate()</code>-Tag</link> are automatically marked for extraction: <code>[% Translate('My string %s', Data.Data )%]</code>.
hu: A sablonfájlokban az összes olyan literál szöveg automatikusan meg van jelölve a kigyűjtéshez, amelyek <link linkend="translate-tag">a <code>Translate()</code>-címkével</link> vannak körbezárva: <code>[% Translate('My string %s', Data.Data )%]</code>.

source: In SysConfig and Database XML files you can mark strings for extraction with the <literal>Translatable="1"</literal> attribute.
hu: A rendszerbeállítás és az adatbázis XML-fájlokban a <literal>Translatable="1"</literal> attribútummal jelölheti meg a szövegeket a kigyűjtéshez.

source: # Database XML <Insert Table="groups"> <Data Key="id" Type="AutoIncrement">1</Data> ... <Data Key="comments" Type="Quote" Translatable="1">Group for default access.</Data> ... </Insert> # SysConfig XML <Setting> <Option SelectedID="0"> <Item Key="0" Translatable="1">No</Item> <Item Key="1" Translatable="1">Yes</Item> </Option> </Setting>
hu: # Adatbázis XML <Insert Table="groups"> <Data Key="id" Type="AutoIncrement">1</Data> ... <Data Key="comments" Type="Quote" Translatable="1">Group for default access.</Data> ... </Insert> # Rendszerbeállítás XML <Setting> <Option SelectedID="0"> <Item Key="0" Translatable="1">No</Item> <Item Key="1" Translatable="1">Yes</Item> </Option> </Setting>

source: Collecting translatable strings into the translation database
hu: Lefordítható szövegek összegyűjtése a fordítási adatbázisba

source: The console command <filename>otrs.Console.pl Dev::Tools::TranslationsUpdate</filename> is used to extract all translatable strings from the source files. These will be collected and written into the translation files.
hu: Az <filename>otrs.Console.pl Dev::Tools::TranslationsUpdate</filename> konzolparancs használható az összes lefordítható szöveg kigyűjtéséhez a forrásfájlokból. Ezek össze lesznek gyűjtve, és ki lesznek írva a fordítási fájlokba.

source: For the OTRS framework and all extension modules that also use Transifex for managing the translations, .pot and .po files are written. These files are used to push the translatable strings to Transifex and pull the translations from there.
hu: Az OTRS keretrendszernél és az összes olyan kiterjesztés modulnál, amelyek szintén a Transifex szolgáltatását használják a fordítások kezeléséhez, .pot és .po fájlok lesznek kiírva. Ezeket a fájlokat használják a lefordítható szövegek feltöltéséhez a Transifexre, illetve a fordítások letöltéséhez onnan.

source: But OTRS requires the translations to be in Perl files for speed reasons. These files will also be generated by <filename>otrs.Console.pl Dev::Tools::TranslationsUpdate</filename>. There are two different translation cache file types which are used in the following order. If a word/sentence is redefined in a translation file, the last definition will be used.
hu: De az OTRS-nek sebességi okok miatt a fordításokra Perl-fájlokban van szüksége. Az <filename>otrs.Console.pl Dev::Tools::TranslationsUpdate</filename> parancs ezeket a fájlokat is elő fogja állítani. Két különböző fordítási gyorsítótár fájltípus létezik, amelyek a következő sorrendben kerülnek felhasználásra. Ha egy szó vagy mondat újra meg van adva egy fordítási fájlban, akkor a legutolsó meghatározást fogja használni.

source: Default Framework Translation File
hu: Alapértelmezett keretrendszer fordítási fájl

source: Custom Translation File
hu: Egyéni fordítási fájl

source: The Default Framework Translation File includes the basic translations. The following is an example of a Default Framework Translation File.
hu: Az alapértelmezett keretrendszer fordítási fájl tartalmazza az alapvető fordításokat. Az alábbi egy alapértelmezett keretrendszer fordítási fájl példája.

source: Format:
hu: Formátum:

source: package Kernel::Language::de; use strict; use warnings; use vars qw(@ISA $VERSION); sub Data { my $Self = shift; # $$START$$ # possible charsets $Self->{Charset} = ['iso-8859-1', 'iso-8859-15', ]; # date formats (%A=WeekDay;%B=LongMonth;%T=Time;%D=Day;%M=Month;%Y=Jear;) $Self->{DateFormat} = '%D.%M.%Y %T'; $Self->{DateFormatLong} = '%A %D %B %T %Y'; $Self->{DateFormatShort} = '%D.%M.%Y'; $Self->{DateInputFormat} = '%D.%M.%Y'; $Self->{DateInputFormatLong} = '%D.%M.%Y - %T'; $Self->{Translation} = { # Template: AAABase 'Yes' => 'Ja', 'No' => 'Nein', 'yes' => 'ja', 'no' => 'kein', 'Off' => 'Aus', 'off' => 'aus', }; # $$STOP$$ return 1; } 1;
hu: package Kernel::Language::hu; use strict; use warnings; use vars qw(@ISA $VERSION); sub Data { my $Self = shift; # $$START$$ # lehetséges karakterkészletek $Self->{Charset} = ['utf-8', 'iso-8859-2', ]; # date formats (%A=WeekDay;%B=LongMonth;%T=Time;%D=Day;%M=Month;%Y=Jear;) $Self->{DateFormat} = '%Y-%M-%D %T'; $Self->{DateFormatLong} = '%Y. %B %D. %A %T'; $Self->{DateFormatShort} = '%Y-%M-%D'; $Self->{DateInputFormat} = '%Y-%M-%D'; $Self->{DateInputFormatLong} = '%Y-%M-%D - %T'; $Self->{Translation} = { # Template: AAABase 'Yes' => 'Igen', 'No' => 'Nem', 'yes' => 'igen', 'no' => 'nem', 'Off' => 'Ki', 'off' => 'ki', }; # $$STOP$$ return 1; } 1;

source: The Custom Translation File is read out last and so its translation which will be used. If you want to add your own wording to your installation, create this file for your language.
hu: Az egyéni fordítási fájl kerül beolvasásra legutoljára, és így annak fordítása, amely használva lesz. Ha saját megfogalmazást szeretne hozzáadni a telepítéshez, akkor hozza létre ezt a fájlt a nyelvéhez.

source: package Kernel::Language::xx_Custom; use strict; use warnings; use vars qw(@ISA $VERSION); sub Data { my $Self = shift; # $$START$$ # own translations $Self->{Translation}->{'Lock'} = 'Lala'; $Self->{Translation}->{'Unlock'} = 'Lulu'; # $$STOP$$ return 1; } 1;
hu: package Kernel::Language::xx_Custom; use strict; use warnings; use vars qw(@ISA $VERSION); sub Data { my $Self = shift; # $$START$$ # saját fordítások $Self->{Translation}->{'Lock'} = 'Lala'; $Self->{Translation}->{'Unlock'} = 'Lulu'; # $$STOP$$ return 1; } 1;

source: The translation process itself
hu: Maga a fordítási folyamat

source: OTRS uses Transifex to manage the translation process. Please see <link linkend="translate">this section</link> for details.
hu: Az OTRS a Transifex szolgáltatását használja a fordítási folyamat kezeléséhez. A részletekért nézze meg <link linkend="translate">ezt a szakaszt</link>.

source: Using the translated data from the code
hu: A kódból lefordított adatok használata

source: You can use the method <code>$LanguageObject->Translate()</code> to translate strings at runtime from Perl code, and <link linkend="translate-tag">the <code>Translate()</code>-Tag</link> in templates.
hu: Használhatja a <code>$LanguageObject->Translate()</code> metódust a szövegek lefordításához futási időben a Perl-kódból, és <link linkend="translate-tag">a <code>Translate()</code>-címkét</link> a sablonokban.

source: Using the power of the OTRS module layers
hu: Az OTRS modulrétegek erejének használata

source: OTRS has a large number of so-called "module layers" which make it very easy to extend the system without patching existing code. One example is the number generation mechanism for tickets. It is a "module layer" with <link linkend="ticketnumber-generator">pluggable modules</link>, and you can add your own custom number generator modules if you wish to do so. Let's look at the different layers in detail!
hu: Az OTRS nagyszámú úgynevezett „modulréteggel” rendelkezik, amely nagyon egyszerűvé teszi a rendszer kibővítését a meglévő kód foltozása nélkül. Egy példa erre a számelőállító mechanizmus a jegyeknél. Ez egy <link linkend="ticketnumber-generator">csatlakoztatható modulokkal</link> rendelkező „modulréteg”, és ha szeretné, hozzáadhatja a saját egyéni számelőállító moduljait is. Nézzük meg részletesen a különböző rétegeket!

source: Authentication and user management
hu: Hitelesítés és felhasználókezelés

source: Preferences
hu: Beállítások

source: Other core functions
hu: Egyéb alapfüggvények

source: Daemon And Scheduler
hu: Démon és ütemező

source: Dynamic Fields
hu: Dinamikus mezők

source: Email Handling
hu: E-mail kezelés

source: Writing a new OTRS frontend module
hu: Egy új OTRS előtétprogram modul írása

source: In this chapter, the writing of a new OTRS module is illustrated on the basis of a simple small program. Necessary prerequisite is an OTRS development environment as specified in the chapter of the same name.
hu: Ebben a fejezetben egy új OTRS modul írása van szemléltetve egy egyszerű kis program alapján. A szükséges előkövetelmény egy olyan OTRS fejlesztői környezet, amely a hasonló nevű fejezetben van megadva.

source: What we want to write
hu: Mit szeretnénk írni

source: We want to write a little OTRS module that displays the text 'Hello World' when called up. First of all we must build the directory <filename>/Hello World</filename> for the module in the developer directory. In this directory, all directories existent in OTRS can be created. Each module should at least contain the following directories:
hu: Szeretnénk írni egy olyan kis OTRS modult, amely a „Hello World” szöveget jeleníti meg, amikor előhívják. Mindenek előtt fel kell építenünk a <filename>/Hello World</filename> könyvtárat a modulhoz a fejlesztői könyvtárban. Ebben a könyvtárban létrehozható az OTRS-ben meglévő összes könyvtár. Minden modulnak legalább a következő könyvtárakat kell tartalmaznia:

source: Default Config File
hu: Alapértelmezett beállítófájl

source: The creation of a module registration facilitates the display of the new module in OTRS. Therefore we create a file <filename>/Kernel/Config/Files/XML/HelloWorld.xml</filename>. In this file, we create a new config element. The impact of the various settings is described in the chapter 'Config Mechanism'.
hu: Egy modulregisztráció létrehozása megkönnyíti az új modul megjelenítését az OTRS-ben. Ezért létrehozunk egy <filename>/Kernel/Config/Files/XML/HelloWorld.xml</filename> fájlt. Ebben a fájlban létrehozunk egy új beállítási elemet. A különféle beállítások hatása a „Beállítási mechanizmus” fejezetben van leírva.

source: Frontend Module
hu: Előtétprogram modul

source: After creating the links and executing the Sysconfig, a new module with the name 'HelloWorld' is displayed. When calling it up, an error message is displayed as OTRS cannot find the matching frontend module yet. This is the next thing to be created. To do so, we create the following file:
hu: A hivatkozások létrehozása és a rendszerbeállítások végrehajtása után megjelenik egy új modul „HelloWorld” néven. Előhívásakor egy hibaüzenet jelenik meg, mivel az OTRS még nem találja a hozzá tartozó előtétprogram modult. Ez a következő dolog, amit létre kell hozni. Ehhez hozzuk létre az alábbi fájlt:

source: # -- # Kernel/Modules/AgentHelloWorld.pm - frontend module # Copyright (C) (year) (name of author) (email of author) # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Modules::AgentHelloWorld; use strict; use warnings; # Frontend modules are not handled by the ObjectManager. our $ObjectManagerDisabled = 1; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {%Param}; bless ($Self, $Type); return $Self; } sub Run { my ( $Self, %Param ) = @_; my %Data = (); my $HelloWorldObject = $Kernel::OM->Get('Kernel::System::HelloWorld'); my $LayoutObject = $Kernel::OM->Get('Kernel::Output::HTML::Layout'); $Data{HelloWorldText} = $HelloWorldObject->GetHelloWorldText(); # build output my $Output = $LayoutObject->Header(Title => "HelloWorld"); $Output .= $LayoutObject->NavigationBar(); $Output .= $LayoutObject->Output( Data => \%Data, TemplateFile => 'AgentHelloWorld', ); $Output .= $LayoutObject->Footer(); return $Output; } 1;
hu: # -- # Kernel/Modules/AgentHelloWorld.pm - előtétprogram modul # Copyright (C) (év) (szerző neve) (szerző e-mail címe) # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Modules::AgentHelloWorld; use strict; use warnings; # Az előtétprogram-modulokat nem kezeli az objektumkezelő. our $ObjectManagerDisabled = 1; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {%Param}; bless ($Self, $Type); return $Self; } sub Run { my ( $Self, %Param ) = @_; my %Data = (); my $HelloWorldObject = $Kernel::OM->Get('Kernel::System::HelloWorld'); my $LayoutObject = $Kernel::OM->Get('Kernel::Output::HTML::Layout'); $Data{HelloWorldText} = $HelloWorldObject->GetHelloWorldText(); # kimenet felépítése my $Output = $LayoutObject->Header(Title => "HelloWorld"); $Output .= $LayoutObject->NavigationBar(); $Output .= $LayoutObject->Output( Data => \%Data, TemplateFile => 'AgentHelloWorld', ); $Output .= $LayoutObject->Footer(); return $Output; } 1;

source: Core Module
hu: Alapmodul

source: Next, we create the file for the core module <filename>/HelloWorld/Kernel/System/HelloWorld.pm</filename> with the following content:
hu: Ezután hozzunk létre egy fájlt a <filename>/HelloWorld/Kernel/System/HelloWorld.pm</filename> alapmodulhoz az alábbi tartalommal:
