Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: In general, you should try to write your code as readable and self-explaining as possible. Don't write a comment to explain what obvious code does, this is unnecessary duplication. Good comments should explain <emphasis>why</emphasis> there is some code, possible side effects and anything that might be special or unusually complicated about the code.
hu: Általánosságban meg kell próbálni olvashatóan és önmagát magyarázóan írni a kódot, amennyire csak lehetséges. Ne írjon megjegyzést annak magyarázásához, hogy a nyilvánvaló kód mit csinál, mert az szükségtelen megkettőzés. A jó megjegyzéseknek azt kell elmagyarázniuk, hogy <emphasis>miért</emphasis> van valami a kódban, mik a lehetséges mellékhatások és bármi egyéb, amely különleges lehet vagy szokatlanul bonyolult a kóddal kapcsolatban.

source: Please adhere to the following guidelines:
hu: Ragaszkodjon a következő irányelvekhez:

source: Make the code so readable that comments are not needed, if possible.
hu: Tegye a kódot annyira olvashatóvá, hogy ne legyen szükség magyarázatra, ha ez lehetséges.

source: It's always preferable to write code so that it is very readable and self-explaining, for example with precise variable and function names.
hu: Mindig vonzóbb a kódot úgy írni, hogy nagyon olvasható és önmagát magyarázó legyen, például pontos változónevekkel és függvénynevekkel.

source: Don't say what the code says (DRY -> Don't repeat yourself).
hu: Ne mondja el, amit a kód is elmond (DRY: Don`t Repeat Yourself – Ne ismételd önmagad).

source: Don't repeat (obvious) code in the comments.
hu: Ne ismételjen (nyilvánvaló) kódot a magyarázatokban.

source: # WRONG: # get config object my $ConfigObject = $Kernel::OM->Get('Kernel::Config');
hu: # HIBÁS: # beállítási objektum lekérése my $ConfigObject = $Kernel::OM->Get('Kernel::Config');

source: Document <emphasis>why</emphasis> the code is there, not how it works.
hu: Azt dokumentálja, hogy a kód <emphasis>miért</emphasis> van ott, és ne azt, hogy hogyan működik.

source: Usually, code comments should explain the <emphasis>purpose</emphasis> of code, not how it works in detail. There might be exceptions for specially complicated code, but in this case also a refactoring to make it more readable could be commendable.
hu: Általában a kódmagyarázatoknak a kód <emphasis>célját</emphasis> kellene elmagyarázniuk, és nem azt, hogy részletesen hogyan működik. Lehetnek kivételek különösen bonyolult kódnál, de ebben az esetben egy átszerkesztés lenne dicséretes, hogy olvashatóbb legyen.

source: Document pitfalls.
hu: Dokumentálja a buktatókat.

source: Everything that is unclear, tricky or that puzzled you during development should be documented.
hu: Mindent dokumentálni kell, ami nem világos, furfangos vagy amit összerakott a fejlesztés során.

source: Use full-line sentence-style comments to document algorithm paragraphs.
hu: Használjon teljes soros mondatszerű magyarázatokat az algoritmus bekezdéseinek dokumentálásához.

source: Always use full sentences (uppercase first letter and final period). Subsequent lines of a sentence should be indented.
hu: Mindig teljes mondatokat használjon (első betűt nagybetűvel írva és központozással). Egy mondat következő sorait be kell húzni.

source: # Check if object name is provided. if ( !$_[1] ) { $_[0]->_DieWithError( Error => "Error: Missing parameter (object name)", ); } # Record the object we are about to retrieve to potentially build better error messages. # Needs to be a statement-modifying 'if', otherwise 'local' is local # to the scope of the 'if'-block. local $CurrentObject = $_[1] if !$CurrentObject;
hu: # Annak ellenőrzése, hogy meg lett-e adva objektumnév. if ( !$_[1] ) { $_[0]->_DieWithError( Error => "Hiba: hiányzó paraméter (objektumnév)", ); } # Az objektum rögzítése, amelyet lekérni készülünk, hogy potenciálisan jobb # hibaüzenetet készíthessünk. # Utasításmódosító „if”-nek kell lennie, különben a „local” helyi lesz az # „if”-blokk hatóköréhez képest. local $CurrentObject = $_[1] if !$CurrentObject;

source: Use short end-of-line comments to add detail information.
hu: Használjon rövid sorvégi magyarázatokat a részletes információk hozzáadásához.

source: These can either be a complete sentence (capital first letter and period) or just a phrase (lowercase first letter and no period).
hu: Ez lehet vagy teljes mondat (nagy kezdőbetű és központozás), vagy csak egy kifejezés (kis kezdőbetű és nincs központozás).

source: $BuildMode = oct $Param{Mode}; # *from* octal, not *to* octal # or $BuildMode = oct $Param{Mode}; # Convert *from* octal, not *to* octal.
hu: $BuildMode = oct $Param{Mode}; # oktális *típusról*, nem oktális *típusra* # vagy $BuildMode = oct $Param{Mode}; # Átalakítás oktális *típusról*, nem oktális *típusra*.

source: Database interaction
hu: Adatbázis kölcsönhatás

source: Declaration of SQL statements
hu: SQL-utasítások deklarációja

source: If there is no chance for changing the SQL statement, it should be used in the <literal>Prepare</literal> function. The reason for this is, that the SQL statement and the bind parameters are closer to each other.
hu: Ha nincs esély az SQL-utasítás megváltoztatására, akkor azt a <literal>Prepare</literal> függvényben kell használni. Ennek az az oka, hogy az SQL-utasítás és a kötési paraméterek közelebb vannak egymáshoz.

source: The SQL statement should be written as one nicely indented string without concatenation like this:
hu: Az SQL-utasítást egy összefűzések nélküli, pontosan behúzott szövegként kell megírni úgy, mint például ezt:

source: This is easy to read and modify, and the whitespace can be handled well by our supported DBMSs. For auto-generated SQL code (like in <literal>TicketSearch</literal>), this indentation is not necessary.
hu: Ezt könnyű olvasni és módosítani, és az üres karaktereket jól tudják kezelni a támogatott DBMS-ek. Az automatikusan előállított SQL-kódnál (mint a <literal>TicketSearch</literal> modulban) ez a behúzás nem szükséges.

source: Returning on errors
hu: Visszatérés hibák esetén

source: Whenever you use database functions you should handle errors. If anything goes wrong, return from subroutine:
hu: Valahányszor adatbázis-függvényeket használ, kezelnie kell a hibákat. Ha valami elromlik, az visszakerül a szubrutinból:

source: Using Limit
hu: Korlát használata

source: Use <literal>Limit => 1</literal> if you expect just one row to be returned.
hu: Használja a <literal>Limit => 1</literal> korlátozást, ha csak egyetlen sort vár visszatérésként.

source: Using the <literal>while</literal> loop
hu: A <literal>while</literal> ciklus használata

source: Always use the <literal>while</literal> loop, even when you expect one row to be returned, as some databases do not release the statement handle and this can lead to weird bugs.
hu: Mindig használja a <literal>while</literal> ciklust még akkor is, ha csak egyetlen sort vár visszatérésként, mivel néhány adatbázis nem szabadítja fel az utasításkezelőt, és ez furcsa hibákhoz vezethet.

source: Architecture Overview
hu: Szerkezeti áttekintés

source: The OTRS framework is modular. The following picture shows the basic layer architecture of OTRS.
hu: Az OTRS keretrendszer moduláris. A következő kép az OTRS alapvető rétegszerkezetét jeleníti meg.

source: OTRS Architecture
hu: Az OTRS szerkezete

source: Introduced in OTRS 3.1, the OTRS Generic Interface continues OTRS modularity. The next picture shows the basic layer architecture of the Generic Interface.
hu: Az OTRS 3.1-ben bevezetett OTRS általános felület folytatja az OTRS modularitását. A következő kép az általános felület alapvető rétegszerkezetét jeleníti meg.

source: Generic Interface Architecture
hu: Az általános felület szerkezete

source: Directories
hu: Könyvtárak

source: Directory
hu: Könyvtár

source: Description
hu: Leírás

source: commandline tools
hu: parancssori eszközök

source: web handle
hu: webes kezelő

source: fast cgi web handle
hu: fast cgi webes kezelő

source: application codebase
hu: alkalmazás kódbázisa

source: configuration files
hu: beállítófájlok

source: the Generic Interface API
hu: az általános felület API-ja

source: invoker modules for Generic Interface
hu: meghívó modulok az általános felülethez

source: mapping modules for Generic Interface, e.g. Simple
hu: leképező modulok az általános felülethez, például: Simple

source: operation modules for Generic Interface
hu: műveleti modulok az általános felülethez

source: transport modules for Generic Interface, e.g. "HTTP SOAP"
hu: átviteli modulok az általános felülethez, például: „HTTP SOAP”

source: language translation files
hu: nyelvi fordítási fájlok

source: Scheduler files
hu: az ütemező fájljai

source: handler modules for scheduler tasks, e.g. GenericInterface
hu: kezelőmodulok az ütemező feladatokhoz, például: GenericInterface

source: core modules, e.g. Log, Ticket...
hu: alapmodulok, például: Log, Ticket…

source: frontend modules, e.g. QueueView...
hu: előtétprogram modulok, például: QueueView…

source: html templates
hu: HTML sablonok

source: variable data
hu: változó adatok

source: logfiles
hu: naplófájlok

source: cron files
hu: cron fájlok

source: htdocs directory with index.html
hu: htdocs könyvtár az index.html fájllal

source: available skins for the Agent interface
hu: az ügyintéző felületéhez elérhető felszínek

source: available skins for the Customer interface
hu: az ügyfélfelülethez elérhető felszínek

source: JavaScript files
hu: JavaScript fájlok

source: misc files
hu: egyéb fájlok

source: unit test files
hu: egységteszt fájlok

source: unit test sample data files
hu: egységteszt példaadat fájlok

source: Files
hu: Fájlok

source: .pm = Perl Module
hu: .pm = Perl-modul

source: .tt = Template::Toolkit template files
hu: .tt = Template::Toolkit sablonfájlok

source: .dist = Default templates of files
hu: .dist = Fájlok alapértelmezett sablonjai

source: .yaml or .yml = YAML files, used for Web Service configuration
hu: .yaml vagy .yml = A webszolgáltatás beállításaihoz használt YAML-fájlok

source: Core Modules
hu: Alapmodulok

source: Core modules are located under <filename>$OTRS_HOME/Kernel/System/*</filename>. This layer is for the logical work. Core modules are used to handle system routines like "lock ticket" and "create ticket". A few main core modules are:
hu: Az alapmodulok az <filename>$OTRS_HOME/Kernel/System/*</filename> alatt találhatók. Ez a réteg a logikai munkához van. Az alapmodulok a rendszer rutinjai kezeléséhez használhatók, mint például „jegy zárolása” és „jegy létrehozása”. Néhány fő alapmodul a következő:

source: <literal>Kernel::System::Config</literal> (to access config options)
hu: <literal>Kernel::System::Config</literal> (beállítási lehetőségek eléréséhez)

source: <literal>Kernel::System::Log</literal> (to log into OTRS log backend)
hu: <literal>Kernel::System::Log</literal> (naplózáshoz az OTRS naplózó háttérprogramjába)

source: <literal>Kernel::System::DB</literal> (to access the database backend)
hu: <literal>Kernel::System::DB</literal> (az adatbázis háttérprogram eléréséhez)

source: <literal>Kernel::System::Auth</literal> (to check user authentication)
hu: <literal>Kernel::System::Auth</literal> (felhasználói hitelesítés ellenőrzéséhez)

source: <literal>Kernel::System::User</literal> (to manage users)
hu: <literal>Kernel::System::User</literal> (felhasználók kezeléséhez)

source: <literal>Kernel::System::Group</literal> (to manage groups)
hu: <literal>Kernel::System::Group</literal> (csoportok kezeléséhez)

source: <literal>Kernel::System::Email</literal> (for sending emails)
hu: <literal>Kernel::System::Email</literal> (e-mailek küldéséhez)

source: For more information, see: <ulink url="http://otrs.github.io/doc/">http://otrs.github.io/doc/</ulink>
hu: További információkért nézze meg a <ulink url="http://otrs.github.io/doc/">http://otrs.github.io/doc/</ulink> oldalt.

source: Frontend Handle
hu: Előtétprogram kezelés

source: The interface between the browser, web server and the frontend modules. A frontend module can be used via the HTTP-link.
hu: A böngésző, a webkiszolgáló és az előtétprogram modulok közti felület. Egy előtétprogram modul használható HTTP-hivatkozáson keresztül.

source: Frontend Modules
hu: Előtétprogram modulok

source: Frontend modules are located under <filename>$OTRS_HOME/Kernel/Modules/*.pm</filename>. There are two public functions in there - <code>new()</code> and <code>run()</code> - which are accessed from the Frontend Handle (e.g. <filename>index.pl</filename>).
hu: Az előtétprogram modulok az <filename>$OTRS_HOME/Kernel/Modules/*.pm</filename> alatt találhatók. Két nyilvános függvény van ebben - <code>new()</code> és <code>run()</code> - amelyek az előtétprogram kezelésből érhetők el (például <filename>index.pl</filename>).

source: <code>new()</code> is used to create a frontend module object. The Frontend Handle provides the used frontend module with the basic framework objects. These are, for example: <literal>ParamObject</literal> (to get web form params), <literal>DBObject</literal> (to use existing database connections), <literal>LayoutObject</literal> (to use templates and other html layout functions), <literal>ConfigObject</literal> (to access config settings), <literal>LogObject</literal> (to use the framework log system), <literal>UserObject</literal> (to get the user functions from the current user), <literal>GroupObject</literal> (to get the group functions).
hu: A <code>new()</code> előtétprogram modul objektumok létrehozásához használható. Az előtétprogram kezelés biztosítja a használt előtétprogram modulokat az alapvető keretrendszer objektumokkal. Ezek például a következők: <literal>ParamObject</literal> (webes űrlapparaméterek lekéréséhez), <literal>DBObject</literal> (meglévő adatbázis-kapcsolatok használatához), <literal>LayoutObject</literal> (sablonok és egyéb HTML elrendezés függvények használatához), <literal>ConfigObject</literal> (konfigurációs beállítások hozzáféréséhez), <literal>LogObject</literal> (a keretrendszer naplózó rendszerének használatához), <literal>UserObject</literal> (a felhasználói függvények lekéréséhez a jelenlegi felhasználótól), <literal>GroupObject</literal> (a csoportfüggvények lekéréséhez).

source: For more information on core modules see: <ulink url="http://otrs.github.io/doc/">http://otrs.github.io/doc/</ulink>
hu: Az alapmodulokról további információkért nézze meg a <ulink url="http://otrs.github.io/doc/">http://otrs.github.io/doc/</ulink> oldalt.

source: CMD Frontend
hu: CMD előtétprogram

source: The CMD (Command) Frontend is like the Web Frontend Handle and the Web Frontend Module in one (just without the <literal>LayoutObject</literal>) and uses the core modules for some actions in the system.
hu: A CMD (Command - Parancs) előtétprogram a webes előtétprogram kezeléshez és a webes előtétprogram modulokhoz együtt hasonló (csak a <literal>LayoutObject</literal> nélkül), és az alapmodulokat használja néhány műveletnél a rendszeren.

source: Generic Interface Modules
hu: Általános felület modulok

source: Generic Interface modules are located under <filename>$OTRS_HOME/Kernel/GenericInterface/*</filename>. Generic Interface modules are used to handle each part of a web service execution on the system. The main modules for the Generic Interface are:
hu: Az általános felület modulok az <filename>$OTRS_HOME/Kernel/GenericInterface/*</filename> alatt találhatók. Az általános felület modulok egy webszolgáltatás végrehajtásának egyes részei kezeléséhez használhatók a rendszeren. Az általános felület fő moduljai a következők:

source: <literal>Kernel::GenericInterface::Transport</literal> (to interact with remote systems)
hu: <literal>Kernel::GenericInterface::Transport</literal> (kölcsönhatásba lépéshez távoli rendszerekkel)

source: <literal>Kernel::GenericInterface::Mapping</literal> (to transform data into a required format)
hu: <literal>Kernel::GenericInterface::Mapping</literal> (adatok átalakításához egy szükséges formátumba)

source: <literal>Kernel::GenericInterface::Requester</literal> (to use OTRS as a client for the web service)
hu: <literal>Kernel::GenericInterface::Requester</literal> (az OTRS mint kérelmezőként való használatához a webszolgáltatásnál)

source: <literal>Kernel::GenericInterface::Provider</literal> (to use OTRS as a server for web service)
hu: <literal>Kernel::GenericInterface::Provider</literal> (az OTRS mint kiszolgálóként való használatához a webszolgáltatásnál)

source: <literal>Kernel::GenericInterface::Operation</literal> (to execute Provider actions)
hu: <literal>Kernel::GenericInterface::Operation</literal> (szolgáltató műveletek végrehajtásához)

source: <literal>Kernel::GenericInterface::Invoker</literal> (to execute Requester actions)
hu: <literal>Kernel::GenericInterface::Invoker</literal> (kérelmező műveletek végrehajtásához)

source: <literal>Kernel::GenericInterface::Debugger</literal> (to track web service communication, using log entries)
hu: <literal>Kernel::GenericInterface::Debugger</literal> (webszolgáltatás kommunikációjának követéséhez naplóbejegyzések használatával)

source: Generic Interface Invoker Modules
hu: Általános felület meghívó modulok

source: Generic Interface Invoker modules are located under <filename>$OTRS_HOME/Kernel/GenericInterface/Invoker/*</filename>. Each Invoker is contained in a folder called <literal>Controller</literal>. This approach helps to define a name space not only for internal classes and methods but for filenames too. For example: <filename>$OTRS_HOME/Kernel/GenericInterface/Invoker/Test/</filename> is the Controller for all Test-type invokers.
hu: Az általános felület meghívó modulok az <filename>$OTRS_HOME/Kernel/GenericInterface/Invoker/*</filename> alatt találhatók. Minden egyes meghívót egy <literal>Controller</literal> elnevezésű mappa tartalmaz. Ez a megközelítés nem csak a belső osztályoknak és metódusoknak segít egy névteret meghatározni, hanem a fájlneveknek is. Például az <filename>$OTRS_HOME/Kernel/GenericInterface/Invoker/Test/</filename> az összes Teszt-típusú meghívó vezérlője.

source: Generic Interface Invoker modules are used as a backend to create requests for Remote Systems to execute actions.
hu: Az általános felület meghívó modulok háttérprogramként használhatók kérések létrehozásához a távoli rendszereknél műveletek végrehajtásához.

source: Generic Interface Mapping Modules
hu: Általános felület leképező modulok

source: Generic Interface Mapping modules are located under <filename>$OTRS_HOME/Kernel/GenericInterface/Mapping/*</filename>. These modules are used to transform data (keys and values) from one format to another.
hu: Az általános felület leképező modulok az <filename>$OTRS_HOME/Kernel/GenericInterface/Mapping/*</filename> alatt találhatók. Ezek a modulok adatok (kulcsok és értékek) átalakításához használhatók az egyik formátumról egy másikra.

source: Generic Interface Operation Modules
hu: Általános felület műveleti modulok

source: Generic Interface Operation modules are located under <filename>$OTRS_HOME/Kernel/GenericInterface/Operation/*</filename>. Each Operation is contained in a folder called <literal>Controller</literal>. This approach help to define a name space not only for internal classes and methods but for filenames too. For example: <filename>$OTRS_HOME/Kernel/GenericInterface/Operation/Ticket/</filename> is the Controller for all Ticket-type operations.
hu: Az általános felület műveleti modulok az <filename>$OTRS_HOME/Kernel/GenericInterface/Operation/*</filename> alatt találhatók. Minden egyes műveletet egy <literal>Controller</literal> elnevezésű mappa tartalmaz. Ez a megközelítés nem csak a belső osztályoknak és metódusoknak segít egy névteret meghatározni, hanem a fájlneveknek is. Például az <filename>$OTRS_HOME/Kernel/GenericInterface/Operation/Ticket/</filename> az összes Ticket-típusú művelet vezérlője.

source: Generic Interface operation modules are used as a backend to perform actions requested by a remote system.
hu: Az általános felület műveleti modulok háttérprogramként használhatók egy távoli rendszer által kért műveletek végrehajtásához.

source: Generic Interface Transport Modules
hu: Általános felület átviteli modulok

source: Generic Interface Network Transport modules are located under <filename>$OTRS_HOME/Kernel/GenericInterface/Operation/*</filename>. Each transport module should be placed in a directory named as the Network Protocol used. For example: The "HTTP SOAP" transport module, located in <filename>$OTRS_HOME/Kernel/GenericInterface/Transport/HTTP/SOAP.pm</filename>.
hu: Az általános felület átviteli modulok az <filename>$OTRS_HOME/Kernel/GenericInterface/Operation/*</filename> alatt találhatók. Minden egyes átviteli modult egy olyan elnevezésű könyvtárba kell elhelyezni, ahogy a használt hálózati protokollt hívják. Például a „HTTP SOAP” átviteli modul a <filename>$OTRS_HOME/Kernel/GenericInterface/Transport/HTTP/SOAP.pm</filename> fájlban található.

source: Generic Interface transport modules are used send data to, and receive data from a Remote System.
hu: Az általános felület átviteli modulok adatok küldéséhez használhatók egy távoli rendszer számára, valamint adatok fogadásához tőle.

source: Scheduler Task Handler Modules
hu: Ütemező feladatkezelő modulok

source: Scheduler Task Handler modules are located under <filename>$OTRS_HOME/Kernel/Scheduler/TaskHandler/*</filename>. These modules are used to perform asynchronous tasks. For example, the <literal>GenericInterface</literal> task handler perform Generic Interface Requests to Remote Systems outside the apache process. This helps the system to be more responsive, preventing possible performance issues.
hu: Az ütemező feladatkezelő modulok az <filename>$OTRS_HOME/Kernel/Scheduler/TaskHandler/*</filename> alatt találhatók. Ezek a modulok aszinkron feladatok végrehajtásához használhatók. Például a <literal>GenericInterface</literal> feladatkezelő általános felület kéréseket hajt végre a távoli rendszerekhez az apache folyamaton kívül. Ez abban segíti a rendszert, hogy fogékonyabb legyen, megelőzve a lehetséges teljesítményproblémákat.

source: Database
hu: Adatbázis

source: The database interface supports different databases.
hu: Az adatbázis-felület különböző adatbázisokat támogat.

source: For the OTRS data model please refer to the files in your <filename>/doc</filename> directory. Alternatively you can look at the data model <ulink url="https://github.com/OTRS/otrs/blob/master/development/diagrams/Database/OTRSDatabaseDiagram.png"> on github </ulink>.
hu: Az OTRS adatmodelljéhez nézze meg a <filename>/doc</filename> könyvtárban lévő fájlokat. Alternatívaként megnézheti az adatmodellt a <ulink url="https://github.com/OTRS/otrs/blob/master/development/diagrams/Database/OTRSDatabaseDiagram.png">githubon</ulink> is.

source: Development Environment
hu: Fejlesztői környezet

source: To facilitate the writing of OTRS expansion modules, the creation of a development environment is necessary. The source code of OTRS and additional public modules can be found on <ulink url="http://otrs.github.io">github</ulink>.
hu: Az OTRS bővítőmodulok írásának megkönnyítéséhez egy fejlesztői környezet létrehozása szükséges. Az OTRS és a további nyilvános modulok forráskódja megtalálható a <ulink url="http://otrs.github.io">githubon</ulink>.

source: Framework checkout
hu: A keretrendszer letöltése

source: First of all a directory must be created in which the modules can be stored. Then switch to the new directory using the command line and check them out by using the following command:
hu: Először is létre kell hozni egy könyvtárat, amelyben eltárolhatók a modulok. Ezután lépje be az új könyvtárba a parancssor használatával, és töltse le azokat a következő parancs használatával:
