Repository: bessarabov/doc-developer
Catalog: i18n/doc-developer.*.po
Languages: hu

source: # -- # Kernel/System/Stats/Static/StaticStatsTemplate.pm # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Stats::Static::StaticStatsTemplate; use strict; use warnings; use Kernel::System::Type; use Kernel::System::Ticket; use Kernel::System::Queue; =head1 NAME StaticStatsTemplate.pm - the module that creates the stats about tickets in a queue =head1 SYNOPSIS All functions =head1 PUBLIC INTERFACE =over 4 =cut =item new() create an object use Kernel::Config; use Kernel::System::Encode; use Kernel::System::Log; use Kernel::System::Main; use Kernel::System::Time; use Kernel::System::DB; use Kernel::System::Stats::Static::StaticStatsTemplate; my $ConfigObject = Kernel::Config->new(); my $EncodeObject = Kernel::System::Encode->new( ConfigObject => $ConfigObject, ); my $LogObject = Kernel::System::Log->new( ConfigObject => $ConfigObject, ); my $MainObject = Kernel::System::Main->new( ConfigObject => $ConfigObject, LogObject => $LogObject, ); my $TimeObject = Kernel::System::Time->new( ConfigObject => $ConfigObject, LogObject => $LogObject, ); my $DBObject = Kernel::System::DB->new( ConfigObject => $ConfigObject, LogObject => $LogObject, MainObject => $MainObject, ); my $StatsObject = Kernel::System::Stats::Static::StaticStatsTemplate->new( ConfigObject => $ConfigObject, LogObject => $LogObject, MainObject => $MainObject, TimeObject => $TimeObject, DBObject => $DBObject, EncodeObject => $EncodeObject, ); =cut sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {%Param}; bless( $Self, $Type ); # check all needed objects for my $Needed ( qw(DBObject ConfigObject LogObject TimeObject MainObject EncodeObject) ) { $Self->{$Needed} = $Param{$Needed} || die "Got no $Needed"; } # create needed objects $Self->{TypeObject} = Kernel::System::Type->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); return $Self; } =item Param() Get all parameters a user can specify. my @Params = $StatsObject->Param(); =cut sub Param { my $Self = shift; my %Queues = $Self->{QueueObject}->GetAllQueues(); my %Types = $Self->{TypeObject}->TypeList( Valid => 1, ); my @Params = ( { Frontend => 'Type', Name => 'TypeIDs', Multiple => 1, Size => 3, Data => \%Types, }, { Frontend => 'Queue', Name => 'QueueIDs', Multiple => 1, Size => 3, Data => \%Queues, }, ); return @Params; } =item Run() generate the statistic. my $StatsInfo = $StatsObject->Run( TypeIDs => [ 1, 2, 4 ], QueueIDs => [ 3, 4, 6 ], ); =cut sub Run { my ( $Self, %Param ) = @_; # check needed stuff for my $Needed (qw(TypeIDs QueueIDs)) { if ( !$Param{$Needed} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Need $Needed!", ); return; } } # set report title my $Title = 'Tickets per Queue'; # table headlines my @HeadData = ( 'Ticket Number', 'Queue', 'Type', ); my @Data; my @TicketIDs = $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'ARRAY', Permission => 'ro', %Param, ); for my $TicketID ( @TicketIDs ) { my %Ticket = $Self->{TicketObject}->TicketGet( UserID => 1, TicketID => $TicketID, ); push @Data, [ $Ticket{TicketNumber}, $Ticket{Queue}, $Ticket{Type} ]; } return ( [$Title], [@HeadData], @Data ); } 1; =back =head1 TERMS AND CONDITIONS This software is part of the OTRS project (http://otrs.org/). This software comes with ABSOLUTELY NO WARRANTY. For details, see the enclosed file COPYING for license information (AGPL). If you did not receive this file, see http://www.gnu.org/licenses/agpl.txt. =cut
hu: # -- # Kernel/System/Stats/Static/StaticStatsTemplate.pm # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::System::Stats::Static::StaticStatsTemplate; use strict; use warnings; use Kernel::System::Type; use Kernel::System::Ticket; use Kernel::System::Queue; =head1 NAME StaticStatsTemplate.pm - a modul, amely létrehozza a statisztikákat a várólistákban lévő jegyekről =head1 SYNOPSIS Az összes függvény =head1 PUBLIC INTERFACE =over 4 =cut =item new() egy objektum létrehozása use Kernel::Config; use Kernel::System::Encode; use Kernel::System::Log; use Kernel::System::Main; use Kernel::System::Time; use Kernel::System::DB; use Kernel::System::Stats::Static::StaticStatsTemplate; my $ConfigObject = Kernel::Config->new(); my $EncodeObject = Kernel::System::Encode->new( ConfigObject => $ConfigObject, ); my $LogObject = Kernel::System::Log->new( ConfigObject => $ConfigObject, ); my $MainObject = Kernel::System::Main->new( ConfigObject => $ConfigObject, LogObject => $LogObject, ); my $TimeObject = Kernel::System::Time->new( ConfigObject => $ConfigObject, LogObject => $LogObject, ); my $DBObject = Kernel::System::DB->new( ConfigObject => $ConfigObject, LogObject => $LogObject, MainObject => $MainObject, ); my $StatsObject = Kernel::System::Stats::Static::StaticStatsTemplate->new( ConfigObject => $ConfigObject, LogObject => $LogObject, MainObject => $MainObject, TimeObject => $TimeObject, DBObject => $DBObject, EncodeObject => $EncodeObject, ); =cut sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {%Param}; bless( $Self, $Type ); # az összes szükséges objektum ellenőrzése for my $Needed ( qw(DBObject ConfigObject LogObject TimeObject MainObject EncodeObject) ) { $Self->{$Needed} = $Param{$Needed} || die "Nincs $Needed"; } # a szükséges objektumok létrehozása $Self->{TypeObject} = Kernel::System::Type->new( %{$Self} ); $Self->{TicketObject} = Kernel::System::Ticket->new( %{$Self} ); $Self->{QueueObject} = Kernel::System::Queue->new( %{$Self} ); return $Self; } =item Param() Az összes paraméter lekérése, amelyet egy felhasználó megadhat. my @Params = $StatsObject->Param(); =cut sub Param { my $Self = shift; my %Queues = $Self->{QueueObject}->GetAllQueues(); my %Types = $Self->{TypeObject}->TypeList( Valid => 1, ); my @Params = ( { Frontend => 'Type', Name => 'TypeIDs', Multiple => 1, Size => 3, Data => \%Types, }, { Frontend => 'Queue', Name => 'QueueIDs', Multiple => 1, Size => 3, Data => \%Queues, }, ); return @Params; } =item Run() A statisztika előállítása. my $StatsInfo = $StatsObject->Run( TypeIDs => [ 1, 2, 4 ], QueueIDs => [ 3, 4, 6 ], ); =cut sub Run { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése for my $Needed (qw(TypeIDs QueueIDs)) { if ( !$Param{$Needed} ) { $Self->{LogObject}->Log( Priority => 'error', Message => "Szükséges: $Needed!", ); return; } } # a jelentés címének beállítása my $Title = 'Jegyek várólistánként'; # táblázat címsorok my @HeadData = ( 'Jegyszám', 'Várólista', 'Típus', ); my @Data; my @TicketIDs = $Self->{TicketObject}->TicketSearch( UserID => 1, Result => 'ARRAY', Permission => 'ro', %Param, ); for my $TicketID ( @TicketIDs ) { my %Ticket = $Self->{TicketObject}->TicketGet( UserID => 1, TicketID => $TicketID, ); push @Data, [ $Ticket{TicketNumber}, $Ticket{Queue}, $Ticket{Type} ]; } return ( [$Title], [@HeadData], @Data ); } 1; =back =head1 TERMS AND CONDITIONS This software is part of the OTRS project (http://otrs.org/). This software comes with ABSOLUTELY NO WARRANTY. For details, see the enclosed file COPYING for license information (AGPL). If you did not receive this file, see http://www.gnu.org/licenses/agpl.txt. =cut

source: There is no configuration needed. Right after installation, the module is available to create a statistic for this module.
hu: Nincs szükség beállításokra. Közvetlenül telepítés után a modul elérhető egy statisztika létrehozásához ennél a modulnál.

source: Caveats and Warnings for static stats.
hu: Ellenjavaslatok és figyelmeztetések a statikus statisztikáknál.

source: Static stat modules are available since OTRS 1.3.
hu: A statikus statisztikamodulok az OTRS 1.3 óta érhetők el.

source: Using old static stats
hu: Régi statikus statisztikák használata

source: Standard OTRS versions 1.3 and 2.0 already facilitated the generation of stats. Various stats for OTRS versions 1.3 and 2.0 which have been specially developed to meet customers' requirements can be used in more recent versions too.
hu: A szabványos 1.3-as és 2.0-ás OTRS verziók már megkönnyítették a statisztikák előállítását. Az OTRS 1.3-as és 2.0-ás verzióinak különféle statisztikái, amelyek különlegesen lettek kifejlesztve, hogy kielégítsék az ügyfelek követelményeit, használhatók az újabb verziókban is.

source: The files must merely be moved from the <filename>Kernel/System/Stats/</filename> path to <filename>Kernel/System/Stats/Static/</filename>. Additionally the package name of the respective script must be amended by <literal>::Static</literal>.
hu: A fájlokat pusztán csak át kell helyezni a <filename>Kernel/System/Stats/</filename> útvonalról a <filename>Kernel/System/Stats/Static/</filename> könyvtárba. Továbbá a megfelelő parancsfájl csomagnevét <literal>::Static</literal> névre kell módosítani.

source: The following example shows how the first path is amended.
hu: A következő példa azt mutatja be, hogy hogyan kell az első útvonalat módosítani.

source: Ticket Event Module
hu: Jegyesemény modul

source: Ticket event modules are running right after a ticket action takes place. Per convention these modules are located in the directory <filename>Kernel/System/Ticket/Event</filename>. A ticket event module needs only two functions: <code>new()</code> and <code>Run()</code>. The method <code>Run()</code> receives at least the parameters <literal>Event</literal>, <literal>UserID</literal> and <literal>Data</literal>. <literal>Data</literal> is a hash ref containing data of the ticket, and in case of Article-related events also containing Article data.
hu: A jegyesemény modulok közvetlenül azután futnak le, amikor egy jegyművelet megtörténik. Megegyezés szerint ezek a modulok a <filename>Kernel/System/Ticket/Event</filename> könyvtárban találhatók. Egy jegyesemény modulnak mindössze két függvényre van szüksége: <code>new()</code> és <code>Run()</code>. A <code>Run()</code> metódus legalább az <literal>Event</literal>, a <literal>UserID</literal> és a <literal>Data</literal> paramétereket fogadja. A <literal>Data</literal> a jegy adatait tartalmazó kivonathivatkozás, és a bejegyzésre vonatkozó események esetében a bejegyzés adatait is tartalmazza.

source: See <filename>Kernel/System/Ticket/Event/EventModulePostTemplate.pm</filename> in the package <literal>TemplateModule</literal>.
hu: Nézze meg a <filename>Kernel/System/Ticket/Event/EventModulePostTemplate.pm</filename> fájlt a <literal>TemplateModule</literal> csomagban.

source: See <filename>Kernel/Config/Files/EventModulePostTemplate.xml</filename> in the package <literal>TemplateModule</literal>.
hu: Nézze meg a <filename>Kernel/Config/Files/EventModulePostTemplate.xml</filename> fájlt a <literal>TemplateModule</literal> csomagban.

source: A ticket should be unlocked after a move action.
hu: Egy jegyet fel kell oldani egy áthelyezés művelet után.

source: This standard feature has been implemented with the ticket event module <literal>Kernel::System::Ticket::Event::ForceUnlock</literal>. When this feature is not wanted, then it can be turned off by unsetting the SysConfig entry <literal>Ticket::EventModulePost###910-ForceUnlockOnMove</literal>.
hu: Ez a szabványos funkció a <literal>Kernel::System::Ticket::Event::ForceUnlock</literal> jegyesemény modullal lett megvalósítva. Amikor erre a funkcióra nincs szükség, akkor az kikapcsolható a <literal>Ticket::EventModulePost###910-ForceUnlockOnMove</literal> rendszerbeállítási bejegyzés beállításának törlésével.

source: Perform extra cleanup action when a ticket is deleted.
hu: További tisztítóművelet végrehajtása egy jegy törlésekor.

source: A customized OTRS might hold non-standard data in additional database tables. When a ticket is deleted then this additional data needs to be deleted. This functionality can be achieved with a ticket event module listening to <literal>TicketDelete</literal> events.
hu: Egy személyre szabott OTRS tarthat nem szabványos adatokat további adatbázistáblákban. Amikor egy jegyet törölnek, akkor ezeket a további adatokat is törölni kell. Ez a funkcionalitás elérhető egy olyan jegyesemény modullal, amely a <literal>TicketDelete</literal> eseményekre figyel.

source: New tickets should be twittered.
hu: Az új jegyeket közzé kell tenni a Twitteren.

source: A ticket event module listening to <literal>TicketCreate</literal> can send out tweets.
hu: Egy <literal>TicketCreate</literal> eseményre figyelő jegyesemény modul képes üzeneteket kiküldeni a Twitterre.

source: No caveats are known.
hu: Nincsenek ismert ellenjavaslatok.

source: Ticket events have been available in OTRS since OTRS 2.0.
hu: A jegyesemények az OTRS 2.0 óta lettek elérhetők az OTRS-ben.

source: Ticket events available in OTRS 6.0:
hu: Az OTRS 6.0 verziójában elérhető jegyesemények:

source: Article events available in OTRS 6.0:
hu: Az OTRS 6.0 verziójában elérhető bejegyzésesemények:

source: Ticket Menu Module
hu: Jegymenü modul

source: Ticket menu modules are used to display an additional link in the menu above a ticket. You can write and register your own ticket menu module. There are 4 ticket menus (Generic, Lock, Responsible and TicketWatcher) which come with the OTRS framework. For more information please have a look at the OTRS admin manual.
hu: A jegymenü modulokat egy további hivatkozás megjelenítéséhez használják a jegy fölött lévő menüben. Megírhatja és regisztrálhatja a saját jegymenü moduljait. Négy jegymenü létezik (Általános, Zárolás, Felelős és Jegymegfigyelő), amely az OTRS keretrendszerrel érkezik. További információkért nézzen bele az OTRS adminisztrációs kézikönyvébe.

source: The ticket menu modules are located under <filename>Kernel/Output/HTML/TicketMenu*.pm</filename>. Following, there is an example of a ticket menu module. Save it under <filename>Kernel/Output/HTML/TicketMenuCustom.pm</filename>. You just need 2 functions: <code>new()</code> and <code>Run()</code>.
hu: A jegymenü modulok a <filename>Kernel/Output/HTML/TicketMenu*.pm</filename> fájlokban találhatók. A következőkben egy jegymenü modul példája található. Mentse el a <filename>Kernel/Output/HTML/TicketMenuCustom.pm</filename> helyre. Mindössze két függvényre van szüksége: <code>new()</code> és <code>Run()</code>.

source: # -- # Kernel/Output/HTML/TicketMenuCustom.pm # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: TicketMenuCustom.pm,v 1.17 2010/04/12 21:34:06 martin Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Output::HTML::TicketMenuCustom; use strict; use warnings; sub new { my ( $Type, %Param ) = @_; # allocate new hash for object my $Self = {}; bless( $Self, $Type ); # get needed objects for my $Object (qw(ConfigObject LogObject DBObject LayoutObject UserID TicketObject)) { $Self->{$Object} = $Param{$Object} || die "Got no $Object!"; } return $Self; } sub Run { my ( $Self, %Param ) = @_; # check needed stuff if ( !$Param{Ticket} ) { $Self->{LogObject}->Log( Priority => 'error', Message => 'Need Ticket!' ); return; } # check if frontend module registered, if not, do not show action if ( $Param{Config}->{Action} ) { my $Module = $Self->{ConfigObject}->Get('Frontend::Module')->{ $Param{Config}->{Action} }; return if !$Module; } # check permission my $AccessOk = $Self->{TicketObject}->Permission( Type => 'rw', TicketID => $Param{Ticket}->{TicketID}, UserID => $Self->{UserID}, LogNo => 1, ); return if !$AccessOk; # check permission if ( $Self->{TicketObject}->CustomIsTicketCustom( TicketID => $Param{Ticket}->{TicketID} ) ) { my $AccessOk = $Self->{TicketObject}->OwnerCheck( TicketID => $Param{Ticket}->{TicketID}, OwnerID => $Self->{UserID}, ); return if !$AccessOk; } # check acl return if defined $Param{ACL}->{ $Param{Config}->{Action} } && !$Param{ACL}->{ $Param{Config}->{Action} }; # if ticket is customized if ( $Param{Ticket}->{Custom} eq 'lock' ) { # if it is locked for somebody else return if $Param{Ticket}->{OwnerID} ne $Self->{UserID}; # show custom action return { %{ $Param{Config} }, %{ $Param{Ticket} }, %Param, Name => 'Custom', Description => 'Custom to give it back to the queue!', Link => 'Action=AgentTicketCustom;Subaction=Custom;TicketID=$QData{"TicketID"}', }; } # if ticket is customized return { %{ $Param{Config} }, %{ $Param{Ticket} }, %Param, Name => 'Custom', Description => 'Custom it to work on it!', Link => 'Action=AgentTicketCustom;Subaction=Custom;TicketID=$QData{"TicketID"}', }; } 1;
hu: # -- # Kernel/Output/HTML/TicketMenuCustom.pm # Copyright (C) 2001-2017 OTRS AG, http://otrs.com/ # -- # Id: TicketMenuCustom.pm,v 1.17 2010/04/12 21:34:06 martin Exp $ # -- # This software comes with ABSOLUTELY NO WARRANTY. For details, see # the enclosed file COPYING for license information (AGPL). If you # did not receive this file, see http://www.gnu.org/licenses/agpl.txt. # -- package Kernel::Output::HTML::TicketMenuCustom; use strict; use warnings; sub new { my ( $Type, %Param ) = @_; # új kivonat lefoglalása az objektumhoz my $Self = {}; bless( $Self, $Type ); # a szükséges objektumok lekérése for my $Object (qw(ConfigObject LogObject DBObject LayoutObject UserID TicketObject)) { $Self->{$Object} = $Param{$Object} || die "Nincs $Object!"; } return $Self; } sub Run { my ( $Self, %Param ) = @_; # a szükséges dolgok ellenőrzése if ( !$Param{Ticket} ) { $Self->{LogObject}->Log( Priority => 'error', Message => 'Jegy szükséges!' ); return; } # annak ellenőrzése, hogy az előtétprogram modul regisztrálva van-e, # és ha nincs, akkor ne jelenítse meg a műveletet if ( $Param{Config}->{Action} ) { my $Module = $Self->{ConfigObject}->Get('Frontend::Module')->{ $Param{Config}->{Action} }; return if !$Module; } # jogosultság ellenőrzése my $AccessOk = $Self->{TicketObject}->Permission( Type => 'rw', TicketID => $Param{Ticket}->{TicketID}, UserID => $Self->{UserID}, LogNo => 1, ); return if !$AccessOk; # jogosultság ellenőrzése if ( $Self->{TicketObject}->CustomIsTicketCustom( TicketID => $Param{Ticket}->{TicketID} ) ) { my $AccessOk = $Self->{TicketObject}->OwnerCheck( TicketID => $Param{Ticket}->{TicketID}, OwnerID => $Self->{UserID}, ); return if !$AccessOk; } # ACL ellenőrzése return if defined $Param{ACL}->{ $Param{Config}->{Action} } && !$Param{ACL}->{ $Param{Config}->{Action} }; # ha a jegy személyre van szabva if ( $Param{Ticket}->{Custom} eq 'lock' ) { # ha zárolva van valaki más számára return if $Param{Ticket}->{OwnerID} ne $Self->{UserID}; # egyéni művelet megjelenítése return { %{ $Param{Config} }, %{ $Param{Ticket} }, %Param, Name => 'Custom', Description => 'Egyéni a várólistába történő visszaadáshoz!', Link => 'Action=AgentTicketCustom;Subaction=Custom;TicketID=$QData{"TicketID"}', }; } # ha a jegy személyre van szabva return { %{ $Param{Config} }, %{ $Param{Ticket} }, %Param, Name => 'Custom', Description => 'Szabja személyre, hogy dolgozhasson vele!', Link => 'Action=AgentTicketCustom;Subaction=Custom;TicketID=$QData{"TicketID"}', }; } 1;

source: There is the need to activate your custom ticket menu module. This can be done using the XML configuration below. There may be additional parameters in the config hash for your ticket menu module.
hu: Szükség van az egyéni jegymenü modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni. Lehetnek további paraméterek is a beállítás kivonatában a jegymenü moduljánál.

source: <ConfigItem Name="Ticket::Frontend::MenuModule###110-Custom" Required="0" Valid="1"> <Description Lang="en">Module to show custom link in menu.</Description> <Description Lang="de">Mit diesem Modul wird der Custom-Link in der Linkleiste der Ticketansicht angezeigt.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Agent::Ticket::MenuModule</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::Output::HTML::TicketMenuCustom</Item> <Item Key="Name">Custom</Item> <Item Key="Action">AgentTicketCustom</Item> </Hash> </Setting> </ConfigItem>
hu: <ConfigItem Name="Ticket::Frontend::MenuModule###110-Custom" Required="0" Valid="1"> <Description Lang="en">Module to show custom link in menu.</Description> <Description Lang="hu">Egy modul egyéni hivatkozás megjelenítéséhez a menüben.</Description> <Group>Ticket</Group> <SubGroup>Frontend::Agent::Ticket::MenuModule</SubGroup> <Setting> <Hash> <Item Key="Module">Kernel::Output::HTML::TicketMenuCustom</Item> <Item Key="Name">Custom</Item> <Item Key="Action">AgentTicketCustom</Item> </Hash> </Setting> </ConfigItem>

source: Useful ticket menu implementation could be a link to a external tool if parameters (e.g. <literal>FreeTextField</literal>) have been set.
hu: Hasznos jegymenü megvalósítás lehet egy hivatkozás egy külső eszközre, ha a paraméterek (például <literal>FreeTextField</literal>) be lettek állítva.

source: The ticket menu directs to an URL that can be handled. If you want to handle that request via the OTRS framework, you have to write your own frontend module.
hu: A jegymenü egy olyan URL-re irányít, amely kezelhető. Ha ezt a kérést az OTRS keretrendszeren keresztül szeretné kezelni, akkor meg kell írnia a saját előtétprogram modulját.

source: Ticket Number Generator Modules
hu: Jegyszám előállító modulok

source: Ticket number generators are used to create distinct identifiers aka ticket number for new tickets. Any method of creating a string of numbers is possible, you should use common sense about the length of the resulting string (guideline: 5-10).
hu: A jegyszám előállítókat elkülönülő azonosítók létrehozásához használják az új jegyekhez, amelyeket jegyszámnak neveznek. Bármilyen metódus lehetséges a számok karakterláncainak létrehozásához, de a józan ész határain belül kell maradnia az eredményül kapott szöveg hosszával kapcsolatban (irányelv: 5-10).

source: When creating a ticket number, make sure the result is prefixed by the SysConfig variable <literal>SystemID</literal> in order to enable the detection of ticket numbers on inbound email responses. A ticket number generator module needs the two functions <code>TicketCreateNumber()</code> and <code>GetTNByString()</code>.
hu: Egy jegyszám létrehozásakor győződjön meg arról, hogy az eredmény megkapta-e a <literal>SystemID</literal> rendszerbeállítási változót előtagként annak érdekében, hogy engedélyezze a jegyszámok felismerését a bejövő e-mail válaszoknál. Egy jegyszám előállító modulnak a következő két függvényre van szüksége: <code>TicketCreateNumber()</code> és <code>GetTNByString()</code>.

source: The method <code>TicketCreateNumber()</code> is called without parameters and returns the new ticket number.
hu: A <code>TicketCreateNumber()</code> metódus paraméterek nélkül kerül meghívásra, és az új jegyszámot adja vissza.

source: The method <code>GetTNByString()</code> is called with the param String which contains the string to be parsed for a ticket number and returns the ticket number if found.
hu: A <code>GetTNByString()</code> metódus egy olyan szöveg paraméterrel kerül meghívásra, amely a feldolgozandó szöveget tartalmazza a jegyszámnál, és visszaadja a jegyszámot, ha megtalálta.

source: See <filename>Kernel/System/Ticket/Number/UserRandom.pm</filename> in the package <literal>TemplateModule</literal>.
hu: Nézze meg a <filename>Kernel/System/Ticket/Number/UserRandom.pm</filename> fájlt a <literal>TemplateModule</literal> csomagban.
